[
    {
        "headline": "Stock market today: Dow, S&P 500, Nasdaq muted after S&P 500 recovers all 2025 losses",
        "text": "US stocks floated higher after the S&P 500 erased its losses for 2025 the previous day."
    },
    {
        "headline": "Trump trade war with China may never be totally over: Former Commerce Secretary Wilbur Ross",
        "text": "Former US Commerce Secretary Wilbur Ross sends a sobering signal to renewed stock market bulls."
    },
    {
        "headline": "The China tariff pause has Wall Street scaling back recession calls",
        "text": "Economists believe the US will skirt a recession as lower tariffs than initially announced by the Trump administration are set to handicap consumer spending less than previously feared."
    },
    {
        "headline": "Stock market today: S&P 500 wipes out 2025 losses as Nvidia powers tech rally",
        "text": "The euphoria over the US-China trade extended for a second day as a tech rally led stocks higher on Tuesday."
    },
    {
        "headline": "Market: What technicals are signaling about stock gains to come",
        "text": "US stocks (^DJI, ^IXIC, ^GSPC) rallied with a vengeance on Monday after US and Chinese officials agreed to a 90-day tariff truce. Today, the market has a mixed response to the April CPI (Consumer Price Index) report that saw the annual inflation rate ease to 2.3%. LPL Financial Chief Equity Strategist Jeff Buchbinder sits down on Catalysts to talk more about what stock technicals and fundamentals are signaling. To watch more expert insights and analysis on the latest market action, check out more Catalysts&nbsp;here."
    },
    {
        "headline": "CPI print is 'a yawn,' signaling data is holding up despite tariffs",
        "text": "April's consumer price index (CPI) showed inflation cooled, marking the lowest annual increase since February 2021. Prairie Operating Co. executive vice president of market strategy, Lou Basenese, joins Catalysts Host Madison Mills to take a closer look at the economic data and what it means for the US economy, Wall Street, and the Federal Reserve, as well as sharing some of his top stock picks in the tech sector. To watch more expert insights and analysis on the latest market action, check out more Catalysts here."
    },
    {
        "headline": "The Best Dividend ETF to Invest $500 in Right Now",
        "text": "Currently, the Schwab ETF's yield is more than triple that of the S&P 500 average. If you're retired, or heading there soon, and you're looking for a no-hassle solution for dividend stocks, an exchange-traded fund (ETF) focused on dividends might be your best bet. You just need to take a look at how the market's been doing over the past three months to understand why dividend stocks are crucial to a safe and growing portfolio."
    },
    {
        "headline": "The U.S. market is expensive and unlikely to continue making new highs: BCA",
        "text": "Investing.com -- Despite improved trade policy sentiment and a rebound in equities, BCA Research warned in a note Wednesday that the U.S. market may struggle to sustain its upward momentum due to elevated valuations and tariff-related headwinds."
    },
    {
        "headline": "Why Halozyme Therapeutics, Inc. (HALO) Declined on Tuesday",
        "text": "We recently published an article titled Massive Sell-Offs Just Hit These 10 Stocks Today. In this article, we are going to take a look at where Halozyme Therapeutics, Inc. (NASDAQ:HALO) stands against the other stocks. Wall Street’s main indices finished mixed on Tuesday, as investors digested the country’s latest inflation figures, which came out lower than […]"
    },
    {
        "headline": "Why UnitedHealth Group Incorporated (UNH) Declined on Tuesday",
        "text": "We recently published an article titled Massive Sell-Offs Just Hit These 10 Stocks Today. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against the other stocks. Wall Street’s main indices finished mixed on Tuesday, as investors digested the country’s latest inflation figures, which came out lower than […]"
    },
    {
        "headline": "Why Xenon Pharmaceuticals Inc. (XENE) Declined on Tuesday",
        "text": "We recently published an article titled Massive Sell-Offs Just Hit These 10 Stocks Today. In this article, we are going to take a look at where Xenon Pharmaceuticals Inc. (NASDAQ:XENE) stands against the other stocks. Wall Street’s main indices finished mixed on Tuesday, as investors digested the country’s latest inflation figures, which came out lower than […]"
    },
    {
        "headline": "Why Rigetti Computing, Inc. (RGTI) Declined on Tuesday",
        "text": "We recently published an article titled Massive Sell-Offs Just Hit These 10 Stocks Today. In this article, we are going to take a look at where Rigetti Computing, Inc. (NASDAQ:RGTI) stands against the other stocks. Wall Street’s main indices finished mixed on Tuesday, as investors digested the country’s latest inflation figures, which came out lower than […]"
    },
    {
        "headline": "Zacks Industry Outlook Highlights Cardinal Health, Labcorp and Align Technology",
        "text": "Cardinal Health, Labcorp and Align Technology have been highlighted in this Industry Outlook article."
    },
    {
        "headline": "Why Oddity Tech Ltd. (ODD) Declined on Tuesday",
        "text": "We recently published an article titled Massive Sell-Offs Just Hit These 10 Stocks Today. In this article, we are going to take a look at where Oddity Tech Ltd. (NASDAQ:ODD) stands against the other stocks. Wall Street’s main indices finished mixed on Tuesday, as investors digested the country’s latest inflation figures, which came out lower than […]"
    },
    {
        "headline": "Zacks Industry Outlook Highlights CF Industries, Mosaic and Yara International",
        "text": "CF Industries, Mosaic and Yara International have been highlighted in this Industry Outlook article."
    },
    {
        "headline": "Zacks.com featured highlights StoneCo, Centene, CVS Health and Pfizer",
        "text": "StoneCo, Centene, CVS Health and Pfizer have been highlighted in this Screen of The Week article."
    },
    {
        "headline": "Stocks Set to Rise as Investors Weigh Inflation Data, Trump’s Middle-East Tour",
        "text": "Stocks were set to edge higher on Wednesday, having racked up solid gains the previous session thanks to a cooler-than-expected inflation reading and news of artificial intelligence investments from Saudi Arabia. The S&P 500 and Nasdaq both rose Tuesday after AI chip maker Nvidia said it would partner with Saudi Arabia’s state-backed Humain on a 500 megawatt data-center project. Investors will be hoping that’s a sign of things to come, with President Donald Trump on a four-day tour of the Middle East."
    },
    {
        "headline": "Why International Game Technology PLC (IGT) Declined on Tuesday",
        "text": "We recently published an article titled Massive Sell-Offs Just Hit These 10 Stocks Today. In this article, we are going to take a look at where International Game Technology PLC (NYSE:IGT) stands against the other stocks. Wall Street’s main indices finished mixed on Tuesday, as investors digested the country’s latest inflation figures, which came out […]"
    },
    {
        "headline": "Traders Await Fresh Catalysts Pre-Bell Wall Street, Asia Up, Europe Down",
        "text": "Wall Street futures pointed sideways pre-bell Wednesday, as traders awaited fresh catalysts in the w"
    },
    {
        "headline": "Why BridgeBio Pharma, Inc. (BBIO) Declined on Tuesday",
        "text": "We recently published an article titled Massive Sell-Offs Just Hit These 10 Stocks Today. In this article, we are going to take a look at where BridgeBio Pharma, Inc. (NASDAQ:BBIO) stands against the other stocks. Wall Street’s main indices finished mixed on Tuesday, as investors digested the country’s latest inflation figures, which came out lower than […]"
    },
    {
        "headline": "Stock market today: Dow, S&P 500, Nasdaq muted after S&P 500 recovers all 2025 losses",
        "text": "US stocks floated higher after the S&P 500 erased its losses for 2025 the previous day."
    },
    {
        "headline": "Trump trade war with China may never be totally over: Former Commerce Secretary Wilbur Ross",
        "text": "Former US Commerce Secretary Wilbur Ross sends a sobering signal to renewed stock market bulls."
    },
    {
        "headline": "The China tariff pause has Wall Street scaling back recession calls",
        "text": "Economists believe the US will skirt a recession as lower tariffs than initially announced by the Trump administration are set to handicap consumer spending less than previously feared."
    },
    {
        "headline": "Stock market today: S&P 500 wipes out 2025 losses as Nvidia powers tech rally",
        "text": "The euphoria over the US-China trade extended for a second day as a tech rally led stocks higher on Tuesday."
    },
    {
        "headline": "Market: What technicals are signaling about stock gains to come",
        "text": "US stocks (^DJI, ^IXIC, ^GSPC) rallied with a vengeance on Monday after US and Chinese officials agreed to a 90-day tariff truce. Today, the market has a mixed response to the April CPI (Consumer Price Index) report that saw the annual inflation rate ease to 2.3%. LPL Financial Chief Equity Strategist Jeff Buchbinder sits down on Catalysts to talk more about what stock technicals and fundamentals are signaling. To watch more expert insights and analysis on the latest market action, check out more Catalysts&nbsp;here."
    },
    {
        "headline": "CPI print is 'a yawn,' signaling data is holding up despite tariffs",
        "text": "April's consumer price index (CPI) showed inflation cooled, marking the lowest annual increase since February 2021. Prairie Operating Co. executive vice president of market strategy, Lou Basenese, joins Catalysts Host Madison Mills to take a closer look at the economic data and what it means for the US economy, Wall Street, and the Federal Reserve, as well as sharing some of his top stock picks in the tech sector. To watch more expert insights and analysis on the latest market action, check out more Catalysts here."
    },
    {
        "headline": "The Best Dividend ETF to Invest $500 in Right Now",
        "text": "Currently, the Schwab ETF's yield is more than triple that of the S&P 500 average. If you're retired, or heading there soon, and you're looking for a no-hassle solution for dividend stocks, an exchange-traded fund (ETF) focused on dividends might be your best bet. You just need to take a look at how the market's been doing over the past three months to understand why dividend stocks are crucial to a safe and growing portfolio."
    },
    {
        "headline": "The U.S. market is expensive and unlikely to continue making new highs: BCA",
        "text": "Investing.com -- Despite improved trade policy sentiment and a rebound in equities, BCA Research warned in a note Wednesday that the U.S. market may struggle to sustain its upward momentum due to elevated valuations and tariff-related headwinds."
    },
    {
        "headline": "Why Halozyme Therapeutics, Inc. (HALO) Declined on Tuesday",
        "text": "We recently published an article titled Massive Sell-Offs Just Hit These 10 Stocks Today. In this article, we are going to take a look at where Halozyme Therapeutics, Inc. (NASDAQ:HALO) stands against the other stocks. Wall Street’s main indices finished mixed on Tuesday, as investors digested the country’s latest inflation figures, which came out lower than […]"
    },
    {
        "headline": "Why UnitedHealth Group Incorporated (UNH) Declined on Tuesday",
        "text": "We recently published an article titled Massive Sell-Offs Just Hit These 10 Stocks Today. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against the other stocks. Wall Street’s main indices finished mixed on Tuesday, as investors digested the country’s latest inflation figures, which came out lower than […]"
    },
    {
        "headline": "Why Xenon Pharmaceuticals Inc. (XENE) Declined on Tuesday",
        "text": "We recently published an article titled Massive Sell-Offs Just Hit These 10 Stocks Today. In this article, we are going to take a look at where Xenon Pharmaceuticals Inc. (NASDAQ:XENE) stands against the other stocks. Wall Street’s main indices finished mixed on Tuesday, as investors digested the country’s latest inflation figures, which came out lower than […]"
    },
    {
        "headline": "Why Rigetti Computing, Inc. (RGTI) Declined on Tuesday",
        "text": "We recently published an article titled Massive Sell-Offs Just Hit These 10 Stocks Today. In this article, we are going to take a look at where Rigetti Computing, Inc. (NASDAQ:RGTI) stands against the other stocks. Wall Street’s main indices finished mixed on Tuesday, as investors digested the country’s latest inflation figures, which came out lower than […]"
    },
    {
        "headline": "Zacks Industry Outlook Highlights Cardinal Health, Labcorp and Align Technology",
        "text": "Cardinal Health, Labcorp and Align Technology have been highlighted in this Industry Outlook article."
    },
    {
        "headline": "Why Oddity Tech Ltd. (ODD) Declined on Tuesday",
        "text": "We recently published an article titled Massive Sell-Offs Just Hit These 10 Stocks Today. In this article, we are going to take a look at where Oddity Tech Ltd. (NASDAQ:ODD) stands against the other stocks. Wall Street’s main indices finished mixed on Tuesday, as investors digested the country’s latest inflation figures, which came out lower than […]"
    },
    {
        "headline": "Zacks Industry Outlook Highlights CF Industries, Mosaic and Yara International",
        "text": "CF Industries, Mosaic and Yara International have been highlighted in this Industry Outlook article."
    }
]