[
    {
        "headline": "A 'Magnificent' China reset reignites the tech trade",
        "text": "A US-China trade war thaw is heating up the Magnificent Seven."
    },
    {
        "headline": "Mag 7 rally, airline & pharmaceutical stocks: Trending Tickers",
        "text": "The \"Magnificent Seven,\" made up of Nvidia (NVDA), Alphabet (GOOG, GOOGL), Tesla (TSLA), Microsoft (MSFT), Amazon (AMZN), Meta (META), and Apple (AAPL), are rallying after the US and China agreed to lower tariff rates for a 90-day period. Airline stocks, like American Airlines (AAL), Delta (DAL), and United Airlines (UAL), are also gaining on the trade deal. Pharmacy stocks, including Eli Lilly (LLY), Johnson & Johnson (JNJ), and Merck (MRK), are moving to the downside after US President Trump said he will cut drug prices by over 50%. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here."
    },
    {
        "headline": "Microsoft facing multibillion-pound legal claim over software licence pricing",
        "text": "The class action claim accuses the tech giant of overcharging for licences for Microsoft software products."
    },
    {
        "headline": "Advanced Micro Devices Stock (AMD) Stuck in Neutral as AI Boom Accelerates",
        "text": "Advanced Micro Devices (AMD) has been a disappointing stock over the past year, with declines accelerating in the last five months. Since May 2024, AMD has been down almost 32%. Amid growing concerns about demand for AI infrastructure chips, AMD has also struggled with a lack of competitiveness in absorbing that demand. Even after posting a beat across the board in its Q1 earnings last week and supplementing that with raised Q2 guidance, there are still no strong signs of a reversal in the beari"
    },
    {
        "headline": "Update: Market Chatter: Microsoft, OpenAI Negotiating to Unlock New Financing, Future IPO for ChatGPT Parent",
        "text": "(Updates with Microsoft's comment in the fifth paragraph.) Microsoft (MSFT) and OpenAI are rewrit"
    },
    {
        "headline": "Microsoft (MSFT) Is Cool Letting Go of OpenAI Shares--As Long as It Gets the Goods",
        "text": "The tech giant's not sweating ownership--just wants dibs on the next-gen AI"
    },
    {
        "headline": "Popular YouTuber Coffeezilla Is Puzzled By Bill Gates' Philanthropy Plans—'I've Been Hearing This For 15 Years And Every Year Bill Has More'",
        "text": "Bill Gates, the co-founder of Microsoft (NASDAQ:MSFT) and a tech industry titan, recently announced plans to give away 99% of his wealth by 2045, but not everyone is convinced. The billionaire, who became the world's youngest self-made billionaire at age 31 in 1987 and the first centibillionaire in 1999, currently holds a net worth of $113 billion, making him the 13th-richest person in the world, according to Forbes. Don't Miss: ‘Scrolling To UBI' — Deloitte's #1 fastest-growing software company"
    },
    {
        "headline": "Microsoft Is Renegotiating OpenAI Partnership for Future IPO. What It Means for the Stock.",
        "text": "Microsoft stock rose on Monday after a report that the company was revising the terms of its partnership with OpenAI to allow the ChatGPT maker to launch an initial public offering. The companies also are rewriting the terms of a wider contract that was drafted when Microsoft and OpenAI first unveiled an exclusive partnership in 2019, the Financial Times reported, citing people familiar with the matter. OpenAI didn’t immediately respond to a request for comment from Barron’s; Microsoft, through a spokesperson, declined to comment."
    },
    {
        "headline": "Bill Gates says businesses need to understand the politics for the next 20 years, not just the next two days",
        "text": "Microsoft co-founder Bill Gates said AI is already reshaping the job sector and Trump's tariff uncertainty is adding further fuel to the fire."
    },
    {
        "headline": "The Zacks Analyst Blog Highlights Five9, Affirm, Microsoft, Juniper Networks and Tyler",
        "text": "Five9, Affirm, Microsoft, Juniper Networks and Tyler are included in this Analyst Blog."
    },
    {
        "headline": "GOOGL, META, MSFT: 3 Promising AI Giants With Attractive Valuations",
        "text": "Three promising generative AI behemoths in focus are: GOOGL, META, MSFT."
    },
    {
        "headline": "Zacks Investment Ideas feature highlights: Microsoft, Nvidia and Palantir",
        "text": "Microsoft, Nvidia and Palantir have been highlighted in this Investment Ideas article."
    },
    {
        "headline": "Microsoft, EFM ink forestry-based carbon removal deal",
        "text": "The carbon offtake deal with the forest investment and management firm will provide the tech giant 700,000 nature-based credits through 2035."
    },
    {
        "headline": "Market Chatter: Microsoft, OpenAI Negotiating to Unlock New Financing, Future IPO for ChatGPT Parent",
        "text": "Microsoft (MSFT) and OpenAI are rewriting the terms of their partnership in a negotiation aimed at e"
    },
    {
        "headline": "Israeli quantum computing firm Classiq raises $110 million in private funding",
        "text": "JERUSALEM (Reuters) -Israeli quantum computing startup Classiq has raised $110 million in a mid-stage private funding round, it said on Monday, bringing its total fundraising to $173 million. Quantum computing holds the promise of carrying out calculations that would take today’s systems millions of years, and could unlock discoveries in medicine, chemistry and many other fields. Classiq's latest funding round was led by Entree Capital, with participation from Norwest, NightDragon, Hamilton Lane, Clal, Neva SGR, Phoenix, Team8, IN Venture, Wing, HSBC, Samsung Next and QBeat, as well as other new and existing investors, it said."
    },
    {
        "headline": "How 'negative' sentiment is driving defensive tech bets",
        "text": "Tech stocks have clawed back some recent losses, but uncertainty around tariffs is keeping investors cautious. Baird Tech Strategist Ted Mortonson joins Market Domination to break down the shift in sentiment, highlighting why some still see big names like Microsoft (MSFT) and Amazon (AMZN) as relatively safe bets. To watch more expert insights and analysis on the latest market action, check out more Market Domination&nbsp;here."
    },
    {
        "headline": "3 Things Alphabet's Management Just Said That Should Make Tesla and Nvidia Investors Happy",
        "text": "Alphabet is also exploring the option of allowing personal ownership of robotaxis. Spending on data centers continues to be robust. Here's a look at three discussion points from the earnings call that are great news for Tesla (NASDAQ: TSLA) and Nvidia (NASDAQ: NVDA) investors."
    },
    {
        "headline": "This Artificial Intelligence (AI) Software Stock -- a 1,090% Gainer Since Its IPO -- Could Soar Another 285%, According to Dan Ives. Is It Time to Buy Like There's No Tomorrow?",
        "text": "Palantir Technologies stock has risen exponentially over the last few years thanks to soaring demand for its AI software."
    },
    {
        "headline": "OpenAI and Microsoft renegotiate multibillion-dollar partnership terms - report",
        "text": "Investing.com -- OpenAI and Microsoft Corporation (NASDAQ:MSFT) are currently in discussions to revise the terms of their multibillion-dollar partnership, according to a Financial Times report on Sunday."
    },
    {
        "headline": "Prediction: This Artificial Intelligence (AI) Semiconductor Stock Will Soar After May 28",
        "text": "Most of the major players in the AI landscape have already delivered their Q1 earnings reports -- but Nvidia's results are still to come."
    },
    {
        "headline": "A 'Magnificent' China reset reignites the tech trade",
        "text": "A US-China trade war thaw is heating up the Magnificent Seven."
    },
    {
        "headline": "Mag 7 rally, airline & pharmaceutical stocks: Trending Tickers",
        "text": "The \"Magnificent Seven,\" made up of Nvidia (NVDA), Alphabet (GOOG, GOOGL), Tesla (TSLA), Microsoft (MSFT), Amazon (AMZN), Meta (META), and Apple (AAPL), are rallying after the US and China agreed to lower tariff rates for a 90-day period. Airline stocks, like American Airlines (AAL), Delta (DAL), and United Airlines (UAL), are also gaining on the trade deal. Pharmacy stocks, including Eli Lilly (LLY), Johnson & Johnson (JNJ), and Merck (MRK), are moving to the downside after US President Trump said he will cut drug prices by over 50%. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here."
    },
    {
        "headline": "Microsoft facing multibillion-pound legal claim over software licence pricing",
        "text": "The class action claim accuses the tech giant of overcharging for licences for Microsoft software products."
    },
    {
        "headline": "Advanced Micro Devices Stock (AMD) Stuck in Neutral as AI Boom Accelerates",
        "text": "Advanced Micro Devices (AMD) has been a disappointing stock over the past year, with declines accelerating in the last five months. Since May 2024, AMD has been down almost 32%. Amid growing concerns about demand for AI infrastructure chips, AMD has also struggled with a lack of competitiveness in absorbing that demand. Even after posting a beat across the board in its Q1 earnings last week and supplementing that with raised Q2 guidance, there are still no strong signs of a reversal in the beari"
    },
    {
        "headline": "Update: Market Chatter: Microsoft, OpenAI Negotiating to Unlock New Financing, Future IPO for ChatGPT Parent",
        "text": "(Updates with Microsoft's comment in the fifth paragraph.) Microsoft (MSFT) and OpenAI are rewrit"
    }
]