[
    {
        "headline": "US retail sales, tech pulls back from rally: Market Takeaways",
        "text": "Thursday's market close saw the Nasdaq Composite (^IXIC) end its six-day win streak, while the Dow Jones Industrial Average (^DJI) and S&P 500 (^GSPC) stayed afloat in positive territory for the session. Yahoo Finance markets reporter Josh Schafer explains several key trading themes seen today, including US retail sales indicators and the tech sector pulling away from the market rally. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend&nbsp;here."
    },
    {
        "headline": "Stock market today: Dow jumps, Nasdaq snaps 6-day win streak as Walmart previews tariff-fueled price hikes",
        "text": "Investors digested fresh retail sales, wholesale inflation data, and an update from Walmart for clues about the health of the economy."
    },
    {
        "headline": "Retail sales slow sharply in April as pre-tariff spending burst reverses",
        "text": "Thursday's retail sales report comes as investors continue to search for clues on how President Trump's tariffs may impact consumer spending."
    },
    {
        "headline": "How to think about options trade coming off market turbulence",
        "text": "Moomoo CEO Neil McDonald comes on Market Domination to speak on options trading strategies, especially coming off of the latest market rally (^DJI, ^IXIC, ^GSPC) and cooling volatility levels tied to the 90-day pause on tariffs between the US and China. To watch more expert insights and analysis on the latest market action, check out more Market Domination&nbsp;here."
    },
    {
        "headline": "S&P 500 Extends Rally, Nasdaq Snaps Winning Streak Amid Macro Data, Powell's Remarks",
        "text": "The S&P 500 rose for the fourth straight day on Thursday, while the Nasdaq Composite posted its firs"
    },
    {
        "headline": "Equity Markets Close Mixed as Investors Weigh Soft US Retail Sales, Surprise PPI Drop",
        "text": "US benchmark equity indexes closed mixed Thursday as investors parsed April's flat retail sales and"
    },
    {
        "headline": "How major US stock indexes fared Thursday, 5/15/2025",
        "text": "The S&P 500 rose 0.4% Thursday, enough to extend its winning streak to a fourth day and to pull within 3.7% of its record. The Dow Jones Industrial Average added 0.6%, and the Nasdaq composite fell 0.2%. The Nasdaq composite fell 34.49 points, or 0.2%, to 19,112.32."
    },
    {
        "headline": "TSX Closer: The Index Closes at a Record High as Tariff Relief Rally Continues",
        "text": "The Toronto Stock Exchange closed at a record high on Thursday, rising for an eighth-straight sessio"
    },
    {
        "headline": "S&P 500 Gains for 4th Day. Tech Rally Stalls.",
        "text": "The Nasdaq Composite fell for the first time in more than a week as a rally in large technology stocks stalled on Thursday. The S&P 500 was up 0.3%, bringing its winning streak to four days. The Nasdaq Composite dropped 0.3%, snapping its winning streak at six sessions."
    },
    {
        "headline": "Equity Markets Mixed After US April Retail Sales Remain Flat",
        "text": "US benchmark equity indexes are on track to close mixed on Thursday after government data showed fla"
    },
    {
        "headline": "Why Oklo Stock Is Soaring This Week",
        "text": "Oklo reported its Q1 earnings, beating Wall Street's targets. The company maintained guidance and says it is still on track to launch its small-scale nuclear reactor no later than early 2028. The company adds a long-time industry leader as chief technology officer."
    },
    {
        "headline": "CRTO & RNG Look Good Despite Software & Services Weakness",
        "text": "The Internet-Software & Services industry is struggling because of persistent economic weakness. Stocks like CRTO and RNG are a step ahead."
    },
    {
        "headline": "Stock Market Breadth Is Great. The Mag 7 Are Dragging.",
        "text": "The stock market was rising on Thursday without help from the Magnificent Seven stocks. The S&P 500 was up 0.3%; 337 of its member stocks were on the rise. The Invesco S&P 500 Equal Weight ETF, which gives us a look at the index if every stock had the same pull regardless of market cap, was up 0."
    },
    {
        "headline": "Equities Rise Intraday as Markets Weigh Macro Data, Fed Chair's Comments",
        "text": "US benchmark equity indexes were higher intraday as Wall Street parsed latest economic data and rema"
    },
    {
        "headline": "Espey Stock Gains 16% on Q3 Earnings Up Y/Y, Backlog Hits $138 Million",
        "text": "ESP reports strong Q3 earnings with $138 million backlog, boosted by rising defense demand while navigating cost pressures and focusing on margin improvements."
    },
    {
        "headline": "Comstock Shares Decline 17% Despite Y/Y Increase in Q1 Earnings",
        "text": "CHCI reports a significant year-over-year surge in Q1 earnings per share, driven by fee-based revenue growth and strong leasing momentum, partly offset by rising costs."
    },
    {
        "headline": "Why Coinbase (COIN) Shares Are Falling Today",
        "text": "Shares of blockchain infrastructure company Coinbase (NASDAQ:COIN) fell 5% in the afternoon session after the company announced it got emails from hackers who claimed they broke into user accounts, accessed customer data, found internal documents, and took notes tied to help desk tools and account management systems."
    },
    {
        "headline": "Why Alibaba Stock Is Sinking Today",
        "text": "Alibaba reported its latest quarterly earnings, missing big on its top and bottom lines. The company's core business is growing, but more slowly than expected, due mainly to instability in the Chinese economy. Shares of Alibaba (NYSE: BABA) are plunging on Thursday."
    },
    {
        "headline": "Crimson Wine Group Incurs Loss in Q1 as Sales Decline 9% Y/Y",
        "text": "Wholesale softness, higher inventory write-downs and export challenges weigh on Crimson Wine Group's Q1 results despite stable DTC performance."
    },
    {
        "headline": "SandRidge Q1 Earnings Rise Y/Y on Strong Production & Gas Prices",
        "text": "SD posts strong Q1 results with 41% revenue growth, higher gas prices, and increased output driving earnings and free cash flow gains."
    },
    {
        "headline": "US retail sales, tech pulls back from rally: Market Takeaways",
        "text": "Thursday's market close saw the Nasdaq Composite (^IXIC) end its six-day win streak, while the Dow Jones Industrial Average (^DJI) and S&P 500 (^GSPC) stayed afloat in positive territory for the session. Yahoo Finance markets reporter Josh Schafer explains several key trading themes seen today, including US retail sales indicators and the tech sector pulling away from the market rally. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend&nbsp;here."
    },
    {
        "headline": "Stock market today: Dow jumps, Nasdaq snaps 6-day win streak as Walmart previews tariff-fueled price hikes",
        "text": "Investors digested fresh retail sales, wholesale inflation data, and an update from Walmart for clues about the health of the economy."
    },
    {
        "headline": "Retail sales slow sharply in April as pre-tariff spending burst reverses",
        "text": "Thursday's retail sales report comes as investors continue to search for clues on how President Trump's tariffs may impact consumer spending."
    },
    {
        "headline": "How to think about options trade coming off market turbulence",
        "text": "Moomoo CEO Neil McDonald comes on Market Domination to speak on options trading strategies, especially coming off of the latest market rally (^DJI, ^IXIC, ^GSPC) and cooling volatility levels tied to the 90-day pause on tariffs between the US and China. To watch more expert insights and analysis on the latest market action, check out more Market Domination&nbsp;here."
    },
    {
        "headline": "S&P 500 Extends Rally, Nasdaq Snaps Winning Streak Amid Macro Data, Powell's Remarks",
        "text": "The S&P 500 rose for the fourth straight day on Thursday, while the Nasdaq Composite posted its firs"
    },
    {
        "headline": "Equity Markets Close Mixed as Investors Weigh Soft US Retail Sales, Surprise PPI Drop",
        "text": "US benchmark equity indexes closed mixed Thursday as investors parsed April's flat retail sales and"
    },
    {
        "headline": "How major US stock indexes fared Thursday, 5/15/2025",
        "text": "The S&P 500 rose 0.4% Thursday, enough to extend its winning streak to a fourth day and to pull within 3.7% of its record. The Dow Jones Industrial Average added 0.6%, and the Nasdaq composite fell 0.2%. The Nasdaq composite fell 34.49 points, or 0.2%, to 19,112.32."
    },
    {
        "headline": "TSX Closer: The Index Closes at a Record High as Tariff Relief Rally Continues",
        "text": "The Toronto Stock Exchange closed at a record high on Thursday, rising for an eighth-straight sessio"
    },
    {
        "headline": "S&P 500 Gains for 4th Day. Tech Rally Stalls.",
        "text": "The Nasdaq Composite fell for the first time in more than a week as a rally in large technology stocks stalled on Thursday. The S&P 500 was up 0.3%, bringing its winning streak to four days. The Nasdaq Composite dropped 0.3%, snapping its winning streak at six sessions."
    },
    {
        "headline": "Equity Markets Mixed After US April Retail Sales Remain Flat",
        "text": "US benchmark equity indexes are on track to close mixed on Thursday after government data showed fla"
    },
    {
        "headline": "Why Oklo Stock Is Soaring This Week",
        "text": "Oklo reported its Q1 earnings, beating Wall Street's targets. The company maintained guidance and says it is still on track to launch its small-scale nuclear reactor no later than early 2028. The company adds a long-time industry leader as chief technology officer."
    },
    {
        "headline": "CRTO & RNG Look Good Despite Software & Services Weakness",
        "text": "The Internet-Software & Services industry is struggling because of persistent economic weakness. Stocks like CRTO and RNG are a step ahead."
    },
    {
        "headline": "Stock Market Breadth Is Great. The Mag 7 Are Dragging.",
        "text": "The stock market was rising on Thursday without help from the Magnificent Seven stocks. The S&P 500 was up 0.3%; 337 of its member stocks were on the rise. The Invesco S&P 500 Equal Weight ETF, which gives us a look at the index if every stock had the same pull regardless of market cap, was up 0."
    },
    {
        "headline": "Equities Rise Intraday as Markets Weigh Macro Data, Fed Chair's Comments",
        "text": "US benchmark equity indexes were higher intraday as Wall Street parsed latest economic data and rema"
    },
    {
        "headline": "Espey Stock Gains 16% on Q3 Earnings Up Y/Y, Backlog Hits $138 Million",
        "text": "ESP reports strong Q3 earnings with $138 million backlog, boosted by rising defense demand while navigating cost pressures and focusing on margin improvements."
    },
    {
        "headline": "Comstock Shares Decline 17% Despite Y/Y Increase in Q1 Earnings",
        "text": "CHCI reports a significant year-over-year surge in Q1 earnings per share, driven by fee-based revenue growth and strong leasing momentum, partly offset by rising costs."
    },
    {
        "headline": "Why Coinbase (COIN) Shares Are Falling Today",
        "text": "Shares of blockchain infrastructure company Coinbase (NASDAQ:COIN) fell 5% in the afternoon session after the company announced it got emails from hackers who claimed they broke into user accounts, accessed customer data, found internal documents, and took notes tied to help desk tools and account management systems."
    },
    {
        "headline": "Why Alibaba Stock Is Sinking Today",
        "text": "Alibaba reported its latest quarterly earnings, missing big on its top and bottom lines. The company's core business is growing, but more slowly than expected, due mainly to instability in the Chinese economy. Shares of Alibaba (NYSE: BABA) are plunging on Thursday."
    },
    {
        "headline": "Crimson Wine Group Incurs Loss in Q1 as Sales Decline 9% Y/Y",
        "text": "Wholesale softness, higher inventory write-downs and export challenges weigh on Crimson Wine Group's Q1 results despite stable DTC performance."
    },
    {
        "headline": "SandRidge Q1 Earnings Rise Y/Y on Strong Production & Gas Prices",
        "text": "SD posts strong Q1 results with 41% revenue growth, higher gas prices, and increased output driving earnings and free cash flow gains."
    },
    {
        "headline": "Why This Medical Equipment Stock Is Today’s S&P 500 Winner",
        "text": "Steris beat quarter.y earnings and revenue expectations and got a price target boost from Morgan Stanley."
    },
    {
        "headline": "Netflix Nears $500 Billion Market Cap. Why Its Stock Is Still a Buy Even at These Levels.",
        "text": "Netflix shares have jumped 23% since April 2, outperforming the S&P 500 due to its resilience to trade tensions. Despite a high valuation, Netflix’s potential for rapid earnings growth could make it a worthwhile investment. In a market that has felt like a horror show for much of 2025, Netflix has been one of the few feel-good stories in town."
    },
    {
        "headline": "US Equity Indexes Mixed in Midday Trading as Producer Price Inflation Eases",
        "text": "US equity indexes were mixed in midday trading on Thursday after wholesale price inflation unexpecte"
    },
    {
        "headline": "NeurAxis Stock Gains Following Strong Q1 Earnings and FDA Milestones",
        "text": "NRXS posts strong first-quarter 2025 earnings with robust revenue growth and FDA milestones, driving stock gains as investors eye broader insurance coverage and market expansion."
    },
    {
        "headline": "BKTI Stock Gains Post Strong Q1 Earnings, Margins and Radio Demand",
        "text": "BK Technologies delivered strong first-quarter 2025 results with rising EPS and margins, driven by robust radio sales and cost controls."
    },
    {
        "headline": "Why UnitedHealth Stock Is Imploding Today",
        "text": "UnitedHealth is reportedly under criminal investigation by the DOJ for Medicare fraud. The DOJ is already investigating the company in a civil suit. Shares of UnitedHealth Group (NYSE: UNH) are falling on Thursday."
    },
    {
        "headline": "Omnicom (OMC) Up 6.7% Since Last Earnings Report: Can It Continue?",
        "text": "Omnicom (OMC) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues."
    },
    {
        "headline": "Why Is Citigroup (C) Up 21.2% Since Last Earnings Report?",
        "text": "Citigroup (C) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues."
    },
    {
        "headline": "Stocks Waver. Inflation Headlines Are Sending Wall Street Mixed Signals.",
        "text": "Stocks were posting muted gains on Thursday after the latest inflation headlines sent Wall Street mixed signals on how prices are being impacted by the rollout of tariffs across the globe. The Dow was up 75 points, or 0.2%, after trading lower this morning. The Nasdaq Composite was down 0.3%."
    },
    {
        "headline": "5 Stocks to Watch From the Prospering Multiline Insurance Industry",
        "text": "Better pricing, product redesigns, technological advancements and improving inflation are expected to aid multiline insurers like MET, AIG, PFG, EG and AIZ."
    },
    {
        "headline": "Billionaire Steven Cohen sends hard-nosed message on US economy, stocks",
        "text": "The legendary hedge fund manager offered up a stock market and recession forecast."
    },
    {
        "headline": "5 Technology Stocks Powering S&P 500 ETF",
        "text": "The S&P 500 returns to positive territory in 2025, driven by tech stocks. We highlight five tech stocks leading the rally in the ETF."
    },
    {
        "headline": "Cathie Wood Is Selling Palantir Stock. Should You?",
        "text": "Cathie Wood of Ark Invest just sold over 1 million shares of Palantir."
    },
    {
        "headline": "3 Film & Television Production Stocks to Watch Amid Dull Industry Trends",
        "text": "Film and television production and distribution companies like LYV, TKO and CURI are thriving due to the heightened consumption of digital entertainment despite heavy spending on original programming and exclusive rights."
    },
    {
        "headline": "3 Foreign Auto Stocks to Remain Resilient Amid Economic Uncertainty",
        "text": "While the Zacks Foreign Auto industry is struggling with economic uncertainty, stocks like TM, HMC and NIO are expected to hold their grounds."
    }
]