[
    {
        "headline": "Judge pressures Apple to approve Fortnite or return to court",
        "text": "A federal judge is asking Apple to approve Fortnite's submission on the U.S. App Store or return to court to explain the legal basis as to why it has not done so. In a new filing, U.S. District Judge Yvonne Gonzalez Rogers confirms the court has received Epic Games' latest motion, where it demands that Apple approve Fortnite for distribution on the App Store. The clearly annoyed judge asks Apple to show the court the \"legal authority upon which Apple contends that it can ignore this Court's orde"
    },
    {
        "headline": "Ex-Siri head reportedly wanted Apple to choose Google's Gemini over ChatGPT",
        "text": "Former Siri head John Giannandrea pushed Apple to choose Google's Gemini chatbot over ChatGPT for the first chatbot integration with Siri last year, according to a Bloomberg report looking at Apple's uneven AI efforts. Giannandrea, an ex-Google executive who was demoted in a leadership reshuffle in March, thought that OpenAI's bot wouldn't have staying power and wasn't protective of sensitive personal data. Despite these concerns, Apple announced ChatGPT's integration at WWDC in 2024 and made th"
    },
    {
        "headline": "Chinese smartphone exports to US plunge to lowest since 2011",
        "text": "(Bloomberg) -- Chinese shipments of Apple Inc.’s iPhone and other mobile devices to the US dived to their lowest levels since 2011 in April, underscoring how the threat of US tariffs choked off the flow of big-ticket goods between the world’s two largest economies.Most Read from BloombergAmerica, ‘Nation of Porches’NJ Transit Train Engineers Strike, Disrupting Travel to NYCNJ Transit Makes Deal With Engineers, Ending Three-Day StrikeNYC Commuters Brace for Chaos as NJ Transit Strike LoomsSmartph"
    },
    {
        "headline": "Apple supplier Foxconn to invest $1.5 billion in India unit",
        "text": "Apple supplier Foxconn will invest 1.5 billion rupees in its India unit"
    },
    {
        "headline": "Sector Update: Tech Stocks Retreat Late Afternoon",
        "text": "Tech stocks were lower in late Monday afternoon trading, with the Technology Select Sector SPDR Fund"
    },
    {
        "headline": "Alibaba Tumbles as Apple AI Pact Faces Scrutiny",
        "text": "Alibaba stock falls sharply as White House questions iPhone AI integration in China"
    },
    {
        "headline": "Apple Struggles to Crack AI",
        "text": "Apple is struggling to keep up with rivals in artificial intelligence. Bloomberg's Mark Gurman explains how the iPhone maker fell so far behind. He speaks with Ed Ludlow on \"Bloomberg Technology.\""
    },
    {
        "headline": "Apple Risks $27 Billion in Services Revenue, Evercore Says",
        "text": "DOJ's Google suit and Epic ruling threaten billions in search and fee income"
    },
    {
        "headline": "Apple vs. HP: Which PC Maker Stock is a Better Buy Right Now?",
        "text": "AAPL or HPQ, which PC maker is a better pick, given the strong demand for AI-powered devices amid a challenging macroeconomic environment?"
    },
    {
        "headline": "Alibaba Stock Falls On Report That Apple AI Partnership Is Under Scrutiny",
        "text": "Alibaba Group stock slipped Monday on a report that its partnership with Apple to power AI features on iPhone in China is under U.S. scrutiny. New China consumer spending data also raised potential concerns for Alibaba's giant e-commerce business. The Trump administration and congressional officials have been scrutinizing Apple's plan to use Alibaba's algorithms on iPhones in China, according to a Saturday report from the New York Times."
    },
    {
        "headline": "Apple Stock Faces Major Legal Risks. Here’s How Bad It Could Get, Says Analyst.",
        "text": "Evercore’s Amit Daryanani says Apple faces a threat to around 20% of its earnings if two legal threats turn out badly."
    },
    {
        "headline": "Magnificent 7 Trades at Seven-Year Low Valuation",
        "text": "Goldman's model shows Magnificent 7 trading modestly below fundamental strength metrics"
    },
    {
        "headline": "Apple Inc. (AAPL) Faces AI Roadblock as Competition Heats Up",
        "text": "Apple Inc. (NASDAQ:AAPL) is facing an Artificial Intelligence (AI) dilemma. Although a pioneer of the tech industry, APPL has been struggling with AI integration, which risks undermining its SMART-Phone market dominance. As per a report on Bloomberg on Sunday, April 16, 2025 (citing people familiar with Apple Inc. (NASDAQ:AAPL) internal processes), the tech giant has experienced […]"
    },
    {
        "headline": "Warren Buffett Stocks: Berkshire Exits Citi, Nu Holdings; Cuts These Names",
        "text": "Warren Buffett stocks shift as Berkshire Hathaway exits Citi, Nu Holdings, reduces stakes in Bank of America, Capital One among Q1 moves."
    },
    {
        "headline": "Alibaba Fall After U.S. Throws Wrench in Apple's China AI Deal",
        "text": "Washington's intervention may not just stall a tech partnership--it could reshape Apple's entire future in China."
    },
    {
        "headline": "Apple remains under-owned vs. peers, Meta still over-held - Morgan Stanley",
        "text": "Investing.com -- Apple remains the most under-owned mega-cap tech stock among large institutions, while Meta (NASDAQ:META) continues to be over-held, according to Morgan Stanley’s latest analysis of first-quarter 13-F filings."
    },
    {
        "headline": "Zacks Investment Ideas feature highlights: Arista Networks, Apple and Applied Industrial Technologies",
        "text": "Arista Networks, Apple and Applied Industrial Technologies are part of the Zacks Investment Ideas article."
    },
    {
        "headline": "Alibaba (BABA) Shares Tumble 5% as U.S. Probes Apple AI Deal",
        "text": "Regulatory Alarm Over AI Pact Sparks Alibaba Crash"
    },
    {
        "headline": "Market Chatter: Apple Facing US Scrutiny Over Potential AI Deal With Alibaba",
        "text": "Apple (AAPL) is facing scrutiny from the White House and congressional officials over its plan to us"
    },
    {
        "headline": "Missed Out on Apple in 2012? Buying Nvidia Stock Today Could Be Your Second Chance",
        "text": "Nvidia has a number of things today in common with Apple in 2012. Thus far, Nvidia (NASDAQ: NVDA) has been the biggest beneficiary of this boom, and it's easy to see why. Nvidia dominates market share of data center GPUs, a technology the company has been advancing for decades through innovations like its CUDA programming language that makes it easy for developers to write code that can be run directly on Nvidia's GPUs, and build high-performance applications."
    },
    {
        "headline": "Judge pressures Apple to approve Fortnite or return to court",
        "text": "A federal judge is asking Apple to approve Fortnite's submission on the U.S. App Store or return to court to explain the legal basis as to why it has not done so. In a new filing, U.S. District Judge Yvonne Gonzalez Rogers confirms the court has received Epic Games' latest motion, where it demands that Apple approve Fortnite for distribution on the App Store. The clearly annoyed judge asks Apple to show the court the \"legal authority upon which Apple contends that it can ignore this Court's orde"
    },
    {
        "headline": "Ex-Siri head reportedly wanted Apple to choose Google's Gemini over ChatGPT",
        "text": "Former Siri head John Giannandrea pushed Apple to choose Google's Gemini chatbot over ChatGPT for the first chatbot integration with Siri last year, according to a Bloomberg report looking at Apple's uneven AI efforts. Giannandrea, an ex-Google executive who was demoted in a leadership reshuffle in March, thought that OpenAI's bot wouldn't have staying power and wasn't protective of sensitive personal data. Despite these concerns, Apple announced ChatGPT's integration at WWDC in 2024 and made th"
    },
    {
        "headline": "Chinese smartphone exports to US plunge to lowest since 2011",
        "text": "(Bloomberg) -- Chinese shipments of Apple Inc.’s iPhone and other mobile devices to the US dived to their lowest levels since 2011 in April, underscoring how the threat of US tariffs choked off the flow of big-ticket goods between the world’s two largest economies.Most Read from BloombergAmerica, ‘Nation of Porches’NJ Transit Train Engineers Strike, Disrupting Travel to NYCNJ Transit Makes Deal With Engineers, Ending Three-Day StrikeNYC Commuters Brace for Chaos as NJ Transit Strike LoomsSmartph"
    },
    {
        "headline": "Apple supplier Foxconn to invest $1.5 billion in India unit",
        "text": "Apple supplier Foxconn will invest 1.5 billion rupees in its India unit"
    },
    {
        "headline": "Sector Update: Tech Stocks Retreat Late Afternoon",
        "text": "Tech stocks were lower in late Monday afternoon trading, with the Technology Select Sector SPDR Fund"
    },
    {
        "headline": "Alibaba Tumbles as Apple AI Pact Faces Scrutiny",
        "text": "Alibaba stock falls sharply as White House questions iPhone AI integration in China"
    },
    {
        "headline": "Apple Struggles to Crack AI",
        "text": "Apple is struggling to keep up with rivals in artificial intelligence. Bloomberg's Mark Gurman explains how the iPhone maker fell so far behind. He speaks with Ed Ludlow on \"Bloomberg Technology.\""
    },
    {
        "headline": "Apple Risks $27 Billion in Services Revenue, Evercore Says",
        "text": "DOJ's Google suit and Epic ruling threaten billions in search and fee income"
    },
    {
        "headline": "Apple vs. HP: Which PC Maker Stock is a Better Buy Right Now?",
        "text": "AAPL or HPQ, which PC maker is a better pick, given the strong demand for AI-powered devices amid a challenging macroeconomic environment?"
    },
    {
        "headline": "Alibaba Stock Falls On Report That Apple AI Partnership Is Under Scrutiny",
        "text": "Alibaba Group stock slipped Monday on a report that its partnership with Apple to power AI features on iPhone in China is under U.S. scrutiny. New China consumer spending data also raised potential concerns for Alibaba's giant e-commerce business. The Trump administration and congressional officials have been scrutinizing Apple's plan to use Alibaba's algorithms on iPhones in China, according to a Saturday report from the New York Times."
    },
    {
        "headline": "Apple Stock Faces Major Legal Risks. Here’s How Bad It Could Get, Says Analyst.",
        "text": "Evercore’s Amit Daryanani says Apple faces a threat to around 20% of its earnings if two legal threats turn out badly."
    },
    {
        "headline": "Magnificent 7 Trades at Seven-Year Low Valuation",
        "text": "Goldman's model shows Magnificent 7 trading modestly below fundamental strength metrics"
    },
    {
        "headline": "Apple Inc. (AAPL) Faces AI Roadblock as Competition Heats Up",
        "text": "Apple Inc. (NASDAQ:AAPL) is facing an Artificial Intelligence (AI) dilemma. Although a pioneer of the tech industry, APPL has been struggling with AI integration, which risks undermining its SMART-Phone market dominance. As per a report on Bloomberg on Sunday, April 16, 2025 (citing people familiar with Apple Inc. (NASDAQ:AAPL) internal processes), the tech giant has experienced […]"
    },
    {
        "headline": "Warren Buffett Stocks: Berkshire Exits Citi, Nu Holdings; Cuts These Names",
        "text": "Warren Buffett stocks shift as Berkshire Hathaway exits Citi, Nu Holdings, reduces stakes in Bank of America, Capital One among Q1 moves."
    },
    {
        "headline": "Alibaba Fall After U.S. Throws Wrench in Apple's China AI Deal",
        "text": "Washington's intervention may not just stall a tech partnership--it could reshape Apple's entire future in China."
    },
    {
        "headline": "Apple remains under-owned vs. peers, Meta still over-held - Morgan Stanley",
        "text": "Investing.com -- Apple remains the most under-owned mega-cap tech stock among large institutions, while Meta (NASDAQ:META) continues to be over-held, according to Morgan Stanley’s latest analysis of first-quarter 13-F filings."
    },
    {
        "headline": "Zacks Investment Ideas feature highlights: Arista Networks, Apple and Applied Industrial Technologies",
        "text": "Arista Networks, Apple and Applied Industrial Technologies are part of the Zacks Investment Ideas article."
    },
    {
        "headline": "Alibaba (BABA) Shares Tumble 5% as U.S. Probes Apple AI Deal",
        "text": "Regulatory Alarm Over AI Pact Sparks Alibaba Crash"
    },
    {
        "headline": "Market Chatter: Apple Facing US Scrutiny Over Potential AI Deal With Alibaba",
        "text": "Apple (AAPL) is facing scrutiny from the White House and congressional officials over its plan to us"
    },
    {
        "headline": "Missed Out on Apple in 2012? Buying Nvidia Stock Today Could Be Your Second Chance",
        "text": "Nvidia has a number of things today in common with Apple in 2012. Thus far, Nvidia (NASDAQ: NVDA) has been the biggest beneficiary of this boom, and it's easy to see why. Nvidia dominates market share of data center GPUs, a technology the company has been advancing for decades through innovations like its CUDA programming language that makes it easy for developers to write code that can be run directly on Nvidia's GPUs, and build high-performance applications."
    },
    {
        "headline": "Winners And Losers Of Q1: GoPro (NASDAQ:GPRO) Vs The Rest Of The Consumer Electronics Stocks",
        "text": "The end of an earnings season can be a great time to discover new stocks and assess how companies are handling the current business environment. Let’s take a look at how GoPro (NASDAQ:GPRO) and the rest of the consumer electronics stocks fared in Q1."
    },
    {
        "headline": "Alibaba Shares Slide as AI Deal With Apple Faces US Scrutiny",
        "text": "(Bloomberg) -- Shares of Alibaba Group Holding Ltd. slumped after a report that the Trump administration has raised concerns over Apple Inc.’s potential deal with the Chinese technology firm.Most Read from BloombergHow a Highway Became San Francisco’s Newest ParkAmerica, ‘Nation of Porches’Maryland’s Credit Rating Gets Downgraded as Governor Blames Trump NJ Transit Train Engineers Strike, Disrupting Travel to NYCNYC Commuters Brace for Chaos as NJ Transit Strike LoomsAlibaba’s stock dropped as m"
    },
    {
        "headline": "Down 12% This Year, Should You Buy Alphabet Stock?",
        "text": "AI models like ChatGPT and Perplexity could be threats to Google's search dominance. Google posted just a 2% year-over-year increase in paid clicks last quarter. The Google owner is underperforming the Nasdaq Composite, which has rallied in recent weeks and is only down about 1% year to date at the time of writing."
    },
    {
        "headline": "Bull Case \"Back on the Table\" for Apple, Microsoft, and Palantir Following Trade Truce, Says Dan Ives",
        "text": "The U.S. and China struck a deal to lower import tariffs significantly from levels that had surpassed 100%. Tech stocks have been center stage as tariff concerns mounted because they heavily rely on manufacturing abroad. Things were looking extremely difficult for technology companies just a few weeks ago."
    },
    {
        "headline": "Big Tech Breathes Life into Q1 Earnings",
        "text": "Results from some of the Magnificent 7 names last week reignited the AI trade."
    },
    {
        "headline": "US lawmakers have concerns about Apple-Alibaba deal",
        "text": "The Trump administration and congressional officials are scrutinizing a deal between Apple and Alibaba that would bring Alibaba-powered AI features to iPhones sold in China, according to The New York Times. Citing anonymous sources, the NYT says White House officials and members of the House Select Committee on China have asked Apple executives directly about the deal, with questions focused on what data would be shared with Alibaba and whether the company was making any commitments to Chinese r"
    },
    {
        "headline": "Wedbush: Apple (AAPL) Eyes India as Key iPhone Hub",
        "text": "We recently published a list of 10 Trending AI Stocks on Wall Street Right Now. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other trending AI stocks on Wall Street right now. US President Donald Trump wrapped up his tour of the Middle East today, concluding […]"
    },
    {
        "headline": "Dan Ives Says U.S.-China Tariff Pause Is a \"Dream Scenario\" for Apple. Is This the Buy Signal Investors Were Waiting For?",
        "text": "Wedbush analyst Dan Ives believes the recent progress in the U.S.-China trade talks is a bullish sign for Apple. Apple investors are likely breathing a sigh of relief, given the amount of manufacturing Apple does in China. The state of Apple stock could negate any benefits from a U.S.-China trade agreement."
    },
    {
        "headline": "Trump tariff uncertainty still makes earnings estimates and guidance useless",
        "text": "If investors are looking for thesis justification via earnings estimates and guidance, they shouldn't."
    },
    {
        "headline": "32.9% of Warren Buffett's $286 Billion Portfolio Is Invested in 3 Artificial Intelligence (AI) Stocks",
        "text": "Warren Buffett has steered the Berkshire Hathaway to market-crushing returns since 1965. On May 3, Warren Buffett announced he will step down from his role as the CEO of the Berkshire Hathaway holding company at the end of 2025. In other words, an investment of $1,000 in Berkshire stock in 1965 would have been worth a whopping $44.7 million at the end of 2024."
    },
    {
        "headline": "Prediction: This Will Be Wall Street's First $10 Trillion Company -- And It's Not Apple",
        "text": "Amazon's two growth segments can help propel it to a $10 trillion market cap. Compared to other big tech competitors, it has more room to expand profit margins in the next decade. It will take a long time, but the math shows how Amazon's financials can support a $10 trillion valuation eventually."
    },
    {
        "headline": "Apple Is Threatening to Challenge Alphabet's Empire: Is the Stock a Buy?",
        "text": "Apple could be looking to reinvent its Safari search engine through AI. Apple (NASDAQ: AAPL) has faced a wave of headwinds this year, including the prospects of higher costs, thanks to President Trump's tariff policies."
    },
    {
        "headline": "Beyond Nvidia, Four Things to Know at Asia’s Biggest Tech Show",
        "text": "(Bloomberg) -- Nvidia Corp.’s Jensen Huang headlines the 2025 edition of Asia’s biggest electronics conference, for years a showcase for his company’s cutting-edge AI chips and the companies lining up to buy them. This year, however, the spotlight may well be on another far bigger personality: US President Donald Trump.Most Read from BloombergHow a Highway Became San Francisco’s Newest ParkAmerica, ‘Nation of Porches’Power-Hungry Data Centers Are Warming Homes in the NordicsMaryland’s Credit Rat"
    },
    {
        "headline": "Apple iPhone Production In US 'Not Feasible,' Says Tech Bull After Donald Trump Tells Tim Cook To Stay Out Of India",
        "text": "Wedbush analyst, Dan Ives anticipates that Apple Inc. (NASDAQ:AAPL) could increase its iPhone assembly production in India to 60%-65% by fall, depending on tariff negotiations. What Happened: On Friday, Ives posted his views on X that Apple could significantly ramp up its iPhone assembly in India in a best-case scenario. However, he also noted that the tech giant could revert to a China-driven iPhone strategy depending on the tariff situation and deal negotiations. He added that U.S. iPhone prod"
    },
    {
        "headline": "The Best Warren Buffett Stocks to Buy With $500 Right Now",
        "text": "Apple and American Express are two of Berkshire Hathaway's largest investments. Apple's push into services, in addition to Apple Intelligence, should lead to profitable growth for investors. American Express is a resilient credit card brand that continues to adapt its offering to win over a new generation of consumers."
    }
]