[
    {
        "headline": "Apple's difficult 2025 is Tim Cook's biggest test yet",
        "text": "Apple CEO Tim Cook is contending with a host of serious issues at once, ranging from antitrust fights to a souring relationship with President Trump."
    },
    {
        "headline": "Court Slashes Trump Tariffs On China, Apple And The World — For Now; S&P 500 Futures Climb",
        "text": "A federal court struck down President Trump's tariffs on China, Apple and most of the world, but it may be temporary. S&P 500 futures rose."
    },
    {
        "headline": "2 Underrated Artificial Intelligence (AI) Stocks to Buy and Hold",
        "text": "Generative AI can simplify and speed up many tasks, including content production. It's easy to see the potential for Netflix, whose content strategy is integral to its success. Netflix's creations have attracted millions of viewers and won many awards."
    },
    {
        "headline": "Apple is falling behind its Magnificent 7 rivals. Should it just be the Mag 6?",
        "text": "The “Magnificent Seven” tech stocks led the market’s post-pandemic boom. But as Big Tech sprints into the AI future, one big name is falling dangerously behind: Apple (AAPL). Once an undisputed tech heavyweight, it risks becoming the least magnificent of them all."
    },
    {
        "headline": "Microsoft shares go from laggard to leader as AI growth improves",
        "text": "(Bloomberg) -- After languishing for months, Microsoft Corp. shares are back within striking distance of a record high amid signs that performance in its Azure cloud-computing business is back on track. Most Read from BloombergNYC Congestion Toll Brings In $216 Million in First Four MonthsNY Wins Order Against US Funding Freeze in Congestion FightNY Congestion Pricing Is Likely to Stay Until Year End During Court CaseNow With Colorful Blocks, Tirana’s Pyramid Represents a Changing AlbaniaThe sof"
    },
    {
        "headline": "The Top Holding for CalPERS, America's Largest Public Pension Fund, Is the Closest Thing You'll Find to a Guaranteed Investment on Wall Street",
        "text": "The No. 1 position for the California Public Employees' Retirement System (CalPERS) hasn't lost money on a rolling 20-year basis dating back more than a century."
    },
    {
        "headline": "Google begins direct online sales of Pixel phones in India",
        "text": "The Alphabet-owned firm said it has for the first time enabled direct online purchases for Indian users on the official Google Store website. The company currently sells it products in India through authorised retailers and via Walmart-backed e-commerce platform Flipkart. Apple , its bigger rival in the premium smartphone category, already sells its phones directly to Indian users, and operates its own retail stores in Mumbai and in New Delhi, with more planned."
    },
    {
        "headline": "US Tightens China Chip Curbs by Targeting Design Software",
        "text": "(Bloomberg) -- The Trump administration is moving to restrict the sale of chip design software to China, people familiar with the matter said, as the US government evaluates a broader policy announcement on the issue.Most Read from BloombergNYC Congestion Toll Brings In $216 Million in First Four MonthsNY Wins Order Against US Funding Freeze in Congestion FightNY Congestion Pricing Is Likely to Stay Until Year End During Court CaseNow With Colorful Blocks, Tirana’s Pyramid Represents a Changing"
    },
    {
        "headline": "Apple to Launch iOS 26, macOS 26 in Major Rebrand Tied to Software Redesigns",
        "text": "(Bloomberg) -- Apple Inc. is planning the most sweeping change yet to its operating system names, part of a software overhaul that extends to all its devices.Most Read from BloombergNYC Congestion Toll Brings In $216 Million in First Four MonthsNY Wins Order Against US Funding Freeze in Congestion FightNY Congestion Pricing Is Likely to Stay Until Year End During Court CaseThe next Apple operating systems will be identified by year, rather than with a version number, according to people with kno"
    },
    {
        "headline": "Trump's Apple Beef Isn't Just About India-Made iPhones — It's Also About Skipped Middle East Trip: Report",
        "text": "Apple Inc. (NASDAQ:AAPL) CEO Tim Cook has found himself at the receiving end of President Donald Trump‘s criticism, marking a stark contrast to their previously warm relationship, but reports suggest iPhone production in India is not the only reason. What Happened: According to The New York Times sources, Tim Cook turned down the Trump administration’s offer to join him alongside other CEOs and founders on a trip to the Middle East. During the trip, the President openly expressed his displeasure"
    },
    {
        "headline": "Apple Readies New Gaming App Across Devices",
        "text": "Bloomberg says launcher will centralize games, achievements and boost Arcade"
    },
    {
        "headline": "Warren Buffett Stocks: Berkshire Exits Citi, Nu Holdings; Cuts These Names",
        "text": "Warren Buffett stocks shift as Berkshire Hathaway exits Citi, Nu Holdings, reduces stakes in Bank of America, Capital One among Q1 moves."
    },
    {
        "headline": "Apple has bought a game studio for the first time",
        "text": "Tech giant buys maker of Sneaky Sasquatch game."
    },
    {
        "headline": "Apple Moves iPhone Output to India as U.S. Shipments Jump 76%",
        "text": "India's iPhone exports to the U.S. jumped 76% in April; China's fell 76%."
    },
    {
        "headline": "Fox News Host Roasts Trump's Mornings: 'Wake Up, Watch Cable News, Create Chaos, Watch The Futures Tank'",
        "text": "Fox News co-host Jessica Tarlov took a swipe at President Donald Trump on X recently, mocking his “morning schedule” as he continues to publicly threaten individual companies like Apple (NASDAQ:AAPL) with tariffs. Trump recently warned that he would impose a 25% tariff on all iPhones not made in the U.S., a move that stunned analysts and rattled Apple’s stock. Don't Miss: Hasbro, MGM, and Skechers trust this AI marketing firm — Invest before it's too late. ‘Scrolling To UBI' — Deloitte's #1 fast"
    },
    {
        "headline": "Apple Inc. (AAPL) Should Be Bought on Weakness, Veteran Investor Says",
        "text": "“The time to buy a name like Apple Inc. (NASDAQ:AAPL) is during dips like these,” veteran investor Dale Smothers said recently during an appearance on Schwab Network. Smothers, the CEO of RDS Wealth, added that his company will buy more AAPL stock over the long term. Multiple, Potential Catalysts for Apple Inc. (NASDAQ:AAPL) The “tariff […]"
    },
    {
        "headline": "Apple (AAPL) Suppliers in China Slide on Trump's New Tariff Threats",
        "text": "Trump floated 25% to 50% tariffs on imported iPhones not made in the U.S., per Reuters."
    },
    {
        "headline": "This analyst says tariffs can actually help Apple",
        "text": "Investing.com -- Amid renewed tariff concerns, one Wall Street firm is making the counterintuitive case that Apple (NASDAQ:AAPL) could benefit from the disruption."
    },
    {
        "headline": "Trump's Tariff Clock Is Ticking -- India, EU, Apple, and Tesla Are on Edge",
        "text": "July 9 looms as global powers scramble to dodge massive tariffs and investors brace for impact"
    },
    {
        "headline": "AAPL: Wedbush Sees Apple as Trade Deal's Biggest Winner",
        "text": "Wedbush Securities says Apple (NASDAQ:AAPL) could be a major winner if a U.S.-India trade pact comes through, boosting the tech giant's supply chain in India. Analyst Dan Ives reiterated an Outperform rating and kept his $270 price target, citing India's expanding manufacturing capabilities as a strategic counterweight to China's dominance. President Donald Trump has warned that iPhones assembled overseas could face a 25% tariff if not made domestically, a levy he said might extend to Samsung (SSNLF) and other phone manufacturers by the end of June."
    },
    {
        "headline": "Apple's difficult 2025 is Tim Cook's biggest test yet",
        "text": "Apple CEO Tim Cook is contending with a host of serious issues at once, ranging from antitrust fights to a souring relationship with President Trump."
    },
    {
        "headline": "Court Slashes Trump Tariffs On China, Apple And The World — For Now; S&P 500 Futures Climb",
        "text": "A federal court struck down President Trump's tariffs on China, Apple and most of the world, but it may be temporary. S&P 500 futures rose."
    },
    {
        "headline": "2 Underrated Artificial Intelligence (AI) Stocks to Buy and Hold",
        "text": "Generative AI can simplify and speed up many tasks, including content production. It's easy to see the potential for Netflix, whose content strategy is integral to its success. Netflix's creations have attracted millions of viewers and won many awards."
    },
    {
        "headline": "Apple is falling behind its Magnificent 7 rivals. Should it just be the Mag 6?",
        "text": "The “Magnificent Seven” tech stocks led the market’s post-pandemic boom. But as Big Tech sprints into the AI future, one big name is falling dangerously behind: Apple (AAPL). Once an undisputed tech heavyweight, it risks becoming the least magnificent of them all."
    },
    {
        "headline": "Microsoft shares go from laggard to leader as AI growth improves",
        "text": "(Bloomberg) -- After languishing for months, Microsoft Corp. shares are back within striking distance of a record high amid signs that performance in its Azure cloud-computing business is back on track. Most Read from BloombergNYC Congestion Toll Brings In $216 Million in First Four MonthsNY Wins Order Against US Funding Freeze in Congestion FightNY Congestion Pricing Is Likely to Stay Until Year End During Court CaseNow With Colorful Blocks, Tirana’s Pyramid Represents a Changing AlbaniaThe sof"
    },
    {
        "headline": "The Top Holding for CalPERS, America's Largest Public Pension Fund, Is the Closest Thing You'll Find to a Guaranteed Investment on Wall Street",
        "text": "The No. 1 position for the California Public Employees' Retirement System (CalPERS) hasn't lost money on a rolling 20-year basis dating back more than a century."
    },
    {
        "headline": "Google begins direct online sales of Pixel phones in India",
        "text": "The Alphabet-owned firm said it has for the first time enabled direct online purchases for Indian users on the official Google Store website. The company currently sells it products in India through authorised retailers and via Walmart-backed e-commerce platform Flipkart. Apple , its bigger rival in the premium smartphone category, already sells its phones directly to Indian users, and operates its own retail stores in Mumbai and in New Delhi, with more planned."
    },
    {
        "headline": "US Tightens China Chip Curbs by Targeting Design Software",
        "text": "(Bloomberg) -- The Trump administration is moving to restrict the sale of chip design software to China, people familiar with the matter said, as the US government evaluates a broader policy announcement on the issue.Most Read from BloombergNYC Congestion Toll Brings In $216 Million in First Four MonthsNY Wins Order Against US Funding Freeze in Congestion FightNY Congestion Pricing Is Likely to Stay Until Year End During Court CaseNow With Colorful Blocks, Tirana’s Pyramid Represents a Changing"
    },
    {
        "headline": "Apple to Launch iOS 26, macOS 26 in Major Rebrand Tied to Software Redesigns",
        "text": "(Bloomberg) -- Apple Inc. is planning the most sweeping change yet to its operating system names, part of a software overhaul that extends to all its devices.Most Read from BloombergNYC Congestion Toll Brings In $216 Million in First Four MonthsNY Wins Order Against US Funding Freeze in Congestion FightNY Congestion Pricing Is Likely to Stay Until Year End During Court CaseThe next Apple operating systems will be identified by year, rather than with a version number, according to people with kno"
    },
    {
        "headline": "Trump's Apple Beef Isn't Just About India-Made iPhones — It's Also About Skipped Middle East Trip: Report",
        "text": "Apple Inc. (NASDAQ:AAPL) CEO Tim Cook has found himself at the receiving end of President Donald Trump‘s criticism, marking a stark contrast to their previously warm relationship, but reports suggest iPhone production in India is not the only reason. What Happened: According to The New York Times sources, Tim Cook turned down the Trump administration’s offer to join him alongside other CEOs and founders on a trip to the Middle East. During the trip, the President openly expressed his displeasure"
    },
    {
        "headline": "Apple Readies New Gaming App Across Devices",
        "text": "Bloomberg says launcher will centralize games, achievements and boost Arcade"
    },
    {
        "headline": "Warren Buffett Stocks: Berkshire Exits Citi, Nu Holdings; Cuts These Names",
        "text": "Warren Buffett stocks shift as Berkshire Hathaway exits Citi, Nu Holdings, reduces stakes in Bank of America, Capital One among Q1 moves."
    },
    {
        "headline": "Apple has bought a game studio for the first time",
        "text": "Tech giant buys maker of Sneaky Sasquatch game."
    },
    {
        "headline": "Apple Moves iPhone Output to India as U.S. Shipments Jump 76%",
        "text": "India's iPhone exports to the U.S. jumped 76% in April; China's fell 76%."
    },
    {
        "headline": "Fox News Host Roasts Trump's Mornings: 'Wake Up, Watch Cable News, Create Chaos, Watch The Futures Tank'",
        "text": "Fox News co-host Jessica Tarlov took a swipe at President Donald Trump on X recently, mocking his “morning schedule” as he continues to publicly threaten individual companies like Apple (NASDAQ:AAPL) with tariffs. Trump recently warned that he would impose a 25% tariff on all iPhones not made in the U.S., a move that stunned analysts and rattled Apple’s stock. Don't Miss: Hasbro, MGM, and Skechers trust this AI marketing firm — Invest before it's too late. ‘Scrolling To UBI' — Deloitte's #1 fast"
    },
    {
        "headline": "Apple Inc. (AAPL) Should Be Bought on Weakness, Veteran Investor Says",
        "text": "“The time to buy a name like Apple Inc. (NASDAQ:AAPL) is during dips like these,” veteran investor Dale Smothers said recently during an appearance on Schwab Network. Smothers, the CEO of RDS Wealth, added that his company will buy more AAPL stock over the long term. Multiple, Potential Catalysts for Apple Inc. (NASDAQ:AAPL) The “tariff […]"
    },
    {
        "headline": "Apple (AAPL) Suppliers in China Slide on Trump's New Tariff Threats",
        "text": "Trump floated 25% to 50% tariffs on imported iPhones not made in the U.S., per Reuters."
    },
    {
        "headline": "This analyst says tariffs can actually help Apple",
        "text": "Investing.com -- Amid renewed tariff concerns, one Wall Street firm is making the counterintuitive case that Apple (NASDAQ:AAPL) could benefit from the disruption."
    },
    {
        "headline": "Trump's Tariff Clock Is Ticking -- India, EU, Apple, and Tesla Are on Edge",
        "text": "July 9 looms as global powers scramble to dodge massive tariffs and investors brace for impact"
    },
    {
        "headline": "AAPL: Wedbush Sees Apple as Trade Deal's Biggest Winner",
        "text": "Wedbush Securities says Apple (NASDAQ:AAPL) could be a major winner if a U.S.-India trade pact comes through, boosting the tech giant's supply chain in India. Analyst Dan Ives reiterated an Outperform rating and kept his $270 price target, citing India's expanding manufacturing capabilities as a strategic counterweight to China's dominance. President Donald Trump has warned that iPhones assembled overseas could face a 25% tariff if not made domestically, a levy he said might extend to Samsung (SSNLF) and other phone manufacturers by the end of June."
    },
    {
        "headline": "Is Apple Stock A Buy Amid Low Expectations For WWDC?",
        "text": "Apple stock has had a rough year. It has fallen amid soft iPhone sales, tariff concerns and challenges to its services business."
    },
    {
        "headline": "Trust the process, not the pitch",
        "text": "You can catch Trader Talk on Apple Podcasts, Spotify, YouTube, or wherever you get your podcasts. In the latest episode of Trader Talk, Kenny Polcari sits down with Chris Versace, chief investment officer at Tematica Research, to discuss how thematic investing can help navigate today’s volatile markets. Versace shares insights into identifying structural changes like AI, digital infrastructure, and sustainability, as well as building portfolios aligned with these long-term trends. They also touch on the recent rebound in tech, rising trade tensions, and shifting earnings expectations, concluding that clear strategies and adaptability are key to success in uncertain times. Watch more episodes of Trader Talk here. Trader Talk with Kenny Polcari on Yahoo Finance delivers expert analysis and actionable insights, empowering you to navigate market volatility and secure your financial future. This post was written by Langston Sessoms."
    },
    {
        "headline": "Jim Cramer Warns Market Could Be In Trouble If Apple, Nvidia Stocks Slide This Week: 'Really Bad Sign'",
        "text": "Veteran financial commentator, CNBC’s Jim Cramer, is sounding an alarm for investors, suggesting that the performance of tech giants Apple Inc. (NASDAQ:AAPL) and Nvidia Corp. (NASDAQ:NVDA) this week will be a critical indicator for the broader ..."
    },
    {
        "headline": "Why Apple doesn’t make iPhones in America – and probably won’t",
        "text": "In 2011, then-President Barack Obama pressed Apple CEO Steve Jobs on what it would take to bring iPhone production to the United States, according to The New York Times."
    },
    {
        "headline": "Trump’s 25% Tariff Threat Looms, But Apple (AAPL) Isn’t Moving – Yet",
        "text": "We recently published a list of 10 AI Stocks on Analyst’s Radar Today. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other AI stocks that are on analyst’s radar today. One of the most notable analyst calls on Tuesday, May 27, was for Apple Inc. (NASDAQ:AAPL). […]"
    },
    {
        "headline": "Prediction: 2 AI Stocks Will Be Worth More Than Apple Stock Before the End of 2026",
        "text": "Amazon and Alphabet could achieve $3 trillion market values within six quarters, in which case they would surpass what Apple is worth today before the end of 2026. Amazon has a strong presence in e-commerce, digital advertising, and cloud computing, and it's using AI to improve efficiency across its retail business. Alphabet has a strong presence in digital advertising and cloud computing, and expertise in AI infrastructure and large language models could drive market share gains."
    },
    {
        "headline": "It's Unofficially Summer. Time to Get Outside, and Talk With Decking Expert Trex CEO Bryan Fairbanks",
        "text": "What Jony Ive and Sam Altman are cooking up for hardware with OpenAI and io. How Home Depot and Lowe's are holding up until macro tailwinds return. Motley Fool analysts Andy Cross and Sanmeet Deo caught up with Trex CEO Bryan Fairbanks to talk about the war on wood decks, how the company is handling tariffs, and why he expects business to boom as the macro picture clears up."
    },
    {
        "headline": "Famous Investor Suggests That Apple (AAPL) Is Not a Buy",
        "text": "Stephanie Link, a frequent guest on CNBC, recently suggested during an appearance on the network that investors should not buy Apple Inc. (NASDAQ:AAPL) stock. Link is the Chief Investment Strategist at Hightower Advisors. Link: Why Would You Pay So Much for Apple Inc. (NASDAQ:AAPL)? Referring to Apple Inc. (NASDAQ:AAPL), Link rhetorically asked, “Why would you […]"
    },
    {
        "headline": "Meta’s Future Lies With Judge as FTC Antitrust Trial Ends",
        "text": "(Bloomberg) -- Meta Platforms Inc. has done all it can in court to fight back at the US Federal Trade Commission’s claims that it’s a monopoly. Now it’s up to a federal judge to decide whether the company should be broken up.Most Read from BloombergNY Wins Order Against US Funding Freeze in Congestion FightThe seven-week trial wrapped up Tuesday, and now each side has four months to make its case in writing. Then US District Judge James Boasberg will decide whether Meta has an illegal monopoly i"
    },
    {
        "headline": "iPhone Tariff Threat Weighs on Apple",
        "text": "It's a \"fairytale\" to think the full iPhone supply chain can be moved to the U.S., says Carolina Milanesi, president and principal analyst at Creative Strategies. She speaks with Caroline Hyde and Ed Ludlow on \"Bloomberg Technology.\""
    },
    {
        "headline": "Expectations For Apple's WWDC Couldn't Be Lower",
        "text": "Expectations for Apple's Worldwide Developers Conference are subdued this year. And that sentiment is reflected in Apple stock."
    },
    {
        "headline": "These Stocks Moved the Most Today: Apple, Tesla, DJT, Informatica, Super Micro, PDD, SoundHound, and More",
        "text": "Apple rises after tumbling Friday when President Donald Trump threatened a 25% tariff on iPhones sold in the U.S. that are made overseas, while Tesla trades higher even as the electric-vehicle maker’s sales in Europe decline for a fourth straight month."
    },
    {
        "headline": "Stock market today: Dow, S&P 500, Nasdaq soar as Trump pauses EU tariff hikes for fast-tracked talks",
        "text": "Optimism for a US-EU trade deal is growing as talks speed up after Trump's delay to 50% tariffs."
    },
    {
        "headline": "Apple to Debut Dedicated Gaming App Within Days of Switch 2’s Arrival",
        "text": "(Bloomberg) -- Apple Inc. is planning a dedicated app for video games on its devices, seeking to sell gamers and developers on the idea that it’s a leader in the market.Most Read from BloombergUAE’s AI University Aims to Become Stanford of the GulfNY Wins Order Against US Funding Freeze in Congestion FightThe company will preinstall the app on the iPhone, iPad, Mac and Apple TV set-top box later this year, according to people with knowledge of the matter. The software will serve as a launcher fo"
    },
    {
        "headline": "Citi Reiterates Buy Rating on Apple (AAPL), Keeps PT at $240",
        "text": "On May 27, Citi reiterated its Buy rating on Apple Inc. (NASDAQ:AAPL), keeping its price target of $240 for the stock. Atif Malik from Citi maintains his rating on Apple, as he sees President Trump’s announcement of 25% tariffs on Apple Inc. (NASDAQ:AAPL) to have a limited impact on the company’s business. Malik shared his […]"
    }
]