[
    {
        "headline": "UnitedHealth investigation, Apple production, CoreWeave earnings",
        "text": "UnitedHealth Group (UNH) is being investigated by Justice Department officials (DOJ), according to the Wall Street Journal, over alleged fraud tied to the health insurer's Medicare Advantage business. This comes as UnitedHealth CEO Andrew Witty stepped down earlier this week with former CEO Stephen Hemsley returning to man the chief executive role. President Trump is pushing iPhone maker Apple (AAPL) to begin domestic production of devices and pull out of its investments to build out a plant in India. CoreWeave (CRWV) stock pops on its first earnings report since going public via an IPO. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here."
    },
    {
        "headline": "S&P 500 Rises as Fed-Cut Bets Sink Treasury Yields: Markets Wrap",
        "text": "(Bloomberg) -- Wall Street traders drove stocks higher as bond yields sank after the latest economic data spurred speculation the Federal Reserve will cut interest rates twice this year to prevent a recession.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the NordicsNYC Commuters Brace for Chaos a"
    },
    {
        "headline": "Warren Buffett Stocks: Berkshire Exits Citi, Nu Holdings; Cuts These Names",
        "text": "Warren Buffett stocks shift as Berkshire Hathaway exits Citi, Nu Holdings, reduces stakes in Bank of America, Capital One among Q1 moves."
    },
    {
        "headline": "Apple Investors Shrug Off Trump Broadside on Tim Cook",
        "text": "To Apple investors, President Trump is all bark and no bite, at least when it comes to the shade he threw towards Tim Cook earlier today. Apple shares only slightly underperformed the market after the President, speaking in Qatar, chided Cook for \"building in India,\" adding: \"We want you to build here,\" in the U.S. The criticism cuts at the heart of Apple’s strategy to dodge to worst impact of Trump’s tariffs: Shift final assembly of more iPhones to India so Apple can claim that nation as the “country of origin” when iPhones cross into the U.S. It’s perfectly legal but far from the \"Made in America\" iPhone that Trump and officials in his administration have called for."
    },
    {
        "headline": "Berkshire Sells Financial Stocks, Doubles Constellation Stake, Holds Steady on Apple",
        "text": "Warren Buffett’s Berkshire Hathaway sold some Bank of America and Capital One Financial shares and all of its Citigroup stake earlier this year. Berkshire maintained its position in Apple its biggest stockholding, for a second consecutive quarter after selling much of it earlier last year. Berkshire’s stake in the iPhone maker was worth $66.6 billion on March 31."
    },
    {
        "headline": "Trump Not Happy With Apple Moving iPhone Production To India",
        "text": "President Donald Trump told Apple CEO Tim Cook that he's not happy with the company's decision to move more iPhone production to India."
    },
    {
        "headline": "Stocks to Watch Recap: Coinbase, Apple, UnitedHealth, Foot Locker",
        "text": "🔎 After-Hours Earnings: Applied Materials (AMAT) shares fell in postmarket trading after the semiconductor equipment company reported earnings. Take-Two Interactive Software (TTWO) stock also drifted lower after the company released results."
    },
    {
        "headline": "Trump Presses Apple to Bring iPhone Manufacturing to America. Wall Street Shrugs.",
        "text": "The president made remarks that took aim at Apple CEO Tim Cook’s plans to shift some production to India."
    },
    {
        "headline": "7 countries Apple relies on to build the iPhone",
        "text": "President Trump took a shot at Apple’s CEO Tim Cook for moving much of the production of the iconic iPhone from China to India to evade tariffs. But experts paint a more complicated picture. While the iPhones may be assembled largely in China or India, the components of an iPhone represent a veritable Olympic village of countries, which makes the impact of tariffs an especially complicated one for Apple (AAPL). The supply chain for the iPhone spans the globe. According to tech pub Lifewire and r"
    },
    {
        "headline": "Trump Just Told Tim Cook to Stop Building iPhones in India -- Here's What That Means for Apple",
        "text": "Apple's $22B India strategy hits a wall as Trump demands iPhones be made in America."
    },
    {
        "headline": "Apple May Shift iPhone Output Back to U.S.",
        "text": "Trump urges stronger domestic production amid high Indian tariffs"
    },
    {
        "headline": "Trump Asks Apple to Trade India iPhone Production for US",
        "text": "Bloomberg's Mark Gurman discusses why President Donald Trump says he'd like Apple to stop moving iPhone production to India, and what he'd like to see instead. Gurman joins Caroline Hyde and Ed Ludlow on \"Bloomberg Technology\"."
    },
    {
        "headline": "Trump says he has a ‘little problem’ with Tim Cook",
        "text": "President Donald Trump isn’t pleased with Apple CEO Tim Cook’s plan to manufacture iPhones bound for the United States at newly built plants in India."
    },
    {
        "headline": "Trump doesn't want Apple making iPhones in India: 'I had a little problem with Tim Cook'",
        "text": "President Donald Trump said he had a \"little problem\" this week with Apple CEO Tim Cook regarding the tech giant looking to use facilities in India to make iPhones for the U.S."
    },
    {
        "headline": "Trump Tells Apple Not to Boost iPhone Production in India",
        "text": "President Donald Trump on Thursday said he told Apple to stop moving iPhone production to India, as it shifts away from manufacturing in China."
    },
    {
        "headline": "Magnificent Seven Stocks: Amazon, Nvidia, Tesla Slide",
        "text": "Dubbed the Magnificent Seven stocks, Apple, Microsoft, Google parent Alphabet, Amazon.com, Nvidia, Meta Platforms and Tesla lived up to their name in 2024 with solid gains. Through the first four months of 2025, however, performance for these mega-cap stocks has been negative thus far."
    },
    {
        "headline": "Apple Stock Slips. Why Trump Has a Problem With CEO Tim Cook.",
        "text": "Apple's plan to produce more iPhones in India has attracted criticism from President Donald Trump."
    },
    {
        "headline": "Trump wants Apple to stop building iPhones in India — just as production ramps up",
        "text": "President Donald Trump is pressuring Apple (AAPL) to pull back from India and move production to the U.S., telling CEO Tim Cook he doesn’t want iPhones “built in India.”"
    },
    {
        "headline": "Apple Faces Pressure as Trump Slams iPhone Production in India",
        "text": "Trump Targets Apple's India Plans, Calls for Domestic Output Boost"
    },
    {
        "headline": "Mark Zuckerberg Says 'Apple Hasn't Invented Anything Great Since The iPhone' As Meta Blocks Its AI Tools",
        "text": "Silicon Valley's headline feud just moved from boardrooms to every iPhone screen. As of mid-April, CNET reported that Apple Intelligence—Apple's (NASDAQ:AAPL) new on-device AI suite—no longer works inside Facebook, Instagram, WhatsApp, Threads or Messenger. The silent change traced back to Meta Platforms (NASDAQ:META), which disabled Apple's application interfaces without fanfare. The clash arrives three months after Meta CEO Mark Zuckerberg said on \"The Joe Rogan Experience\" podcast in January"
    },
    {
        "headline": "UnitedHealth investigation, Apple production, CoreWeave earnings",
        "text": "UnitedHealth Group (UNH) is being investigated by Justice Department officials (DOJ), according to the Wall Street Journal, over alleged fraud tied to the health insurer's Medicare Advantage business. This comes as UnitedHealth CEO Andrew Witty stepped down earlier this week with former CEO Stephen Hemsley returning to man the chief executive role. President Trump is pushing iPhone maker Apple (AAPL) to begin domestic production of devices and pull out of its investments to build out a plant in India. CoreWeave (CRWV) stock pops on its first earnings report since going public via an IPO. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here."
    },
    {
        "headline": "S&P 500 Rises as Fed-Cut Bets Sink Treasury Yields: Markets Wrap",
        "text": "(Bloomberg) -- Wall Street traders drove stocks higher as bond yields sank after the latest economic data spurred speculation the Federal Reserve will cut interest rates twice this year to prevent a recession.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the NordicsNYC Commuters Brace for Chaos a"
    },
    {
        "headline": "Warren Buffett Stocks: Berkshire Exits Citi, Nu Holdings; Cuts These Names",
        "text": "Warren Buffett stocks shift as Berkshire Hathaway exits Citi, Nu Holdings, reduces stakes in Bank of America, Capital One among Q1 moves."
    },
    {
        "headline": "Apple Investors Shrug Off Trump Broadside on Tim Cook",
        "text": "To Apple investors, President Trump is all bark and no bite, at least when it comes to the shade he threw towards Tim Cook earlier today. Apple shares only slightly underperformed the market after the President, speaking in Qatar, chided Cook for \"building in India,\" adding: \"We want you to build here,\" in the U.S. The criticism cuts at the heart of Apple’s strategy to dodge to worst impact of Trump’s tariffs: Shift final assembly of more iPhones to India so Apple can claim that nation as the “country of origin” when iPhones cross into the U.S. It’s perfectly legal but far from the \"Made in America\" iPhone that Trump and officials in his administration have called for."
    },
    {
        "headline": "Berkshire Sells Financial Stocks, Doubles Constellation Stake, Holds Steady on Apple",
        "text": "Warren Buffett’s Berkshire Hathaway sold some Bank of America and Capital One Financial shares and all of its Citigroup stake earlier this year. Berkshire maintained its position in Apple its biggest stockholding, for a second consecutive quarter after selling much of it earlier last year. Berkshire’s stake in the iPhone maker was worth $66.6 billion on March 31."
    },
    {
        "headline": "Trump Not Happy With Apple Moving iPhone Production To India",
        "text": "President Donald Trump told Apple CEO Tim Cook that he's not happy with the company's decision to move more iPhone production to India."
    },
    {
        "headline": "Stocks to Watch Recap: Coinbase, Apple, UnitedHealth, Foot Locker",
        "text": "🔎 After-Hours Earnings: Applied Materials (AMAT) shares fell in postmarket trading after the semiconductor equipment company reported earnings. Take-Two Interactive Software (TTWO) stock also drifted lower after the company released results."
    },
    {
        "headline": "Trump Presses Apple to Bring iPhone Manufacturing to America. Wall Street Shrugs.",
        "text": "The president made remarks that took aim at Apple CEO Tim Cook’s plans to shift some production to India."
    },
    {
        "headline": "7 countries Apple relies on to build the iPhone",
        "text": "President Trump took a shot at Apple’s CEO Tim Cook for moving much of the production of the iconic iPhone from China to India to evade tariffs. But experts paint a more complicated picture. While the iPhones may be assembled largely in China or India, the components of an iPhone represent a veritable Olympic village of countries, which makes the impact of tariffs an especially complicated one for Apple (AAPL). The supply chain for the iPhone spans the globe. According to tech pub Lifewire and r"
    },
    {
        "headline": "Trump Just Told Tim Cook to Stop Building iPhones in India -- Here's What That Means for Apple",
        "text": "Apple's $22B India strategy hits a wall as Trump demands iPhones be made in America."
    },
    {
        "headline": "Apple May Shift iPhone Output Back to U.S.",
        "text": "Trump urges stronger domestic production amid high Indian tariffs"
    },
    {
        "headline": "Trump Asks Apple to Trade India iPhone Production for US",
        "text": "Bloomberg's Mark Gurman discusses why President Donald Trump says he'd like Apple to stop moving iPhone production to India, and what he'd like to see instead. Gurman joins Caroline Hyde and Ed Ludlow on \"Bloomberg Technology\"."
    },
    {
        "headline": "Trump says he has a ‘little problem’ with Tim Cook",
        "text": "President Donald Trump isn’t pleased with Apple CEO Tim Cook’s plan to manufacture iPhones bound for the United States at newly built plants in India."
    },
    {
        "headline": "Trump doesn't want Apple making iPhones in India: 'I had a little problem with Tim Cook'",
        "text": "President Donald Trump said he had a \"little problem\" this week with Apple CEO Tim Cook regarding the tech giant looking to use facilities in India to make iPhones for the U.S."
    },
    {
        "headline": "Trump Tells Apple Not to Boost iPhone Production in India",
        "text": "President Donald Trump on Thursday said he told Apple to stop moving iPhone production to India, as it shifts away from manufacturing in China."
    },
    {
        "headline": "Magnificent Seven Stocks: Amazon, Nvidia, Tesla Slide",
        "text": "Dubbed the Magnificent Seven stocks, Apple, Microsoft, Google parent Alphabet, Amazon.com, Nvidia, Meta Platforms and Tesla lived up to their name in 2024 with solid gains. Through the first four months of 2025, however, performance for these mega-cap stocks has been negative thus far."
    },
    {
        "headline": "Apple Stock Slips. Why Trump Has a Problem With CEO Tim Cook.",
        "text": "Apple's plan to produce more iPhones in India has attracted criticism from President Donald Trump."
    },
    {
        "headline": "Trump wants Apple to stop building iPhones in India — just as production ramps up",
        "text": "President Donald Trump is pressuring Apple (AAPL) to pull back from India and move production to the U.S., telling CEO Tim Cook he doesn’t want iPhones “built in India.”"
    },
    {
        "headline": "Apple Faces Pressure as Trump Slams iPhone Production in India",
        "text": "Trump Targets Apple's India Plans, Calls for Domestic Output Boost"
    },
    {
        "headline": "Mark Zuckerberg Says 'Apple Hasn't Invented Anything Great Since The iPhone' As Meta Blocks Its AI Tools",
        "text": "Silicon Valley's headline feud just moved from boardrooms to every iPhone screen. As of mid-April, CNET reported that Apple Intelligence—Apple's (NASDAQ:AAPL) new on-device AI suite—no longer works inside Facebook, Instagram, WhatsApp, Threads or Messenger. The silent change traced back to Meta Platforms (NASDAQ:META), which disabled Apple's application interfaces without fanfare. The clash arrives three months after Meta CEO Mark Zuckerberg said on \"The Joe Rogan Experience\" podcast in January"
    },
    {
        "headline": "Trump tells Apple to stop building iPhones in India",
        "text": "Donald Trump has told Apple to stop building iPhones in India and bring production to the US, as the tech giant battles to avoid punishing tariffs."
    },
    {
        "headline": "China's Xiaomi to launch self-developed mobile chip in late May",
        "text": "BEIJING (Reuters) -Chinese smartphone and EV maker Xiaomi said on Thursday it will launch a new self-developed advanced mobile chip, XringO1, in late May, as it seeks to power more of its high-end devices with proprietary silicon. The announcement was made by Xiaomi's CEO Lei Jun on his Weibo account. Xiaomi’s renewed push into mobile chip development comes as competition in China’s smartphone market has been intensifying, with rivals like Huawei and Apple leveraging their own custom-designed chips to create tightly integrated ecosystems and enhance user experience."
    },
    {
        "headline": "Trump Asks Apple to Stop Moving iPhone Production to India",
        "text": "(Bloomberg) -- Follow Bloomberg India on WhatsApp for exclusive content and analysis on what billionaires, businesses and markets are doing. Sign up here.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkPower-Hungry Data Centers Are Warming Homes in the NordicsMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump NYC Commuters Brace for Chaos as NJ Transit Strike LoomsPresident Donald Trump said he"
    },
    {
        "headline": "Trump Says India Offered to Remove All Tariffs on US Goods",
        "text": "(Bloomberg) -- Sign up for the India Edition newsletter by Menaka Doshi – an insider's guide to the emerging economic powerhouse, and the billionaires and businesses behind its rise, delivered weekly.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkPower-Hungry Data Centers Are Warming Homes in the NordicsMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump NYC Commuters Brace for Chaos as NJ Tran"
    },
    {
        "headline": "Apple's India iPhones Boost U.S. Shipments by 30%",
        "text": "India share rises to 26%, China dips amid tariff-avoidance rush"
    },
    {
        "headline": "How China caught up with Silicon Valley",
        "text": "From Edison to Amazon, the US consistently invented the global future. The country suffered periodic anxieties about being overtaken, by the..."
    },
    {
        "headline": "Apple’s (AAPL) Legal Brawl With Epic Games Leaves Stockholders in Limbo",
        "text": "When Apple (AAPL) faced Epic Games in a landmark court case in 2021, the outcome seemed straightforward: Apple was ordered to let developers inform users about payment methods outside its app store. However, as of May 2025, what began as a clear-cut injunction has turned into a heated legal battle, with Apple now accused of openly defying a federal court order. As an investor and observer, I’ve found this unfolding saga crucial to understanding the future of digital marketplaces, especially with"
    },
    {
        "headline": "They Paid $3,500 for Apple’s Vision Pro. A Year Later, It Still Hurts.",
        "text": "The mixed-reality headset launched with great promise, but all these buyers got were dirty looks and sore necks."
    },
    {
        "headline": "Nvidia Just Rejoined Apple and Microsoft in the $3 Trillion Club. Could It Become the First $4 Trillion Stock by 2026?",
        "text": "A big rebound has helped Nvidia's market cap again soar above $3 trillion. Nvidia is arguably in a better position to become the first to reach a $4 trillion market cap than any other company. The timing of when Nvidia hits that mark is up in the air, though, because of economic uncertainty."
    },
    {
        "headline": "Prediction: This Stock Will Be the Biggest Winner of the U.S.-China Trade Deal",
        "text": "Technology stocks roared higher after the U.S. and China agreed on lower-than-expected import tariffs. Many tech companies rely on manufacturing in China -- so lower tariffs mean less pressure on earnings. The U.S. and China just delivered exciting news to investors."
    },
    {
        "headline": "Take on Apple and Google to boost UK economy, think tank says",
        "text": "The Institute for Public Policy Research has said tackling big tech monopolies could help boost the UK economy."
    },
    {
        "headline": "Samsung Blindsides Apple With Razor-Thin Galaxy S25 Edge: Here's How Much It Will Cost",
        "text": "On Monday, Samsung Electronics Co. (OTC:SSNLF) launched the Galaxy S25 Edge, a 5.8 mm-thin, 163-gram smartphone, just four months after unveiling the rest of the S25 series. What Happened: The ultra-slim device features a 6.7-inch display, a dual-camera system, and the company's latest AI-powered features. The Galaxy S25 Edge packs a powerful 200MP main camera, offering ultra-high resolution for detailed photos in any lighting condition. A secondary 12MP ultra-wide lens with autofocus enables cr"
    },
    {
        "headline": "Don’t Expect a Big Payout From Apple’s $95 Million Settlement",
        "text": "Americans with a Siri-enabled Apple device can file a claim for part of a $95 million legal settlement that the phone maker has agreed to pay. The settlement stems from a 2021 lawsuit, Lopez v. Apple, filed in federal court in San Jose, Calif., claiming that Apple recorded users without their knowledge when they inadvertently activated the Siri virtual assistant on their devices. Without admitting fault, Apple agreed to settle the case earlier this year."
    },
    {
        "headline": "Apple (AAPL) Unveils Brain-Interface Initiative as iPhone Sales Lag",
        "text": "But Wall Street still wants a stronger iPhone rebound"
    },
    {
        "headline": "Apple Inc. (AAPL) “Is Not in the Epicenter of AI Right Now,” Veteran Investor Says",
        "text": "Asserting that Apple Inc. (AAPL) “is not in the epicenter of AI right now” and is “facing some considerable challenges,” TheoTrade founder Don Kaufman reported on Schwab Network that he was utilizing a bearish options strategy on Apple Inc. (AAPL). Kaufman explained his options strategy on the network, while Rick Ducat, Schwab’s Lead Market Technician, […]"
    }
]