[
    {
        "headline": "Nvidia stock extends gains as Saudi Arabia set to spend billions on AI chips, US moves to rescind Biden's chip curbs",
        "text": "Nvidia stock jumped over 4% Wednesday after the company and fellow chipmakers announced billions of dollars' worth of AI deals with Saudi Arabia."
    },
    {
        "headline": "New era of US-Middle East trading will be about AI, not crude oil",
        "text": "President Trump began his four-day tour through the Middle East this week, beginning in Saudi Arabia on Tuesday. This visit has sparked several AI deals from Nvidia (NVDA) and Super Micro Computer (SMCI) with Saudi Arabia and the United Arab Emirates, on top of the White House reporting a massive order of Boeing planes (BA) from Qatar Airways. Middle East Institute Senior Fellow Mohammed Soliman comes on to expand upon the growing trading relationship between the US and Persian Gulf countries, namely in the areas of AI infrastructure and semiconductors, a technological pivot away from crude oil (CL=F, BZ=F) exports. To watch more expert insights and analysis on the latest market action, check out more Catalysts&nbsp;here."
    },
    {
        "headline": "AMD announces $6B share buyback program. Stock gets lift.",
        "text": "Semiconductor manufacturer Advanced Micro Devices (AMD) announced a $6 billion share buyback program, pushing the chip stock higher by nearly 7% in Wednesday's pre-market trading (at the time of this video's posting). To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here."
    },
    {
        "headline": "Intel (INTC) Shares Tumble After Market Share Hits Lowest Since 2002",
        "text": "Arm Grabs 13.6% Chip Market Share, Pressures Intel and AMD"
    },
    {
        "headline": "Who Needs China? Saudi Arabia Steps Up As Big Buyer Of AI Chips.",
        "text": "AI stocks, led by Nvidia, rose for the second straight day following news of major business deals in Saudi Arabia."
    },
    {
        "headline": "BofA Calls Nvidia, AMD Likely 'Top Winners' from Saudi AI Infrastructure Deals",
        "text": "Broadcom, Marvell Poised to Benefit Alongside Nvidia and AMD"
    },
    {
        "headline": "Analyst reboots Nvidia, AMD stock price targets on Saudi deal, potential",
        "text": "A big tech buildout is coming to the Middle East."
    },
    {
        "headline": "Sector Update: Tech Stocks Advance Late Afternoon",
        "text": "Tech stocks were higher late Wednesday afternoon, with the Technology Select Sector SPDR Fund (XLK)"
    },
    {
        "headline": "These Stocks Are Moving the Most Today: Nvidia, AMD, Super Micro, UnitedHealth, eToro, Oklo, Exelixis, and More",
        "text": "Nvidia and AMD extend gains after the chip makers sign deals with Saudi Arabia, shares of Super Micro Computer surge for a second day, and UnitedHealth claws back some losses from the previous session."
    },
    {
        "headline": "Sector Update: Tech Stocks Advance Wednesday Afternoon",
        "text": "Tech stocks were higher Wednesday afternoon, with the Technology Select Sector SPDR Fund (XLK) addin"
    },
    {
        "headline": "Nvidia Stock, AMD Benefit From Middle East Deals",
        "text": "Nvidia shares rose for a third straight day Wednesday, with sentiment in the artificial-intelligence sector bosted by tech deals that followed President Trump's visit to the Middle East. BofA Securities said Nvidia and Advanced Micro Devices are the top beneficiaries of multi-year AI infrastructure projects announced Tuesday with the Saudi Arabia Public Investment Fund."
    },
    {
        "headline": "AMD vs. Lattice Semiconductor: Which FPGA Stock Has the Edge?",
        "text": "Advanced Micro Devices and LSCC are well-known players in the FPGA market. Let's find out which one is a better investment option."
    },
    {
        "headline": "Advanced Micro Devices (NasdaqGS:AMD) Announces US$6 Billion Buyback And AI Expansion",
        "text": "Advanced Micro Devices (NasdaqGS:AMD) saw its share price rise by 20% over the last month, buoyed by several contributing factors. The announcement of a substantial $6 billion expansion in its stock buyback plan added momentum to the company's market performance. Additionally, AMD's collaboration with HUMAIN on a $10 billion AI infrastructure project, along with the introduction of the EPYC 4005 Series processors, signaled strong growth prospects. These positive developments occurred as the..."
    },
    {
        "headline": "Is Advanced Micro Devices (AMD) the Tech Stock That Trump’s Fellow Republican Bought Amid Market Rout?",
        "text": "We recently published a list of 10 Tech Stocks That Trump’s Fellow Republican Bought Amid Market Rout. In this article, we are going to take a look at where Advanced Micro Devices, Inc. (NASDAQ:AMD) stands against other tech stocks that Trump’s fellow Republican bought amid market rout. Keeping track of politicians’ stock investments is a […]"
    },
    {
        "headline": "Nvidia and Other AI Stocks Climb as Saudi Deals Raise Expectations of More to Come",
        "text": "Nvidia and other AI stocks climbed Wednesday, extending Tuesday's gains as Saudi partnerships stoked excitement for future deals."
    },
    {
        "headline": "NVIDIA, AMD targets raised at BofA following sovereign AI deals",
        "text": "Investing.com -- Bank of America raised its price targets for NVIDIA and AMD (NASDAQ:AMD) on Wednesday, citing wins in sovereign artificial intelligence projects that could help offset export restrictions to China beginning in calendar year 2026."
    },
    {
        "headline": "Why AMD Stock Popped Wednesday Morning",
        "text": "Things are looking up for the artificial intelligence (AI) and semiconductor specialist."
    },
    {
        "headline": "Top Stock Movers Now: Super Micro Computer, AMD, Newmont, and More",
        "text": "U.S. equities were edging up at midday, with the S&P 500 and Nasdaq driven higher by solid gains from tech shares."
    },
    {
        "headline": "AMD CEO Lisa Su tells Gen Z grads ‘don’t walk, run’ towards the hardest challenges at their workplace for a fast track to promotions",
        "text": "The billionaire tech executive reveals that the path up the corporate ladder is full of ups and downs, but every challenge holds a valuable lesson “if you're willing to look for it.”"
    },
    {
        "headline": "Why AMD (AMD) Stock Is Trading Up Today",
        "text": "Shares of computer processor maker AMD (NASDAQ:AMD) jumped 5.4% in the morning session after the company announced a new $6 billion share buyback program. This adds to the approximately $4 billion remaining under the existing program, bringing the total repurchase authorization to around $10 billion."
    },
    {
        "headline": "Nvidia stock extends gains as Saudi Arabia set to spend billions on AI chips, US moves to rescind Biden's chip curbs",
        "text": "Nvidia stock jumped over 4% Wednesday after the company and fellow chipmakers announced billions of dollars' worth of AI deals with Saudi Arabia."
    },
    {
        "headline": "New era of US-Middle East trading will be about AI, not crude oil",
        "text": "President Trump began his four-day tour through the Middle East this week, beginning in Saudi Arabia on Tuesday. This visit has sparked several AI deals from Nvidia (NVDA) and Super Micro Computer (SMCI) with Saudi Arabia and the United Arab Emirates, on top of the White House reporting a massive order of Boeing planes (BA) from Qatar Airways. Middle East Institute Senior Fellow Mohammed Soliman comes on to expand upon the growing trading relationship between the US and Persian Gulf countries, namely in the areas of AI infrastructure and semiconductors, a technological pivot away from crude oil (CL=F, BZ=F) exports. To watch more expert insights and analysis on the latest market action, check out more Catalysts&nbsp;here."
    },
    {
        "headline": "AMD announces $6B share buyback program. Stock gets lift.",
        "text": "Semiconductor manufacturer Advanced Micro Devices (AMD) announced a $6 billion share buyback program, pushing the chip stock higher by nearly 7% in Wednesday's pre-market trading (at the time of this video's posting). To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here."
    },
    {
        "headline": "Intel (INTC) Shares Tumble After Market Share Hits Lowest Since 2002",
        "text": "Arm Grabs 13.6% Chip Market Share, Pressures Intel and AMD"
    },
    {
        "headline": "Who Needs China? Saudi Arabia Steps Up As Big Buyer Of AI Chips.",
        "text": "AI stocks, led by Nvidia, rose for the second straight day following news of major business deals in Saudi Arabia."
    },
    {
        "headline": "BofA Calls Nvidia, AMD Likely 'Top Winners' from Saudi AI Infrastructure Deals",
        "text": "Broadcom, Marvell Poised to Benefit Alongside Nvidia and AMD"
    },
    {
        "headline": "Analyst reboots Nvidia, AMD stock price targets on Saudi deal, potential",
        "text": "A big tech buildout is coming to the Middle East."
    },
    {
        "headline": "Sector Update: Tech Stocks Advance Late Afternoon",
        "text": "Tech stocks were higher late Wednesday afternoon, with the Technology Select Sector SPDR Fund (XLK)"
    },
    {
        "headline": "These Stocks Are Moving the Most Today: Nvidia, AMD, Super Micro, UnitedHealth, eToro, Oklo, Exelixis, and More",
        "text": "Nvidia and AMD extend gains after the chip makers sign deals with Saudi Arabia, shares of Super Micro Computer surge for a second day, and UnitedHealth claws back some losses from the previous session."
    },
    {
        "headline": "Sector Update: Tech Stocks Advance Wednesday Afternoon",
        "text": "Tech stocks were higher Wednesday afternoon, with the Technology Select Sector SPDR Fund (XLK) addin"
    },
    {
        "headline": "Nvidia Stock, AMD Benefit From Middle East Deals",
        "text": "Nvidia shares rose for a third straight day Wednesday, with sentiment in the artificial-intelligence sector bosted by tech deals that followed President Trump's visit to the Middle East. BofA Securities said Nvidia and Advanced Micro Devices are the top beneficiaries of multi-year AI infrastructure projects announced Tuesday with the Saudi Arabia Public Investment Fund."
    },
    {
        "headline": "AMD vs. Lattice Semiconductor: Which FPGA Stock Has the Edge?",
        "text": "Advanced Micro Devices and LSCC are well-known players in the FPGA market. Let's find out which one is a better investment option."
    },
    {
        "headline": "Advanced Micro Devices (NasdaqGS:AMD) Announces US$6 Billion Buyback And AI Expansion",
        "text": "Advanced Micro Devices (NasdaqGS:AMD) saw its share price rise by 20% over the last month, buoyed by several contributing factors. The announcement of a substantial $6 billion expansion in its stock buyback plan added momentum to the company's market performance. Additionally, AMD's collaboration with HUMAIN on a $10 billion AI infrastructure project, along with the introduction of the EPYC 4005 Series processors, signaled strong growth prospects. These positive developments occurred as the..."
    },
    {
        "headline": "Is Advanced Micro Devices (AMD) the Tech Stock That Trump’s Fellow Republican Bought Amid Market Rout?",
        "text": "We recently published a list of 10 Tech Stocks That Trump’s Fellow Republican Bought Amid Market Rout. In this article, we are going to take a look at where Advanced Micro Devices, Inc. (NASDAQ:AMD) stands against other tech stocks that Trump’s fellow Republican bought amid market rout. Keeping track of politicians’ stock investments is a […]"
    },
    {
        "headline": "Nvidia and Other AI Stocks Climb as Saudi Deals Raise Expectations of More to Come",
        "text": "Nvidia and other AI stocks climbed Wednesday, extending Tuesday's gains as Saudi partnerships stoked excitement for future deals."
    },
    {
        "headline": "NVIDIA, AMD targets raised at BofA following sovereign AI deals",
        "text": "Investing.com -- Bank of America raised its price targets for NVIDIA and AMD (NASDAQ:AMD) on Wednesday, citing wins in sovereign artificial intelligence projects that could help offset export restrictions to China beginning in calendar year 2026."
    },
    {
        "headline": "Why AMD Stock Popped Wednesday Morning",
        "text": "Things are looking up for the artificial intelligence (AI) and semiconductor specialist."
    },
    {
        "headline": "Top Stock Movers Now: Super Micro Computer, AMD, Newmont, and More",
        "text": "U.S. equities were edging up at midday, with the S&P 500 and Nasdaq driven higher by solid gains from tech shares."
    },
    {
        "headline": "AMD CEO Lisa Su tells Gen Z grads ‘don’t walk, run’ towards the hardest challenges at their workplace for a fast track to promotions",
        "text": "The billionaire tech executive reveals that the path up the corporate ladder is full of ups and downs, but every challenge holds a valuable lesson “if you're willing to look for it.”"
    },
    {
        "headline": "Why AMD (AMD) Stock Is Trading Up Today",
        "text": "Shares of computer processor maker AMD (NASDAQ:AMD) jumped 5.4% in the morning session after the company announced a new $6 billion share buyback program. This adds to the approximately $4 billion remaining under the existing program, bringing the total repurchase authorization to around $10 billion."
    },
    {
        "headline": "AMD Stock Jumps as Chip Designer Announces New $6B Buyback Plan",
        "text": "Advanced Micro Devices shares jumped Wednesday, as the chip designer said its board approved a fresh $6 billion share buyback program."
    },
    {
        "headline": "Nvidia Surges as Saudi AI Deals Rewrite Its Total Addressable Market",
        "text": "Wedbush sees $1 trillion in untapped AI market from Middle East investments"
    },
    {
        "headline": "Supermicro Soars Wednesday, Extending Gains as AI Stocks Rally",
        "text": "Super Micro Computer shares soared Wednesday, extending gains as several AI stocks rose on the heels of new partnerships."
    },
    {
        "headline": "White House calls out Boeing, GE Vernova exports in Saudi Arabia pact",
        "text": "President Donald J. Trump announced Saudi Arabia’s $600B commitment to invest in the United States, “building economic ties that will endure for generations to come,” the White House stated. “The first deals under the announcement strengthen our energy security, defense industry, technology leadership, and access to global infrastructure and critical minerals,” the White House added in a press release. The release went on to state in part: “Google (GOOGL), DataVolt, Oracle (ORCL), Salesforce (CR"
    },
    {
        "headline": "AMD Stock Jumps. Buyback News, and More, Boosts AI Chip Maker.",
        "text": "Advanced Micro Devices stock was rising sharply on Wednesday in response to news of an expanded share buyback program and prospective sales of chips to Saudi Arabia. AMD said its board of directors approved a new $6 billion stock buyback program. AMD shares were up 5.5% at $118.66 in early trading."
    },
    {
        "headline": "Arm Eats Into Intel and AMD Market Share in First Quarter, Say Citi Analysts",
        "text": "Arm gains ground as Intel’s market share in the microprocessor market slumps to its lowest level since Citi began tracking in 2002."
    },
    {
        "headline": "AMD Soars on News of Major AI Compute Deal in Saudi Arabia",
        "text": "AMD Rally Extends After Signing?$10B AI Deal in Saudi Arabia"
    },
    {
        "headline": "AMD launches AMD EPYC 4005 Series processors",
        "text": "AMD (AMD) announced the launch of AMD EPYC 4005 Series processors. These purpose-built processors enable right-sized solutions with enterprise-class features and leadership performance for small and medium businesses and hosted IT service providers. AMD EPYC 4005 Series CPUs deliver the performance, features and efficiency growing businesses need to power everything from enterprise applications and virtualized environments to dedicated, all-day hosted services in the cloud. Utilizing the same pr"
    },
    {
        "headline": "AI chipmaker AMD unveils $6 billion buyback plan",
        "text": "Advanced Micro Devices on Wednesday announced a new $6 billion stock buyback plan, joining a string of chipmakers that are looking to reduce their float as the AI trade that has powered their shares shows some signs of slowing. Shares of the Santa Clara, California-based company rose as much as 6.4%. Its shares have fallen more than 6% so far this year, compared with a less than 1% drop for the benchmark Philadelphia Semiconductor Index."
    },
    {
        "headline": "Advanced Micro Devices, Inc. (AMD) and HUMAIN Partner on $10B Global AI Infrastructure Expansion",
        "text": "We recently compiled a list of the 9 AI Stocks Poised to Gain from Trump’s Middle East AI Push. In this article, we are going to take a look at where Advanced Micro Devices, Inc. (NASDAQ:AMD) stands against the other AI stocks. A White House Official said Tuesday that the United States does not need to […]"
    },
    {
        "headline": "AMD Announces New $6 Billion Share Repurchase Authorization",
        "text": "SANTA CLARA, Calif., May 14, 2025 (GLOBE NEWSWIRE) -- AMD (NASDAQ: AMD) today announced that its board of directors approved a new $6 billion share repurchase program. The new authorization is in addition to the remaining balance, as of March 29, 2025, of approximately $4 billion of its existing share repurchase program, increasing the total current repurchase authority to approximately $10 billion. “Our expanded share repurchase program reflects the Board’s confidence in AMD’s strategic directi"
    },
    {
        "headline": "Nvidia and AMD partner with Humain to develop AI data centres",
        "text": "Humain aims to build AI factories in Saudi Arabia with expected capacity of up to 500MW."
    },
    {
        "headline": "AI Chips Update - Saudi Arabia Partners With NVIDIA to Boost AI Leadership",
        "text": "Saudi Arabia is set to emerge as a global leader in AI technology through a strategic partnership with NVIDIA, focused on establishing AI infrastructure across the nation. This collaboration aims to build AI factories powered by NVIDIA’s advanced GPUs, with a projected capacity of up to 500 megawatts over the next five years. Key initiatives include the deployment of an NVIDIA Omniverse Cloud for simulating AI solutions with digital twins and the establishment of a sovereign AI factory with..."
    },
    {
        "headline": "Trending tickers: Nvidia, Super Micro, Palantir, Tui and Burberry",
        "text": "The latest investor updates on stocks that are trending on Wednesday."
    },
    {
        "headline": "NVIDIA Leads Chip Stocks Rally on Saudi Arabia AI Data Center Deal",
        "text": "Chip Stocks Rally on Nvidia's Middle East AI Push"
    }
]