[
    {
        "headline": "Gold prices fall as easing trade concerns dampen appeal",
        "text": "Gold prices fell on Friday, as investor concerns over Donald Trump's tariffs continued to ease."
    },
    {
        "headline": "Oil prices tumble 3% on potential for US-Iran deal and higher inventories",
        "text": "Oil prices slid more than 3% on Thursday morning, amid expectations of a potential nuclear deal between the US and Iran."
    },
    {
        "headline": "Gold Declines as Growing Trade Optimism Hurts Haven Demand",
        "text": "(Bloomberg) -- Gold slipped to the lowest in more than a month as tension eased in the global trade war, pushing investors away from haven demand. Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’Power-Hungry Data Centers Are Warming Homes in the NordicsHow a Highway Became San Francisco’s Newest ParkA New Central Park Amenity, Tailored to Its East Harlem NeighborsMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Progress in trade talks help"
    },
    {
        "headline": "Gold & the Fed: Investing in the metal amid rate cut hopes",
        "text": "Gold (GC=F) prices tick higher on Tuesday as softer-than-expected US inflation data fuels new hopes for the Federal Reserve to cut interest rates. Bob Iaccino, Path Trading Partners chief market strategist and Co-Host of The Futures Edge Podcast, breaks down why he still sees upside for gold and how peoples should be investing into the commodity. To watch more expert insights and analysis on the latest market action, check out more Market Domination&nbsp;here."
    },
    {
        "headline": "Oil dips after rally fuelled by US-China tariff truce",
        "text": "Gold prices were lower too, as the de-escalation in US-China trade tensions weakened safe-haven demand"
    },
    {
        "headline": "Gold prices rise as investors 'value-buying' after US-China tariff truce",
        "text": "Gold prices recovered some ground on Tuesday morning, after having fallen following news of a tariff truce between the US and China."
    },
    {
        "headline": "Oil prices soar, gold slips on US-China trade updates",
        "text": "Crude oil prices (CL=F, BZ=F) are seeing a boost after the US and China agree to pause their reciprocal tariffs for 90 days, while gold (GC=F) edges lower Monday morning. DoubleLine portfolio manager and strategic commodity strategy Jeff Mayberry talks about the price outlook on these commodities. To watch more expert insights and analysis on the latest market action, check out more Catalysts&nbsp;here."
    },
    {
        "headline": "Oil prices rise, gold slips, Kindly MD-Nakamoto merger",
        "text": "Yahoo Finance host&nbsp;Josh Lipton tracks today's top moving stocks and biggest market stories in this Market Minute, including rising oil prices (CL=F, BZ=F) after US and Chinese officials agree to terms, gold prices (GC=F) slip, and Kindly MD (KDLY) shares skyrocket on headlines of its merger with Nakamoto to establish a bitcoin (BTC-USD) treasury. Stay up to date on the latest market action, minute-by-minute, with&nbsp;Yahoo Finance's Market Minute."
    },
    {
        "headline": "US-China trade truce, April CPI, drug prices: 3 Things",
        "text": "US stock futures (ES=F, NQ=F, YM=F) are surging Monday morning after US and China officials agreed to significant cuts to each country's respective tariff rates in a 90-day cool-off period. April's Consumer Price Index (CPI) is due out tomorrow, reporting month-over-month trends in US inflation rates. President Trump vows to cut prescription drug prices by as much as 80%. In turn, pharmaceutical stocks are seeing across the board pullbacks in pre-market trading. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here."
    },
    {
        "headline": "Gold takes a dive as US-China trade deal dents safe-haven appeal",
        "text": "Meanwhile, oil jumped by almost 3% as Washington and Beijing agreed to slash tariffs on each other."
    },
    {
        "headline": "Oil prices rise ahead of US-China trade talks",
        "text": "Oil prices rose in early European trading on Friday, ahead of trade talks between the US and China this weekend."
    },
    {
        "headline": "Pound rises after Bank of England interest rate cut",
        "text": "The pound rose against the dollar on Thursday afternoon, after the Bank of England cut interest rates."
    },
    {
        "headline": "Gold Holds Drop as Powell Says Fed in No Hurry to Adjust Rates",
        "text": "(Bloomberg) -- Gold held declines after Federal Reserve Chair Jerome Powell said the US central bank isn’t in a rush to adjust interest rates despite President Donald Trump’s trade war.Most Read from BloombergThe Battle Over the Fate of Detroit’s Renaissance CenterVail to Borrow Muni Debt to Ease Ski Resort Town Housing CrunchIceland Plans for a More Volcanic FutureIs Trump’s Plan to Reopen the Notorious Alcatraz Prison Realistic?Powell said it’s still appropriate to keep rates on hold. “We’re i"
    },
    {
        "headline": "Oil prices rise amid US-China trade talk optimism",
        "text": "Oil prices rose on Wednesday morning, amid investor optimism around trade talks between the US and China, which are due to begin this week."
    },
    {
        "headline": "Market's 200-day moves, dollar trends, gold: Market Takeaways",
        "text": "All three of the US market indexes (^DJI, ^IXIC, ^GSPC) ended the day in negative territory, marking their second session of losses in a row after snapping their respective win streaks. This all comes ahead of the Federal Reserve's next interest rate decision to come tomorrow, Wednesday, May 7. Yahoo Finance markets and data editor Jared Blikre explains several key market themes, including the market's 200-day moving averages, falling values for the US dollar in foreign currency exchanges, and gold price volatility. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend&nbsp;here."
    },
    {
        "headline": "Gold Gains as Investors Digest Bessent Comments, Await Fed",
        "text": "(Bloomberg) -- Gold advanced as investors digested trade comments from US Treasury Secretary Scott Bessent while awaiting the Federal Reserve’s interest-rate decision.Most Read from BloombergThe Battle Over the Fate of Detroit’s Renaissance CenterNYC Real Estate Industry Asks Judge to Block New Broker Fee LawNJ Transit Strike Would Be ‘Disaster’ for Region, Sherrill SaysVail to Borrow Muni Debt to Ease Ski Resort Town Housing CrunchIceland Plans for a More Volcanic FutureBessent that some “very"
    },
    {
        "headline": "Gold hits two-week high over renewed tariff fears",
        "text": "Pound pushes higher against the dollar ahead of BoE decision"
    },
    {
        "headline": "Gold prices rise: Portfolio mgr. outlines 3 gold mining stocks",
        "text": "Gold (GC=F) prices are rising as a weaker US dollar (DX=F,&nbsp;DX-Y.NYB) and looming trade tariff talks push investors toward safe-haven assets. Chris Mancini, associate portfolio manager of the Gabelli Gold Fund at Gabelli Funds, joins Wealth to explain why gold is gaining more appeal. To watch more expert insights and analysis on the latest market action, check out more Wealth&nbsp;here."
    },
    {
        "headline": "Gold Rises Amid Trade-War Risks While Traders Await Fed Decision",
        "text": "(Bloomberg) -- Gold advanced amid ongoing trade war risks following US President Donald Trump’s latest tariff comments, while investors await a Federal Reserve interest-rate decision later this week.Most Read from BloombergThe Battle Over the Fate of Detroit’s Renaissance CenterNYC Real Estate Industry Asks Judge to Block New Broker Fee LawNJ Transit Strike Would Be ‘Disaster’ for Region, Sherrill SaysIceland Plans for a More Volcanic FutureVail to Borrow Muni Debt to Ease Ski Resort Town Housin"
    },
    {
        "headline": "What investors need to know during times of turbulence",
        "text": "Worried about your investments? Here's what Ritholtz's Callie Cox had to say about what to do right now."
    },
    {
        "headline": "Gold prices fall as easing trade concerns dampen appeal",
        "text": "Gold prices fell on Friday, as investor concerns over Donald Trump's tariffs continued to ease."
    },
    {
        "headline": "Oil prices tumble 3% on potential for US-Iran deal and higher inventories",
        "text": "Oil prices slid more than 3% on Thursday morning, amid expectations of a potential nuclear deal between the US and Iran."
    },
    {
        "headline": "Gold Declines as Growing Trade Optimism Hurts Haven Demand",
        "text": "(Bloomberg) -- Gold slipped to the lowest in more than a month as tension eased in the global trade war, pushing investors away from haven demand. Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’Power-Hungry Data Centers Are Warming Homes in the NordicsHow a Highway Became San Francisco’s Newest ParkA New Central Park Amenity, Tailored to Its East Harlem NeighborsMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Progress in trade talks help"
    },
    {
        "headline": "Gold & the Fed: Investing in the metal amid rate cut hopes",
        "text": "Gold (GC=F) prices tick higher on Tuesday as softer-than-expected US inflation data fuels new hopes for the Federal Reserve to cut interest rates. Bob Iaccino, Path Trading Partners chief market strategist and Co-Host of The Futures Edge Podcast, breaks down why he still sees upside for gold and how peoples should be investing into the commodity. To watch more expert insights and analysis on the latest market action, check out more Market Domination&nbsp;here."
    },
    {
        "headline": "Oil dips after rally fuelled by US-China tariff truce",
        "text": "Gold prices were lower too, as the de-escalation in US-China trade tensions weakened safe-haven demand"
    },
    {
        "headline": "Gold prices rise as investors 'value-buying' after US-China tariff truce",
        "text": "Gold prices recovered some ground on Tuesday morning, after having fallen following news of a tariff truce between the US and China."
    },
    {
        "headline": "Oil prices soar, gold slips on US-China trade updates",
        "text": "Crude oil prices (CL=F, BZ=F) are seeing a boost after the US and China agree to pause their reciprocal tariffs for 90 days, while gold (GC=F) edges lower Monday morning. DoubleLine portfolio manager and strategic commodity strategy Jeff Mayberry talks about the price outlook on these commodities. To watch more expert insights and analysis on the latest market action, check out more Catalysts&nbsp;here."
    },
    {
        "headline": "Oil prices rise, gold slips, Kindly MD-Nakamoto merger",
        "text": "Yahoo Finance host&nbsp;Josh Lipton tracks today's top moving stocks and biggest market stories in this Market Minute, including rising oil prices (CL=F, BZ=F) after US and Chinese officials agree to terms, gold prices (GC=F) slip, and Kindly MD (KDLY) shares skyrocket on headlines of its merger with Nakamoto to establish a bitcoin (BTC-USD) treasury. Stay up to date on the latest market action, minute-by-minute, with&nbsp;Yahoo Finance's Market Minute."
    },
    {
        "headline": "US-China trade truce, April CPI, drug prices: 3 Things",
        "text": "US stock futures (ES=F, NQ=F, YM=F) are surging Monday morning after US and China officials agreed to significant cuts to each country's respective tariff rates in a 90-day cool-off period. April's Consumer Price Index (CPI) is due out tomorrow, reporting month-over-month trends in US inflation rates. President Trump vows to cut prescription drug prices by as much as 80%. In turn, pharmaceutical stocks are seeing across the board pullbacks in pre-market trading. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here."
    },
    {
        "headline": "Gold takes a dive as US-China trade deal dents safe-haven appeal",
        "text": "Meanwhile, oil jumped by almost 3% as Washington and Beijing agreed to slash tariffs on each other."
    },
    {
        "headline": "Oil prices rise ahead of US-China trade talks",
        "text": "Oil prices rose in early European trading on Friday, ahead of trade talks between the US and China this weekend."
    },
    {
        "headline": "Pound rises after Bank of England interest rate cut",
        "text": "The pound rose against the dollar on Thursday afternoon, after the Bank of England cut interest rates."
    },
    {
        "headline": "Gold Holds Drop as Powell Says Fed in No Hurry to Adjust Rates",
        "text": "(Bloomberg) -- Gold held declines after Federal Reserve Chair Jerome Powell said the US central bank isn’t in a rush to adjust interest rates despite President Donald Trump’s trade war.Most Read from BloombergThe Battle Over the Fate of Detroit’s Renaissance CenterVail to Borrow Muni Debt to Ease Ski Resort Town Housing CrunchIceland Plans for a More Volcanic FutureIs Trump’s Plan to Reopen the Notorious Alcatraz Prison Realistic?Powell said it’s still appropriate to keep rates on hold. “We’re i"
    },
    {
        "headline": "Oil prices rise amid US-China trade talk optimism",
        "text": "Oil prices rose on Wednesday morning, amid investor optimism around trade talks between the US and China, which are due to begin this week."
    },
    {
        "headline": "Market's 200-day moves, dollar trends, gold: Market Takeaways",
        "text": "All three of the US market indexes (^DJI, ^IXIC, ^GSPC) ended the day in negative territory, marking their second session of losses in a row after snapping their respective win streaks. This all comes ahead of the Federal Reserve's next interest rate decision to come tomorrow, Wednesday, May 7. Yahoo Finance markets and data editor Jared Blikre explains several key market themes, including the market's 200-day moving averages, falling values for the US dollar in foreign currency exchanges, and gold price volatility. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend&nbsp;here."
    },
    {
        "headline": "Gold Gains as Investors Digest Bessent Comments, Await Fed",
        "text": "(Bloomberg) -- Gold advanced as investors digested trade comments from US Treasury Secretary Scott Bessent while awaiting the Federal Reserve’s interest-rate decision.Most Read from BloombergThe Battle Over the Fate of Detroit’s Renaissance CenterNYC Real Estate Industry Asks Judge to Block New Broker Fee LawNJ Transit Strike Would Be ‘Disaster’ for Region, Sherrill SaysVail to Borrow Muni Debt to Ease Ski Resort Town Housing CrunchIceland Plans for a More Volcanic FutureBessent that some “very"
    },
    {
        "headline": "Gold hits two-week high over renewed tariff fears",
        "text": "Pound pushes higher against the dollar ahead of BoE decision"
    },
    {
        "headline": "Gold prices rise: Portfolio mgr. outlines 3 gold mining stocks",
        "text": "Gold (GC=F) prices are rising as a weaker US dollar (DX=F,&nbsp;DX-Y.NYB) and looming trade tariff talks push investors toward safe-haven assets. Chris Mancini, associate portfolio manager of the Gabelli Gold Fund at Gabelli Funds, joins Wealth to explain why gold is gaining more appeal. To watch more expert insights and analysis on the latest market action, check out more Wealth&nbsp;here."
    },
    {
        "headline": "Gold Rises Amid Trade-War Risks While Traders Await Fed Decision",
        "text": "(Bloomberg) -- Gold advanced amid ongoing trade war risks following US President Donald Trump’s latest tariff comments, while investors await a Federal Reserve interest-rate decision later this week.Most Read from BloombergThe Battle Over the Fate of Detroit’s Renaissance CenterNYC Real Estate Industry Asks Judge to Block New Broker Fee LawNJ Transit Strike Would Be ‘Disaster’ for Region, Sherrill SaysIceland Plans for a More Volcanic FutureVail to Borrow Muni Debt to Ease Ski Resort Town Housin"
    },
    {
        "headline": "What investors need to know during times of turbulence",
        "text": "Worried about your investments? Here's what Ritholtz's Callie Cox had to say about what to do right now."
    },
    {
        "headline": "Market Prepares for the FED: Traders Expect No Surprise",
        "text": "Gold had probably finished its active phase of accumulation and has a chance of locking in a consolidation, here’s why"
    },
    {
        "headline": "Gold stems sell-off on signs of easing US-China trade tensions",
        "text": "China has said it's evaluating approaches from US officials to start negotiations about tariffs."
    },
    {
        "headline": "Stock market today: Nasdaq surges as AI trade reignites amid Big Tech earnings, Dow, S&P 500 rise for 8th day",
        "text": "Microsoft and Meta's strong earnings reports eased investor fears of an economic slowdown amid President Trump's tariffs."
    },
    {
        "headline": "Gold Drops to Two-Week Low as Trade Hopes Curb Haven Appeal",
        "text": "(Bloomberg) -- Gold dropped to a two-week low on signs of potential trade-talk progress between the US and other nations, quelling demand for a haven despite worries about weakening economies.Most Read from BloombergNJ Transit Urges Commuters to Work Remotely If Union StrikesNYC Lost $9 Billion of Income to Miami, Palm Beach in Five YearsNew York City Transit System Chips Away at Subway Fare EvasionNYC’s Congestion Toll Raised $159 Million in the First QuarterNYC’s MTA to Cut Costs Instead of Bo"
    },
    {
        "headline": "Gold extends losses as tariff tensions ease",
        "text": "Oil prices head lower after posting biggest monthly fall since 2021."
    },
    {
        "headline": "Gold soars, tech stumbles: The market story of Trump's first 100 days in 1 chart",
        "text": "After cheering his election win last year, markets have had a cooler reaction to President Trump's first 100 days in office. Unless you're a gold bug."
    },
    {
        "headline": "Trump's first 100 days: Where the markets stand",
        "text": "President Donald Trump has been celebrating 100 days in office. So how have the markets performed? The S&P 500 (^GSPC) posted a 7% decline over the first 100 days. Bitcoin (BTC-USD) and oil (CL=F) have slipped, too. But one asset that has risen? Gold (GOLD) as investors sought safety during the recent market volatility. Piper Sandler chief investment strategist Michael Kantrowitz says that the issue is that markets are still adjusting to the high tariffs imposed by the president.&nbsp; Market Domination Overtime Anchor Julie Hyman takes a closer look at the market returns under the first 100 days of Trump 2.0. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here."
    },
    {
        "headline": "The pros and cons of investing in gold",
        "text": "Gold prices (GC=F) are pulling back slightly after hitting a record high last week, as more investors look to it as a hedge during market volatility. Yahoo Finance personal finance editor Molly Moorhead breaks down how to best invest in gold, including investments into gold ETFs. To watch more expert insights and analysis on the latest market action, check out more Wealth&nbsp;here."
    },
    {
        "headline": "Oil prices on course for biggest monthly fall since 2021",
        "text": "The drop comes as the global trade war has put doubt in the minds of traders about demand."
    },
    {
        "headline": "Gold Falls on Stronger Dollar as US Offers Auto Tariff Reprieve",
        "text": "(Bloomberg) -- Gold declined on expectations President Donald Trump will ease the impact of his auto tariffs, weighing on haven demand amid hopes of a further dialing down of trade tensions.Most Read from BloombergNew York City Transit System Chips Away at Subway Fare EvasionNYC’s Congestion Toll Raised $159 Million in the First QuarterThe Last Thing US Transit Agencies Should Do NowAt Bryn Mawr, a Monumental Plaza Traces the Steps of Black HistoryAt the National Public Housing Museum, an Embatt"
    },
    {
        "headline": "Here is one thing that could derail the gold rally",
        "text": "Gold (GC=F) prices have soared nearly 30% so far this year, hitting new all-time highs. In the video above, HSBC chief precious metals analyst James Steel explains what has driven gold prices higher and what could put that rally on hold. To watch more expert insights and analysis on the latest market action, check out more Market Domination here."
    },
    {
        "headline": "Oil prices fall as fears trade war will dent demand linger",
        "text": "Oil prices fell as investors remained concerned about the impact of a US-China trade war on demand for fuel."
    },
    {
        "headline": "4 market signals to watch, strategist says",
        "text": "Markets (^GSPC,&nbsp;^IXIC,&nbsp;^DJI) may be setting up for a familiar pattern as key indicators like the gold-to-silver ratio (GC=F, SI=F), long bonds, SPDR S&P 500 (SPY), and US dollar (DX=F) mirror moves seen during the 2022 downturn. Michele Schneider, MarketGauge.com chief strategist, joins Morning Brief to break down what these signals could mean for investors. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here."
    },
    {
        "headline": "Gold price dips as US-China trade tensions ease",
        "text": "Oil rose but global demand outlook remains blurry amid Trump's trade war."
    },
    {
        "headline": "Oil heads for weekly fall under US-China tariff woes",
        "text": "Gold and pound retreat as investors try to figure out Donald Trump's policies."
    }
]