[
    {
        "headline": "What’s next for Tesla as Musk enters a new phase",
        "text": "It's not clear if Tesla's next mission has the moral gravity or commercial urgency to repeat its earlier success."
    },
    {
        "headline": "Home Depot & Lowe's, Elon Musk, D-Wave unveils Advantage2",
        "text": "Yahoo Finance host Madison Mills tracks today's top moving stocks and biggest market stories in this Market Minute, including the stock moves of home improvement retailers Home Depot (HD) and Lowe's (LOW), Tesla (TSLA) CEO Elon Musk committing to lead the EV innovator for at least another five years, and D-Wave Quantum (QBTS) debuting its Advantage2 computing system. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute."
    },
    {
        "headline": "Electric Vehicles Update - 800V Systems Propel Future Efficiencies and Opportunities",
        "text": "The market for 800V electrified powertrain systems in electric vehicles is expected to experience significant growth from 2024 to 2035, driven by the need for increased efficiency, faster charging times, and improved vehicle performance compared to traditional 400V systems. Key contributors to this market expansion include advancements in silicon carbide technology and the development of ultra-fast charging infrastructure. While challenges such as high costs and infrastructure needs persist,..."
    },
    {
        "headline": "Tesla (TSLA) and xAI Expand GPU Buildout Plans",
        "text": "xAI installed over 200,000 GPUs at its Memphis facility and plans to scale to 1 million."
    },
    {
        "headline": "Tesla Is Entering a 'Golden Era,' Says Ives",
        "text": "Dan Ives of Wedbush Securities, says Tesla is about to enter a \"golden age\" now that Elon Musk is more focused on the company and because of robotics and autonomous driving. Ives says it's possible for Tesla to reach a market cap of $2 trillion. He speaks on \"Bloomberg Surveillance.\""
    },
    {
        "headline": "These Stocks Are Moving the Most Today: Wolfspeed, Target, UnitedHealth, Tesla, Nvidia, Lowe’s, Alphabet, XPeng, and More",
        "text": "Wolfspeed is preparing to file for bankruptcy within a matter of weeks, The Wall Street Journal reports, Target’s earnings miss analysts’ estimates while Lowe’s tops expectations, and UnitedHealth gets a downgrade."
    },
    {
        "headline": "Is Elon Musk Losing Clout In White House? Report Flags Sharp Drop In Trump Mentions, Truth Social Posts, Official Briefings",
        "text": "The once prominent figure of Elon Musk in President Donald Trump’s administration appears to be reportedly fading in a gradual manner. The Tesla Inc. (NASDAQ:TSLA) CEO, who was frequently mentioned by Trump and his administration, has not been referenced in over a month. What Happened: The frequency of Musk’s mentions in Trump’s speeches, social media posts, White House briefings and fundraising emails has seen a significant drop. The White House, when questioned about this change, did not direc"
    },
    {
        "headline": "Google Showcased Its Latest Tech. Why AI Is All That Matters for Alphabet Stock.",
        "text": "Alphabet unveils new gadgets, House lawmakers wrestle over tax bill, Musk is cutting back political spending, and more news to start your day."
    },
    {
        "headline": "Tesla, Inc. (TSLA) on Track to Test Robotaxi in Austin by June",
        "text": "Tesla, Inc. (NASDAQ:TSLA)’s CEO, Elon Musk, has confirmed in an interview with CNBC that the company is on schedule to launch robotaxi trials in Austin, Texas, by the end of June. He also shared plans to introduce the service in San Francisco and Los Angeles after Austin. The EV maker will begin the trials with […]"
    },
    {
        "headline": "Tesla Stock Is Rising. Elon Musk Has Had a Lot to Say.",
        "text": "Investors will parse Musk’s recent words for days, looking for clues about Telsa’s robotaxi rollout and AI development."
    },
    {
        "headline": "Tesla Stock vs. Amazon Stock: Billionaires Buy One and Sell the Other",
        "text": "Israel Englander and Philippe Laffont bought Amazon and sold Tesla in the first quarter, and Wall Street's median target prices imply those trades are still smart choices today. Amazon has a strong presence in e-commerce, digital advertising, and cloud computing, and the company handily beat Wall Street's earnings estimates in the past six quarters. Tesla has lost substantial market share in electric cars across the U.S., Europe, and China, but the company has substantial long-term opportunities in autonomous cars and robots."
    },
    {
        "headline": "Elon Musk sends strong message to Tesla stock investors",
        "text": "Musk assuaged investor fears at the Qatar Economic Forum on Tuesday."
    },
    {
        "headline": "Waymo Claims to have Doubled its Robotaxi Trips in Five Months, Reaching 10 Million",
        "text": "Waymo, the autonomous ride-hailing business owned by Alphabet Inc. (NASDAQ:GOOGL), accomplished 10 million paid robotaxi trips, co-CEO Tekedra Mawakana revealed at the Google I/O developer conference on Tuesday, May 20, 2025. The significant achievement doubles the total number of trips in just five months and includes rides in Austin, Los Angeles, San Francisco, and the […]"
    },
    {
        "headline": "Tesla and xAI Plan to Keep Buying Chips From Nvidia and AMD, Musk Says",
        "text": "Elon Musk expects Tesla and xAI to continue buying chips from Nvidia and Advanced Micro Devices, the CEO said in an interview with CNBC Tuesday."
    },
    {
        "headline": "Tesla (TSLA) Faces Scrutiny as Morgan Stanley Flags Valuation Gaps",
        "text": "Analyst urges broader view beyond EVs to justify premium stock price"
    },
    {
        "headline": "Tesla Bull Dan Ives Sees 'Different Musk' as CEO Talks Up Plans for EV Maker",
        "text": "Tesla CEO Elon Musk emphasized his commitment to the role and robotaxi plans in a string of interviews Tuesday. One of Wall Street's biggest Tesla bulls said he's seeing \"a different Musk.\""
    },
    {
        "headline": "Tesla (TSLA) Gains as Musk Commits to CEO Role Through 2030",
        "text": "Elon Musk says he will remain Tesla CEO for at least five more years"
    },
    {
        "headline": "Options Traders Are More Bullish on Tesla",
        "text": "Traders are becoming more bullish on Tesla. The ratio of Tesla put options to call options fell to its lowest level since November, Cboe Global Markets data showed. That suggests traders are favoring bullish calls over puts that would pay out if Tesla's stock declines."
    },
    {
        "headline": "Stocks to Watch Recap: Home Depot, Tesla, Uber, UnitedHealth",
        "text": "After-Hours Earnings: Shares of Palo Alto Networks (PANW) fell about 4% after the cybersecurity company reported quarterly results, while shares of home builder Toll Brothers (TOL) climbed 6% after its results."
    },
    {
        "headline": "Elon Musk to Cut Back Political Spending",
        "text": "After making huge bets on the 2024 election, the Tesla CEO said he is now focused on winning more control of the company."
    },
    {
        "headline": "What’s next for Tesla as Musk enters a new phase",
        "text": "It's not clear if Tesla's next mission has the moral gravity or commercial urgency to repeat its earlier success."
    },
    {
        "headline": "Home Depot & Lowe's, Elon Musk, D-Wave unveils Advantage2",
        "text": "Yahoo Finance host Madison Mills tracks today's top moving stocks and biggest market stories in this Market Minute, including the stock moves of home improvement retailers Home Depot (HD) and Lowe's (LOW), Tesla (TSLA) CEO Elon Musk committing to lead the EV innovator for at least another five years, and D-Wave Quantum (QBTS) debuting its Advantage2 computing system. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute."
    },
    {
        "headline": "Electric Vehicles Update - 800V Systems Propel Future Efficiencies and Opportunities",
        "text": "The market for 800V electrified powertrain systems in electric vehicles is expected to experience significant growth from 2024 to 2035, driven by the need for increased efficiency, faster charging times, and improved vehicle performance compared to traditional 400V systems. Key contributors to this market expansion include advancements in silicon carbide technology and the development of ultra-fast charging infrastructure. While challenges such as high costs and infrastructure needs persist,..."
    },
    {
        "headline": "Tesla (TSLA) and xAI Expand GPU Buildout Plans",
        "text": "xAI installed over 200,000 GPUs at its Memphis facility and plans to scale to 1 million."
    },
    {
        "headline": "Tesla Is Entering a 'Golden Era,' Says Ives",
        "text": "Dan Ives of Wedbush Securities, says Tesla is about to enter a \"golden age\" now that Elon Musk is more focused on the company and because of robotics and autonomous driving. Ives says it's possible for Tesla to reach a market cap of $2 trillion. He speaks on \"Bloomberg Surveillance.\""
    },
    {
        "headline": "These Stocks Are Moving the Most Today: Wolfspeed, Target, UnitedHealth, Tesla, Nvidia, Lowe’s, Alphabet, XPeng, and More",
        "text": "Wolfspeed is preparing to file for bankruptcy within a matter of weeks, The Wall Street Journal reports, Target’s earnings miss analysts’ estimates while Lowe’s tops expectations, and UnitedHealth gets a downgrade."
    },
    {
        "headline": "Is Elon Musk Losing Clout In White House? Report Flags Sharp Drop In Trump Mentions, Truth Social Posts, Official Briefings",
        "text": "The once prominent figure of Elon Musk in President Donald Trump’s administration appears to be reportedly fading in a gradual manner. The Tesla Inc. (NASDAQ:TSLA) CEO, who was frequently mentioned by Trump and his administration, has not been referenced in over a month. What Happened: The frequency of Musk’s mentions in Trump’s speeches, social media posts, White House briefings and fundraising emails has seen a significant drop. The White House, when questioned about this change, did not direc"
    },
    {
        "headline": "Google Showcased Its Latest Tech. Why AI Is All That Matters for Alphabet Stock.",
        "text": "Alphabet unveils new gadgets, House lawmakers wrestle over tax bill, Musk is cutting back political spending, and more news to start your day."
    },
    {
        "headline": "Tesla, Inc. (TSLA) on Track to Test Robotaxi in Austin by June",
        "text": "Tesla, Inc. (NASDAQ:TSLA)’s CEO, Elon Musk, has confirmed in an interview with CNBC that the company is on schedule to launch robotaxi trials in Austin, Texas, by the end of June. He also shared plans to introduce the service in San Francisco and Los Angeles after Austin. The EV maker will begin the trials with […]"
    },
    {
        "headline": "Tesla Stock Is Rising. Elon Musk Has Had a Lot to Say.",
        "text": "Investors will parse Musk’s recent words for days, looking for clues about Telsa’s robotaxi rollout and AI development."
    },
    {
        "headline": "Tesla Stock vs. Amazon Stock: Billionaires Buy One and Sell the Other",
        "text": "Israel Englander and Philippe Laffont bought Amazon and sold Tesla in the first quarter, and Wall Street's median target prices imply those trades are still smart choices today. Amazon has a strong presence in e-commerce, digital advertising, and cloud computing, and the company handily beat Wall Street's earnings estimates in the past six quarters. Tesla has lost substantial market share in electric cars across the U.S., Europe, and China, but the company has substantial long-term opportunities in autonomous cars and robots."
    },
    {
        "headline": "Elon Musk sends strong message to Tesla stock investors",
        "text": "Musk assuaged investor fears at the Qatar Economic Forum on Tuesday."
    },
    {
        "headline": "Waymo Claims to have Doubled its Robotaxi Trips in Five Months, Reaching 10 Million",
        "text": "Waymo, the autonomous ride-hailing business owned by Alphabet Inc. (NASDAQ:GOOGL), accomplished 10 million paid robotaxi trips, co-CEO Tekedra Mawakana revealed at the Google I/O developer conference on Tuesday, May 20, 2025. The significant achievement doubles the total number of trips in just five months and includes rides in Austin, Los Angeles, San Francisco, and the […]"
    },
    {
        "headline": "Tesla and xAI Plan to Keep Buying Chips From Nvidia and AMD, Musk Says",
        "text": "Elon Musk expects Tesla and xAI to continue buying chips from Nvidia and Advanced Micro Devices, the CEO said in an interview with CNBC Tuesday."
    },
    {
        "headline": "Tesla (TSLA) Faces Scrutiny as Morgan Stanley Flags Valuation Gaps",
        "text": "Analyst urges broader view beyond EVs to justify premium stock price"
    },
    {
        "headline": "Tesla Bull Dan Ives Sees 'Different Musk' as CEO Talks Up Plans for EV Maker",
        "text": "Tesla CEO Elon Musk emphasized his commitment to the role and robotaxi plans in a string of interviews Tuesday. One of Wall Street's biggest Tesla bulls said he's seeing \"a different Musk.\""
    },
    {
        "headline": "Tesla (TSLA) Gains as Musk Commits to CEO Role Through 2030",
        "text": "Elon Musk says he will remain Tesla CEO for at least five more years"
    },
    {
        "headline": "Options Traders Are More Bullish on Tesla",
        "text": "Traders are becoming more bullish on Tesla. The ratio of Tesla put options to call options fell to its lowest level since November, Cboe Global Markets data showed. That suggests traders are favoring bullish calls over puts that would pay out if Tesla's stock declines."
    },
    {
        "headline": "Stocks to Watch Recap: Home Depot, Tesla, Uber, UnitedHealth",
        "text": "After-Hours Earnings: Shares of Palo Alto Networks (PANW) fell about 4% after the cybersecurity company reported quarterly results, while shares of home builder Toll Brothers (TOL) climbed 6% after its results."
    },
    {
        "headline": "Elon Musk to Cut Back Political Spending",
        "text": "After making huge bets on the 2024 election, the Tesla CEO said he is now focused on winning more control of the company."
    },
    {
        "headline": "Cantor Sees Tesla Ahead of Lucid",
        "text": "Scale, 47% post-earnings rally and five near-term catalysts seal the deal"
    },
    {
        "headline": "Tesla Stock Is Rising. Musk Had Good News on Robotaxis, Political Spending.",
        "text": "Morgan Stanley analyst Adam Jonas values the company at roughly $1.3 trillion. Less than $300 billion of that comes from the business of selling cars."
    },
    {
        "headline": "These Stocks Moved the Most Today: Moderna, Home Depot, Tesla, CATL, Nvidia, D-Wave Quantum, Viking Holdings, and More",
        "text": "Moderna stock soars as the FDA plans to stick to its existing process for updating Covid-19 shots for older adults and those at a high risk of severe illness, while Home Depot says it plans to keep prices unchanged despite new tariffs."
    },
    {
        "headline": "Markets drop amid debt jitters, Tesla climbs on Musk plan to lower political spending",
        "text": "Stocks remained relatively stable after a 6-day winning streak."
    },
    {
        "headline": "Elon Musk says he will lead Tesla for at least another five years",
        "text": "Elon Musk says he’ll be sticking around as CEO of Tesla for the next few years."
    },
    {
        "headline": "Sector Update: Consumer Stocks Mixed Late Afternoon",
        "text": "Consumer stocks were mixed late Tuesday afternoon, with the Consumer Staples Select Sector SPDR Fund"
    },
    {
        "headline": "Tesla's Valuation 'Problem' Could Get Worse Before It Gets Better, Morgan Stanley Says",
        "text": "It’s harder than ever for Tesla investors to justify the stock’s sky-high share price, Morgan Stanley analysts wrote to clients this week, and suggested that’s likely to get worse before it improves."
    },
    {
        "headline": "Elon Musk Shores Up Tesla Leadership and Starlink Plans",
        "text": "Five-year CEO vow and IPO tease boost strategic visibility"
    },
    {
        "headline": "Tesla CFO earns staggering $139M compensation package",
        "text": "Tesla's chief financial officer, Vaibhav Taneja, took home a $139 million pay package last year. It was tied to stock options and equity awards, according to a regulatory filing."
    },
    {
        "headline": "Elon Musk Drops Bombshell: Staying at Tesla, Ditching Politics--Stock Reacts Fast",
        "text": "Elon Musk says he's in for five more years and done with political drama. Wall Street took notice."
    },
    {
        "headline": "Morgan Stanley Stays Bullish on Tesla (TSLA), Cites China EV Pressure",
        "text": "We recently published a list of 12 AI Stocks Making Waves on Wall Street Today. In this article, we are going to take a look at where Tesla, Inc. (NASDAQ:TSLA) stands against other AI stocks that are making waves on Wall Street today. The United States recently issued guidance threatening companies not to use advanced […]"
    },
    {
        "headline": "Magnificent Seven Stocks: Apple, Amazon, Nvidia Slide; Tesla Rallies",
        "text": "Dubbed the Magnificent Seven stocks, Apple, Microsoft, Google parent Alphabet, Amazon.com, Nvidia, Meta Platforms and Tesla lived up to their name in 2024 with solid gains. Through the first four months of 2025, however, performance for these mega-cap stocks has been negative thus far."
    },
    {
        "headline": "Elon Musk's Mother Shares 1989 Aptitude Test Results Revealing 'Highest Engineering Aptitude' Score Of Tesla CEO At Age 17",
        "text": "Maye Musk, mother of Tesla Inc. CEO Elon Musk, revealed on Sunday a 1989 computer aptitude test showing her son’s exceptional engineering potential at age 17. What Happened: “While sorting through photos, I came across computer aptitude test results of Elon Musk at 17. My genius boy. Proud mom,” the 77-year-old model and dietitian wrote on X. The University of Pretoria document, dated May 17, 1989, shows Musk received A+ scores in both operating and programming on ISM tests, results that the tec"
    },
    {
        "headline": "Tesla on track to launch robotaxi trial in Austin, Texas, by June end, Musk says",
        "text": "The electric vehicle maker will roll out about 10 self-driving cars in some parts of the city, and scale up to about a thousand within a few months, Musk told CNBC in an interview. \"We are actually going to deploy not to the entire Austin region, but only the parts that are the safest.\" Tesla sales have fallen worldwide with rising competition and as Musk faces a backlash for his right-wing political views and his work for U.S. President Donald Trump."
    },
    {
        "headline": "Tesla Rises as Musk Steps Back from Politics. The Rest of the Mag 7 Are Falling.",
        "text": "Tesla stock was leaving the Magnificent Seven in the dust in a sideways day of trading. The electric vehicle stock was up 3.2% after CEO Elon Musk said at a conference in Qatar that he would be taking a step back from politics and expected to be the company’s chief executive in five years, according to Bloomberg. Tesla’s rally was bucking a slight rotation away from riskier tech stocks, as the Invesco S&P 500 High Beta ETF was down 0.4%."
    }
]