[
    {
        "headline": "Amazon, Tesla stocks lead 'Magnificent 7' surge after US-China temporary trade truce",
        "text": "Amazon and Tesla stocks led the \"Magnificent Seven\" Big Tech stock surge after the US and China announced a temporary trade war truce."
    },
    {
        "headline": "Secrets behind 'Magnificent 7' surge ahead of Nvidia earnings",
        "text": "You can catch Opening Bid on Apple Podcasts, Spotify, YouTube, or wherever you get your podcasts. The Magnificent 7 stocks are performing strongly again, even with chipmaker Nvidia's earnings report not due until May 28. This leadership group, which had largely underperformed in 2025 due to valuation concerns and macroeconomic risks, has seen a rally since the April 8 lows. This resurgence can be attributed to a couple of key factors. First, tech mega-caps like Microsoft (MSFT) and Alphabet (GOOGL (GOOGL)) significantly exceeded earnings estimates. Barclays' data indicates that these large-cap tech companies beat analyst earnings estimates by an average of 8% in the first quarter. Second, the earnings growth for these major tech players in the first quarter was once again impressive. Goldman Sachs' (GS) data reveals that large-cap tech stocks within the Mag 7 achieved an average earnings growth of 28% in the first quarter, compared to just 9% for the other 493 stocks in the S&P 500. For full episodes of Opening Bid, listen on your favorite podcast platform or watch on our website. Yahoo Finance's Opening Bid is produced by Langston Sessoms"
    },
    {
        "headline": "Trump's FTC antitrust cops just got a loud warning about blocking tech tie-ups",
        "text": "President Trump's antitrust cops just received a loud warning about attempts to block any future technology mergers as the FTC lost an attempt to undo Microsoft's $69 billion acquisition of gaming giant Activision Blizzard."
    },
    {
        "headline": "Top Midday Stories: Shares Rise on US-China 90-Day Trade Ceasefire; Trump Signs Order Targeting High Drug Prices",
        "text": "All three major US stock indexes were up over 2%, with the Nasdaq Composite up around 3.4% in late-m"
    },
    {
        "headline": "Trump Announces ‘Total Reset’ With New China Trade Deal",
        "text": "President Trump announced a 90-day trade deal with China, which will reduce tariffs to 10% from 125%."
    },
    {
        "headline": "Why Apple Isn’t Fully Liberated from Its Tariff Selloff Yet",
        "text": "Cooling of trade tensions between the U.S. and China is undeniably good news for Apple. Apple rose around 5% Monday morning, after the U.S. and China struck a deal to partly de-escalate the trade war brewing between the two superpowers. As of midday Monday, Apple’s stock is still down nearly 7% from its pre-Liberation Day price; the other five tech giants commanding market caps above $1 trillion have averaged a gain of 8% since that time."
    },
    {
        "headline": "Apple Stock Rises On Tariff Relief, But Services Challenges Remain Overhang",
        "text": "Apple stock rose after the U.S. and China agreed to a cooling-off period on tariffs. But services business challenges remain an overhang."
    },
    {
        "headline": "Mayo Sees JPMorgan Becoming $1 Trillion Bank Within Three Years",
        "text": "(Bloomberg) -- JPMorgan Chase & Co. could become the first bank to reach a $1 trillion market capitalization within the next three years, according to Wells Fargo.Most Read from BloombergA New Central Park Amenity, Tailored to Its East Harlem NeighborsAs Trump Reshapes Housing Policy, Renters Face Rollback of RightsWhat’s Behind the Rise in Serious Injuries on New York City’s Streets?NYC Warns of 17% Drop in Foreign Tourists Due to Trump PoliciesLA Mayor Credits Trump on Fire Aid, Stays Wary on"
    },
    {
        "headline": "Trump Talks With Apple’s Cook as Firm Said to Weigh Price Hikes",
        "text": "(Bloomberg) -- US President Donald Trump said he spoke with Apple Inc. Chief Executive Officer Tim Cook earlier on Monday, just as the iPhone maker was reported to be considering price increases later this year.Most Read from BloombergA New Central Park Amenity, Tailored to Its East Harlem NeighborsAs Trump Reshapes Housing Policy, Renters Face Rollback of RightsWhat’s Behind the Rise in Serious Injuries on New York City’s Streets?NYC Warns of 17% Drop in Foreign Tourists Due to Trump PoliciesLA"
    },
    {
        "headline": "Stock Market Today: Dow Jones Soars As Bessent Says This On China; Nvidia Surges, Alibaba Clears Entry (Live Coverage)",
        "text": "The Dow Jones surged on the stock market today. Treasury Secretary Bessent spoke out on China amid tariff progress. Alibaba cleared an entry."
    },
    {
        "headline": "Trump Says He May Speak to Xi This Week After Tariffs Truce",
        "text": "(Bloomberg) -- US President Donald Trump said he would likely speak to Chinese leader Xi Jinping later this week following talks between Washington and Beijing to temporarily lower tariffs and de-escalate the trade war between the world’s two largest economies.Most Read from BloombergA New Central Park Amenity, Tailored to Its East Harlem NeighborsAs Trump Reshapes Housing Policy, Renters Face Rollback of RightsWhat’s Behind the Rise in Serious Injuries on New York City’s Streets?NYC Warns of 17"
    },
    {
        "headline": "Apple Mulls iPhone Price Hikes But Wants to Avoid Blaming Tariffs, Report Says",
        "text": "Apple is reportedly considering raising prices on its next generation of iPhones expected to be released this fall—but without pinning higher costs on tariffs."
    },
    {
        "headline": "Your New iPhone May Get More Expensive. Apple Won’t Blame Tariffs: Report.",
        "text": "After retailer Amazon was blasted by the White House for potentially citing the tariffs as part of the price on goods purchased by U.S. consumers, Apple is determined to avoid a similar fate."
    },
    {
        "headline": "Apple might be loading up some iPhone price hikes",
        "text": "Tariffs or no tariffs, Apple (AAPL) wants to raise the prices of iPhones — and plans to do everything possible not to blame President Donald Trump for the hike."
    },
    {
        "headline": "Stocks to Watch Monday: Nvidia, AMD, Broadcom, Shopify",
        "text": "↗️ Amazon (AMZN); Apple (AAPL); Meta (META); Tesla (TSLA): The biggest U.S. tech stocks surged Monday morning after the White House and China agreed to hefty tariff cuts. Amazon sells many Chinese-made products on its platform; China is an important market for Tesla; and Apple does much of its assembly in the country."
    },
    {
        "headline": "Trump Says He Spoke to Tim Cook Following China Deal",
        "text": "President Trump said he spoke to Apple Chief Executive Tim Cook on Monday, following the announcement of the agreement with China to lower tariffs. Trump added that Cook plans to invest in more Apple plants in the U."
    },
    {
        "headline": "Trump signals he could speak with China's Xi by end of the week",
        "text": "President Donald Trump said on Monday that he could speak with China's President Xi Jinping at the end of the week amid progress between the two economic rivals on a trade deal. Trump said the negotiations between the two countries this past weekend has led to a \"reset\" between the two nations. (Reporting By Steve Holland, Jarrett Renshaw; Editing by Nick Zieminski)"
    },
    {
        "headline": "Market Chatter: Apple Weighs iPhone Price Increase While Avoiding Citing Tariffs as the Cause",
        "text": "Apple (AAPL) is evaluating higher price points for its next iPhone lineup, aiming to pair the adjust"
    },
    {
        "headline": "China's March shipments of foreign-branded cellphones drop almost 50%",
        "text": "Chinese shipments of foreign-branded cellphones, including Apple Inc's iPhones, dropped by 49.6% year on year in March, according to data released on Monday by a government-affiliated research company. Calculations based on the data from the China Academy of Information and Communications Technology (CAICT) showed that March shipments of foreign-branded phones in China decreased to 1.887 million units from 3.747 million a year earlier."
    },
    {
        "headline": "With Warren Buffett Stepping Down as CEO, Will Berkshire Hathaway Sell Apple Stock?",
        "text": "Greg Abel will replace the legendary CEO Warren Buffett at the end of the year. Apple stock has been the hallmark of Buffett's leadership. Apple is facing many challenges that could be a significant headwind to its growth."
    },
    {
        "headline": "Amazon, Tesla stocks lead 'Magnificent 7' surge after US-China temporary trade truce",
        "text": "Amazon and Tesla stocks led the \"Magnificent Seven\" Big Tech stock surge after the US and China announced a temporary trade war truce."
    },
    {
        "headline": "Secrets behind 'Magnificent 7' surge ahead of Nvidia earnings",
        "text": "You can catch Opening Bid on Apple Podcasts, Spotify, YouTube, or wherever you get your podcasts. The Magnificent 7 stocks are performing strongly again, even with chipmaker Nvidia's earnings report not due until May 28. This leadership group, which had largely underperformed in 2025 due to valuation concerns and macroeconomic risks, has seen a rally since the April 8 lows. This resurgence can be attributed to a couple of key factors. First, tech mega-caps like Microsoft (MSFT) and Alphabet (GOOGL (GOOGL)) significantly exceeded earnings estimates. Barclays' data indicates that these large-cap tech companies beat analyst earnings estimates by an average of 8% in the first quarter. Second, the earnings growth for these major tech players in the first quarter was once again impressive. Goldman Sachs' (GS) data reveals that large-cap tech stocks within the Mag 7 achieved an average earnings growth of 28% in the first quarter, compared to just 9% for the other 493 stocks in the S&P 500. For full episodes of Opening Bid, listen on your favorite podcast platform or watch on our website. Yahoo Finance's Opening Bid is produced by Langston Sessoms"
    },
    {
        "headline": "Trump's FTC antitrust cops just got a loud warning about blocking tech tie-ups",
        "text": "President Trump's antitrust cops just received a loud warning about attempts to block any future technology mergers as the FTC lost an attempt to undo Microsoft's $69 billion acquisition of gaming giant Activision Blizzard."
    },
    {
        "headline": "Top Midday Stories: Shares Rise on US-China 90-Day Trade Ceasefire; Trump Signs Order Targeting High Drug Prices",
        "text": "All three major US stock indexes were up over 2%, with the Nasdaq Composite up around 3.4% in late-m"
    },
    {
        "headline": "Trump Announces ‘Total Reset’ With New China Trade Deal",
        "text": "President Trump announced a 90-day trade deal with China, which will reduce tariffs to 10% from 125%."
    }
]