[
    {
        "headline": "AOS Q1 Earnings Call: Tariffs, CEO Transition, and Operational Adjustments Shape Outlook",
        "text": "Water heating and treatment solutions company A.O. Smith (NYSE:AOS) announced better-than-expected revenue in Q1 CY2025, but sales fell by 1.5% year on year to $963.9 million. The company’s full-year revenue guidance of $3.85 billion at the midpoint came in 0.5% above analysts’ estimates. Its non-GAAP profit of $0.95 per share was 3.8% above analysts’ consensus estimates."
    },
    {
        "headline": "A. O. Smith Corporation Just Beat Earnings Expectations: Here's What Analysts Think Will Happen Next",
        "text": "Investors in A. O. Smith Corporation ( NYSE:AOS ) had a good week, as its shares rose 3.2% to close at US$67.41..."
    },
    {
        "headline": "1 Safe-and-Steady Stock to Target This Week and 2 to Be Wary Of",
        "text": "Low-volatility stocks may offer stability, but that often comes at the cost of slower growth and the upside potential of more dynamic companies."
    },
    {
        "headline": "Zacks Earnings Trends Highlights: United Air Lines, A.O. Smith and 3M",
        "text": "United Air Lines, A.O. Smith and 3M have been highlighted in this Earnings Trends article."
    },
    {
        "headline": "Earnings Expectations Shift Lower: A Closer Look",
        "text": "Uncertainty about the overall macroeconomic picture continues to be a significant drag on the earnings outlook as a whole, prompting analysts to cut their estimates for the current and coming periods."
    },
    {
        "headline": "A. O. Smith First Quarter 2025 Earnings: Beats Expectations",
        "text": "A. O. Smith ( NYSE:AOS ) First Quarter 2025 Results Key Financial Results Revenue: US$963.9m (down 1.5% from 1Q 2024..."
    },
    {
        "headline": "A.O. Smith Corp (AOS) Q1 2025 Earnings Call Highlights: Navigating Challenges with Strategic ...",
        "text": "A.O. Smith Corp (AOS) reports a mixed quarter with strategic initiatives to counteract sales declines and tariff impacts."
    },
    {
        "headline": "Q1 2025 A O Smith Corp Earnings Call",
        "text": "Q1 2025 A O Smith Corp Earnings Call"
    },
    {
        "headline": "A. O. Smith Q1 Earnings Beat Estimates, Sales Decline Y/Y",
        "text": "AOS' Q1 sales decline 1.5% due to lower water heater volumes and decreased sales in China."
    },
    {
        "headline": "A.O. Smith (AOS) Reports Q1 Earnings: What Key Metrics Have to Say",
        "text": "Although the revenue and EPS for A.O. Smith (AOS) give a sense of how its business performed in the quarter ended March 2025, it might be worth considering how some key metrics compare with Wall Street estimates and the year-ago numbers."
    },
    {
        "headline": "A.O. Smith (AOS) Q1 Earnings and Revenues Beat Estimates",
        "text": "A.O. Smith (AOS) delivered earnings and revenue surprises of 5.56% and 1.75%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?"
    },
    {
        "headline": "A. O. Smith’s (NYSE:AOS) Q1: Beats On Revenue",
        "text": "Water heating and treatment solutions company A.O. Smith (NYSE:AOS) reported Q1 CY2025 results beating Wall Street’s revenue expectations, but sales fell by 1.5% year on year to $963.9 million. The company’s full-year revenue guidance of $3.85 billion at the midpoint came in 0.5% above analysts’ estimates. Its GAAP profit of $0.95 per share was 5.4% above analysts’ consensus estimates."
    },
    {
        "headline": "A.O. Smith: Q1 Earnings Snapshot",
        "text": "On a per-share basis, the Milwaukee-based company said it had profit of 95 cents. The results topped Wall Street expectations. The average estimate of six analysts surveyed by Zacks Investment Research was for earnings of 90 cents per share."
    },
    {
        "headline": "A. O. Smith Reports First Quarter Sales of $964 million and Earnings Per Share (EPS) of $0.95",
        "text": "Global water technology company A. O. Smith Corporation (\"the Company\") (NYSE: AOS) today announced its first quarter 2025 results."
    },
    {
        "headline": "Earnings To Watch: A. O. Smith (AOS) Reports Q1 Results Tomorrow",
        "text": "Water heating and treatment solutions company A.O. Smith (NYSE:AOS) will be reporting results tomorrow before market hours. Here’s what to look for."
    },
    {
        "headline": "A. O. Smith Corporation (NYSE:AOS) Looks Like A Good Stock, And It's Going Ex-Dividend Soon",
        "text": "Some investors rely on dividends for growing their wealth, and if you're one of those dividend sleuths, you might be..."
    },
    {
        "headline": "Eaton (ETN) Reports Next Week: Wall Street Expects Earnings Growth",
        "text": "Eaton (ETN) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."
    },
    {
        "headline": "A. O. Smith Announces Kevin Wheeler to Become Executive Chairman, Stephen Shafer Named President and Chief Executive Officer",
        "text": "The A. O. Smith Corporation (NYSE: AOS) Board of Directors today announced that Kevin Wheeler will transition from chairman and chief executive officer to executive chairman of the corporation, effective July 1, 2025. At that time, Stephen Shafer will be appointed to the Board of Directors and will assume the role of president and chief executive officer."
    },
    {
        "headline": "Earnings Preview: A.O. Smith (AOS) Q1 Earnings Expected to Decline",
        "text": "A.O. Smith (AOS) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."
    },
    {
        "headline": "An Intrinsic Calculation For A. O. Smith Corporation (NYSE:AOS) Suggests It's 33% Undervalued",
        "text": "Key Insights A. O. Smith's estimated fair value is US$93.72 based on 2 Stage Free Cash Flow to Equity A. O. Smith's..."
    },
    {
        "headline": "AOS Q1 Earnings Call: Tariffs, CEO Transition, and Operational Adjustments Shape Outlook",
        "text": "Water heating and treatment solutions company A.O. Smith (NYSE:AOS) announced better-than-expected revenue in Q1 CY2025, but sales fell by 1.5% year on year to $963.9 million. The company’s full-year revenue guidance of $3.85 billion at the midpoint came in 0.5% above analysts’ estimates. Its non-GAAP profit of $0.95 per share was 3.8% above analysts’ consensus estimates."
    },
    {
        "headline": "A. O. Smith Corporation Just Beat Earnings Expectations: Here's What Analysts Think Will Happen Next",
        "text": "Investors in A. O. Smith Corporation ( NYSE:AOS ) had a good week, as its shares rose 3.2% to close at US$67.41..."
    },
    {
        "headline": "1 Safe-and-Steady Stock to Target This Week and 2 to Be Wary Of",
        "text": "Low-volatility stocks may offer stability, but that often comes at the cost of slower growth and the upside potential of more dynamic companies."
    },
    {
        "headline": "Zacks Earnings Trends Highlights: United Air Lines, A.O. Smith and 3M",
        "text": "United Air Lines, A.O. Smith and 3M have been highlighted in this Earnings Trends article."
    },
    {
        "headline": "Earnings Expectations Shift Lower: A Closer Look",
        "text": "Uncertainty about the overall macroeconomic picture continues to be a significant drag on the earnings outlook as a whole, prompting analysts to cut their estimates for the current and coming periods."
    },
    {
        "headline": "A. O. Smith First Quarter 2025 Earnings: Beats Expectations",
        "text": "A. O. Smith ( NYSE:AOS ) First Quarter 2025 Results Key Financial Results Revenue: US$963.9m (down 1.5% from 1Q 2024..."
    },
    {
        "headline": "A.O. Smith Corp (AOS) Q1 2025 Earnings Call Highlights: Navigating Challenges with Strategic ...",
        "text": "A.O. Smith Corp (AOS) reports a mixed quarter with strategic initiatives to counteract sales declines and tariff impacts."
    },
    {
        "headline": "Q1 2025 A O Smith Corp Earnings Call",
        "text": "Q1 2025 A O Smith Corp Earnings Call"
    },
    {
        "headline": "A. O. Smith Q1 Earnings Beat Estimates, Sales Decline Y/Y",
        "text": "AOS' Q1 sales decline 1.5% due to lower water heater volumes and decreased sales in China."
    },
    {
        "headline": "A.O. Smith (AOS) Reports Q1 Earnings: What Key Metrics Have to Say",
        "text": "Although the revenue and EPS for A.O. Smith (AOS) give a sense of how its business performed in the quarter ended March 2025, it might be worth considering how some key metrics compare with Wall Street estimates and the year-ago numbers."
    },
    {
        "headline": "A.O. Smith (AOS) Q1 Earnings and Revenues Beat Estimates",
        "text": "A.O. Smith (AOS) delivered earnings and revenue surprises of 5.56% and 1.75%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?"
    },
    {
        "headline": "A. O. Smith’s (NYSE:AOS) Q1: Beats On Revenue",
        "text": "Water heating and treatment solutions company A.O. Smith (NYSE:AOS) reported Q1 CY2025 results beating Wall Street’s revenue expectations, but sales fell by 1.5% year on year to $963.9 million. The company’s full-year revenue guidance of $3.85 billion at the midpoint came in 0.5% above analysts’ estimates. Its GAAP profit of $0.95 per share was 5.4% above analysts’ consensus estimates."
    },
    {
        "headline": "A.O. Smith: Q1 Earnings Snapshot",
        "text": "On a per-share basis, the Milwaukee-based company said it had profit of 95 cents. The results topped Wall Street expectations. The average estimate of six analysts surveyed by Zacks Investment Research was for earnings of 90 cents per share."
    },
    {
        "headline": "A. O. Smith Reports First Quarter Sales of $964 million and Earnings Per Share (EPS) of $0.95",
        "text": "Global water technology company A. O. Smith Corporation (\"the Company\") (NYSE: AOS) today announced its first quarter 2025 results."
    },
    {
        "headline": "Earnings To Watch: A. O. Smith (AOS) Reports Q1 Results Tomorrow",
        "text": "Water heating and treatment solutions company A.O. Smith (NYSE:AOS) will be reporting results tomorrow before market hours. Here’s what to look for."
    },
    {
        "headline": "A. O. Smith Corporation (NYSE:AOS) Looks Like A Good Stock, And It's Going Ex-Dividend Soon",
        "text": "Some investors rely on dividends for growing their wealth, and if you're one of those dividend sleuths, you might be..."
    },
    {
        "headline": "Eaton (ETN) Reports Next Week: Wall Street Expects Earnings Growth",
        "text": "Eaton (ETN) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."
    },
    {
        "headline": "A. O. Smith Announces Kevin Wheeler to Become Executive Chairman, Stephen Shafer Named President and Chief Executive Officer",
        "text": "The A. O. Smith Corporation (NYSE: AOS) Board of Directors today announced that Kevin Wheeler will transition from chairman and chief executive officer to executive chairman of the corporation, effective July 1, 2025. At that time, Stephen Shafer will be appointed to the Board of Directors and will assume the role of president and chief executive officer."
    },
    {
        "headline": "Earnings Preview: A.O. Smith (AOS) Q1 Earnings Expected to Decline",
        "text": "A.O. Smith (AOS) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."
    },
    {
        "headline": "An Intrinsic Calculation For A. O. Smith Corporation (NYSE:AOS) Suggests It's 33% Undervalued",
        "text": "Key Insights A. O. Smith's estimated fair value is US$93.72 based on 2 Stage Free Cash Flow to Equity A. O. Smith's..."
    },
    {
        "headline": "Q4 Earnings Outperformers: A. O. Smith (NYSE:AOS) And The Rest Of The HVAC and Water Systems Stocks",
        "text": "Earnings results often indicate what direction a company will take in the months ahead. With Q4 behind us, let’s have a look at A. O. Smith (NYSE:AOS) and its peers."
    },
    {
        "headline": "A. O. Smith Reports Quarterly Dividend",
        "text": "Directors of A. O. Smith Corporation (NYSE: AOS) today declared a regular quarterly cash dividend of $.34 per share on the company's Common Stock and Class A Common Stock."
    },
    {
        "headline": "A. O. Smith to Hold First Quarter Conference Call on April 29, 2025",
        "text": "A. O. Smith Corporation (NYSE: AOS) will release its first quarter 2025 financial results before the market opens on Tuesday, April 29, and has scheduled an investor conference call to follow at 10:00 a.m. (Eastern Daylight Time)."
    },
    {
        "headline": "Is A. O. Smith Corporation (AOS) The Best Industrial Dividend Stock to Invest in Now?",
        "text": "We recently published a list of 12 Best Industrial Dividend Stocks to Invest in Now. In this article, we are going to take a look at where A. O. Smith Corporation (NYSE:AOS) stands against other best industrial dividend stocks to invest in now. Industrial stocks play a crucial role in economic growth, encompassing a wide […]"
    },
    {
        "headline": "3 Reasons to Avoid AOS and 1 Stock to Buy Instead",
        "text": "Over the past six months, A. O. Smith’s stock price fell to $66.30. Shareholders have lost 19.6% of their capital, disappointing when considering the S&P 500 was flat. This was partly due to its softer quarterly results and may have investors wondering how to approach the situation."
    },
    {
        "headline": "1 Industrials Stock with Exciting Potential and 2 to Ignore",
        "text": "Industrials businesses quietly power the physical things we depend on, from cars and homes to e-commerce infrastructure. But they are at the whim of volatile macroeconomic factors that influence capital spending (like interest rates), and the market seems convinced that demand will slow. Due to this bearish outlook, the industry has tumbled by 2.2% over the past six months. This drop was discouraging since the S&P 500 held steady."
    },
    {
        "headline": "Ethisphere Names A. O. Smith Corporation One of the 2025 World's Most Ethical Companies® for the Second Time",
        "text": "A. O. Smith Corporation (NYSE: AOS), a leader in water heating and water treatment, announces today it has been recognized as a 2025 World's Most Ethical Company by Ethisphere, a global leader in defining and advancing the standards of ethical business practices."
    },
    {
        "headline": "A. O. Smith Corporation (AOS): Among Magnificent Dividend Growth Stocks to Invest In",
        "text": "We recently published a list of 10 Magnificent Dividend Growth Stocks to Invest In. In this article, we are going to take a look at where A. O. Smith Corporation (NYSE:AOS) stands against other magnificent dividend growth stocks to invest in. Dividend stocks remain a popular choice among investors due to their ability to generate […]"
    },
    {
        "headline": "Why Is Emerson Electric (EMR) Down 8.7% Since Last Earnings Report?",
        "text": "Emerson Electric (EMR) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues."
    },
    {
        "headline": "Is It Time To Consider Buying A. O. Smith Corporation (NYSE:AOS)?",
        "text": "A. O. Smith Corporation ( NYSE:AOS ), might not be a large cap stock, but it saw significant share price movement..."
    },
    {
        "headline": "Is A. O. Smith Corporation (AOS) the Best Water Stock to Buy According to Hedge Funds?",
        "text": "We recently published a list of 10 Best Water Stocks to Buy According to Hedge Funds. In this article, we are going to take a look at where A. O. Smith Corporation (NYSE:AOS) stands against other best water stocks to buy according to hedge funds. The water business in the USA is a diverse sector […]"
    },
    {
        "headline": "A. O. Smith Full Year 2024 Earnings: Misses Expectations",
        "text": "A. O. Smith ( NYSE:AOS ) Full Year 2024 Results Key Financial Results Revenue: US$3.82b (flat on FY 2023). Net income..."
    },
    {
        "headline": "A. O. Smith Corporation (NYSE:AOS) Just Reported Earnings, And Analysts Cut Their Target Price",
        "text": "A. O. Smith Corporation ( NYSE:AOS ) shareholders are probably feeling a little disappointed, since its shares fell..."
    },
    {
        "headline": "A.O. Smith Corp (AOS) Q4 2024 Earnings Call Highlights: Navigating Economic Challenges and ...",
        "text": "A.O. Smith Corp (AOS) reports a slight decline in revenue and earnings, while focusing on strategic growth and sustainability initiatives."
    },
    {
        "headline": "A. O. Smith Q4 Earnings Miss Estimates, Sales Decline Y/Y",
        "text": "AOS' Q4 sales decline 8% due to lower water heater volumes and decreased sales in China."
    }
]