[
    {
        "headline": "Nvidia poised to rejoin $3 trillion club after US-China trade war deescalation",
        "text": "Nvidia was set to rejoin the $3 trillion club Tuesday for the first time since February after the Trump administration temporarily slashed tariffs on China."
    },
    {
        "headline": "Microsoft Build 2025: What to expect, from Azure to Copilot upgrades",
        "text": "Microsoft is hosting its annual Build developer conference next week from May 19 to 22. The event is guaranteed to include announcements regarding new AI integrations, services, and apps, including for Windows. At last year's Build, Microsoft announced an integration of Copilot into Microsoft Teams, Copilot+ AI-powered PCs, Windows Volumetric Apps for Meta Quest headsets, and more. The keynotes will be streamed online for free. As for what to expect, there is good reason to believe Microsoft wil"
    },
    {
        "headline": "Bill Gates Announces Plan To Close The Gates Foundation, Says He'll Give Away 'Virtually All' Of His Wealth Over The Next 20 Years",
        "text": "Bill Gates announced plans to close the Gates Foundation in 2045 The Microsoft founder says he intends to give away 99% of his $168 billion fortune through the organization over the next 20 years The announcement comes weeks after Microsoft celebrated its 50th anniversary Bill Gates on Thursday announced plans to close the Gates Foundation in 20 years. In a lengthy post on his website, the Microsoft (NASDAQ:MSFT) co-founder wrote, \"I will give away virtually all my wealth through the Gates Found"
    },
    {
        "headline": "OpenAI and Microsoft renegotiate partnership for IPO and funding",
        "text": "A central issue in the negotiations is determining how much equity Microsoft will receive in the restructured OpenAI in exchange for its $13bn investment."
    },
    {
        "headline": "Bull Of The Day: Microsoft (MSFT)",
        "text": "This software giant is set to leverage AI tools of its own as well as those of third parties to a product that has rave reviews."
    },
    {
        "headline": "Tap Mag-7 ETFs on Temporary US-China Trade Truce",
        "text": "The latest U.S.-China temporary trade truce came as a surprising relief to the Magnificent Seven space."
    },
    {
        "headline": "Zacks Investment Ideas feature highlights: Alibaba, JD.com, SPDR S&P Biotech ETF, Merck and Microsoft",
        "text": "Alibaba, JD.com, SPDR S&P Biotech ETF, Merck and Microsoft have been highlighted in this Investment Ideas article."
    },
    {
        "headline": "Microsoft facing multibillion-pound legal claim over software licence pricing",
        "text": "The class action claim accuses the tech giant of overcharging for licences for Microsoft software products."
    },
    {
        "headline": "Advanced Micro Devices Stock (AMD) Stuck in Neutral as AI Boom Accelerates",
        "text": "Advanced Micro Devices (AMD) has been a disappointing stock over the past year, with declines accelerating in the last five months. Since May 2024, AMD has been down almost 32%. Amid growing concerns about demand for AI infrastructure chips, AMD has also struggled with a lack of competitiveness in absorbing that demand. Even after posting a beat across the board in its Q1 earnings last week and supplementing that with raised Q2 guidance, there are still no strong signs of a reversal in the beari"
    },
    {
        "headline": "Update: Market Chatter: Microsoft, OpenAI Negotiating to Unlock New Financing, Future IPO for ChatGPT Parent",
        "text": "(Updates with Microsoft's comment in the fifth paragraph.) Microsoft (MSFT) and OpenAI are rewrit"
    },
    {
        "headline": "Microsoft (MSFT) Is Cool Letting Go of OpenAI Shares--As Long as It Gets the Goods",
        "text": "The tech giant's not sweating ownership--just wants dibs on the next-gen AI"
    },
    {
        "headline": "Popular YouTuber Coffeezilla Is Puzzled By Bill Gates' Philanthropy Plans—'I've Been Hearing This For 15 Years And Every Year Bill Has More'",
        "text": "Bill Gates, the co-founder of Microsoft (NASDAQ:MSFT) and a tech industry titan, recently announced plans to give away 99% of his wealth by 2045, but not everyone is convinced. The billionaire, who became the world's youngest self-made billionaire at age 31 in 1987 and the first centibillionaire in 1999, currently holds a net worth of $113 billion, making him the 13th-richest person in the world, according to Forbes. Don't Miss: ‘Scrolling To UBI' — Deloitte's #1 fastest-growing software company"
    },
    {
        "headline": "Microsoft Is Renegotiating OpenAI Partnership for Future IPO. What It Means for the Stock.",
        "text": "Microsoft stock rose on Monday after a report that the company was revising the terms of its partnership with OpenAI to allow the ChatGPT maker to launch an initial public offering. The companies also are rewriting the terms of a wider contract that was drafted when Microsoft and OpenAI first unveiled an exclusive partnership in 2019, the Financial Times reported, citing people familiar with the matter. OpenAI didn’t immediately respond to a request for comment from Barron’s; Microsoft, through a spokesperson, declined to comment."
    },
    {
        "headline": "Bill Gates says businesses need to understand the politics for the next 20 years, not just the next two days",
        "text": "Microsoft co-founder Bill Gates said AI is already reshaping the job sector and Trump's tariff uncertainty is adding further fuel to the fire."
    },
    {
        "headline": "The Zacks Analyst Blog Highlights Five9, Affirm, Microsoft, Juniper Networks and Tyler",
        "text": "Five9, Affirm, Microsoft, Juniper Networks and Tyler are included in this Analyst Blog."
    },
    {
        "headline": "Mag 7 rally, airline & pharmaceutical stocks: Trending Tickers",
        "text": "The \"Magnificent Seven,\" made up of Nvidia (NVDA), Alphabet (GOOG, GOOGL), Tesla (TSLA), Microsoft (MSFT), Amazon (AMZN), Meta (META), and Apple (AAPL), are rallying after the US and China agreed to lower tariff rates for a 90-day period. Airline stocks, like American Airlines (AAL), Delta (DAL), and United Airlines (UAL), are also gaining on the trade deal. Pharmacy stocks, including Eli Lilly (LLY), Johnson & Johnson (JNJ), and Merck (MRK), are moving to the downside after US President Trump said he will cut drug prices by over 50%. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here."
    },
    {
        "headline": "US-China tariff agreement may add fuel to 'Magnificent 7' stock rally",
        "text": "The \"Magnificent Seven\" trade looks to be on again, for now."
    },
    {
        "headline": "GOOGL, META, MSFT: 3 Promising AI Giants With Attractive Valuations",
        "text": "Three promising generative AI behemoths in focus are: GOOGL, META, MSFT."
    },
    {
        "headline": "Zacks Investment Ideas feature highlights: Microsoft, Nvidia and Palantir",
        "text": "Microsoft, Nvidia and Palantir have been highlighted in this Investment Ideas article."
    },
    {
        "headline": "Secrets behind 'Magnificent 7' surge ahead of Nvidia earnings",
        "text": "You can catch Opening Bid on Apple Podcasts, Spotify, YouTube, or wherever you get your podcasts. The Magnificent 7 stocks are performing strongly again, even with chipmaker Nvidia's earnings report not due until May 28. This leadership group, which had largely underperformed in 2025 due to valuation concerns and macroeconomic risks, has seen a rally since the April 8 lows. This resurgence can be attributed to a couple of key factors. First, tech mega-caps like Microsoft (MSFT) and Alphabet (GOOGL (GOOGL)) significantly exceeded earnings estimates. Barclays' data indicates that these large-cap tech companies beat analyst earnings estimates by an average of 8% in the first quarter. Second, the earnings growth for these major tech players in the first quarter was once again impressive. Goldman Sachs' (GS) data reveals that large-cap tech stocks within the Mag 7 achieved an average earnings growth of 28% in the first quarter, compared to just 9% for the other 493 stocks in the S&P 500. For full episodes of Opening Bid, listen on your favorite podcast platform or watch on our website. Yahoo Finance's Opening Bid is produced by Langston Sessoms"
    },
    {
        "headline": "Nvidia poised to rejoin $3 trillion club after US-China trade war deescalation",
        "text": "Nvidia was set to rejoin the $3 trillion club Tuesday for the first time since February after the Trump administration temporarily slashed tariffs on China."
    },
    {
        "headline": "Microsoft Build 2025: What to expect, from Azure to Copilot upgrades",
        "text": "Microsoft is hosting its annual Build developer conference next week from May 19 to 22. The event is guaranteed to include announcements regarding new AI integrations, services, and apps, including for Windows. At last year's Build, Microsoft announced an integration of Copilot into Microsoft Teams, Copilot+ AI-powered PCs, Windows Volumetric Apps for Meta Quest headsets, and more. The keynotes will be streamed online for free. As for what to expect, there is good reason to believe Microsoft wil"
    },
    {
        "headline": "Bill Gates Announces Plan To Close The Gates Foundation, Says He'll Give Away 'Virtually All' Of His Wealth Over The Next 20 Years",
        "text": "Bill Gates announced plans to close the Gates Foundation in 2045 The Microsoft founder says he intends to give away 99% of his $168 billion fortune through the organization over the next 20 years The announcement comes weeks after Microsoft celebrated its 50th anniversary Bill Gates on Thursday announced plans to close the Gates Foundation in 20 years. In a lengthy post on his website, the Microsoft (NASDAQ:MSFT) co-founder wrote, \"I will give away virtually all my wealth through the Gates Found"
    },
    {
        "headline": "OpenAI and Microsoft renegotiate partnership for IPO and funding",
        "text": "A central issue in the negotiations is determining how much equity Microsoft will receive in the restructured OpenAI in exchange for its $13bn investment."
    },
    {
        "headline": "Bull Of The Day: Microsoft (MSFT)",
        "text": "This software giant is set to leverage AI tools of its own as well as those of third parties to a product that has rave reviews."
    },
    {
        "headline": "Tap Mag-7 ETFs on Temporary US-China Trade Truce",
        "text": "The latest U.S.-China temporary trade truce came as a surprising relief to the Magnificent Seven space."
    },
    {
        "headline": "Zacks Investment Ideas feature highlights: Alibaba, JD.com, SPDR S&P Biotech ETF, Merck and Microsoft",
        "text": "Alibaba, JD.com, SPDR S&P Biotech ETF, Merck and Microsoft have been highlighted in this Investment Ideas article."
    },
    {
        "headline": "Microsoft facing multibillion-pound legal claim over software licence pricing",
        "text": "The class action claim accuses the tech giant of overcharging for licences for Microsoft software products."
    },
    {
        "headline": "Advanced Micro Devices Stock (AMD) Stuck in Neutral as AI Boom Accelerates",
        "text": "Advanced Micro Devices (AMD) has been a disappointing stock over the past year, with declines accelerating in the last five months. Since May 2024, AMD has been down almost 32%. Amid growing concerns about demand for AI infrastructure chips, AMD has also struggled with a lack of competitiveness in absorbing that demand. Even after posting a beat across the board in its Q1 earnings last week and supplementing that with raised Q2 guidance, there are still no strong signs of a reversal in the beari"
    },
    {
        "headline": "Update: Market Chatter: Microsoft, OpenAI Negotiating to Unlock New Financing, Future IPO for ChatGPT Parent",
        "text": "(Updates with Microsoft's comment in the fifth paragraph.) Microsoft (MSFT) and OpenAI are rewrit"
    },
    {
        "headline": "Microsoft (MSFT) Is Cool Letting Go of OpenAI Shares--As Long as It Gets the Goods",
        "text": "The tech giant's not sweating ownership--just wants dibs on the next-gen AI"
    },
    {
        "headline": "Popular YouTuber Coffeezilla Is Puzzled By Bill Gates' Philanthropy Plans—'I've Been Hearing This For 15 Years And Every Year Bill Has More'",
        "text": "Bill Gates, the co-founder of Microsoft (NASDAQ:MSFT) and a tech industry titan, recently announced plans to give away 99% of his wealth by 2045, but not everyone is convinced. The billionaire, who became the world's youngest self-made billionaire at age 31 in 1987 and the first centibillionaire in 1999, currently holds a net worth of $113 billion, making him the 13th-richest person in the world, according to Forbes. Don't Miss: ‘Scrolling To UBI' — Deloitte's #1 fastest-growing software company"
    },
    {
        "headline": "Microsoft Is Renegotiating OpenAI Partnership for Future IPO. What It Means for the Stock.",
        "text": "Microsoft stock rose on Monday after a report that the company was revising the terms of its partnership with OpenAI to allow the ChatGPT maker to launch an initial public offering. The companies also are rewriting the terms of a wider contract that was drafted when Microsoft and OpenAI first unveiled an exclusive partnership in 2019, the Financial Times reported, citing people familiar with the matter. OpenAI didn’t immediately respond to a request for comment from Barron’s; Microsoft, through a spokesperson, declined to comment."
    },
    {
        "headline": "Bill Gates says businesses need to understand the politics for the next 20 years, not just the next two days",
        "text": "Microsoft co-founder Bill Gates said AI is already reshaping the job sector and Trump's tariff uncertainty is adding further fuel to the fire."
    },
    {
        "headline": "The Zacks Analyst Blog Highlights Five9, Affirm, Microsoft, Juniper Networks and Tyler",
        "text": "Five9, Affirm, Microsoft, Juniper Networks and Tyler are included in this Analyst Blog."
    }
]