[
    {
        "headline": "Newmont Reduces its Holdings in Discovery Silver to 8.6%",
        "text": "Prior to the sale, NEM held 119,716,667 common shares of Discovery Silver, representing roughly 14.95% of the company's outstanding shares."
    },
    {
        "headline": "Here's Why Newmont Corporation (NEM) is a Strong Value Stock",
        "text": "Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service."
    },
    {
        "headline": "Oil Leads Commodity Rally After US-China Truce as Gold Retreats",
        "text": "(Bloomberg) -- Oil and most other commodities powered higher, while gold fell, after China and the US ratcheted down trade tensions that had threatened to slash demand for raw materials. Most Read from BloombergA New Central Park Amenity, Tailored to Its East Harlem NeighborsAs Trump Reshapes Housing Policy, Renters Face Rollback of RightsWhat’s Behind the Rise in Serious Injuries on New York City’s Streets?NYC Warns of 17% Drop in Foreign Tourists Due to Trump PoliciesLA Mayor Credits Trump on"
    },
    {
        "headline": "IDR Slips 10% Post Q1 Results: Investment Opportunity or Red Flag?",
        "text": "Idaho Strategic falls 10% despite record Q1 revenues. We analyze its growth prospects to assess if now is a good time to scoop up the stock or exercise restraint."
    },
    {
        "headline": "Barrick Gold Changed Its Name and Ticker. CEO Sees Gains From Copper.",
        "text": "The company, one of the world’s largest gold miners, now calls itself Barrick Mining to reflect its diversification into the copper business."
    },
    {
        "headline": "Top Stock Movers Now: Apple, NRG Energy, Newmont, and More",
        "text": "U.S. equities soared at midday following this weekend's agreement between the U.S. and China to lower tariffs for 90 days."
    },
    {
        "headline": "Gold Prices Tumble. What the Latest Tariff News Means for Newmont and Other Stocks.",
        "text": "Shares of Newmont the Colorado-based gold miner, fell Monday and gold futures slumped after the U.S. and China agreed to slash tariffs on each other’s goods for 90 days and continue trade talks. Continuous gold futures fell 3.1% to $3,240 per Troy ounce, with investors pivoting to risk-on assets in response to the deal between Washington and Beijing. The move lower put gold on course for its lowest closing price since April 10."
    },
    {
        "headline": "Chrysos signs first PhotonAssay unit contract with Newmont",
        "text": "An initial PhotonAssay unit is due to be installed at Newmont's Ahafo mine along the Sefwi Volcanic Belt in Ghana."
    },
    {
        "headline": "Newmont Corporation (NEM): Among the Best Gold Stocks to Invest In According to Billionaires",
        "text": "We recently compiled a list of the 12 Best Gold Stocks to Invest In According to Billionaires. In this article, we are going to take a look at where Newmont Corporation (NYSE:NEM) stands against the other gold stocks. Within the global metals industry, the gold sector is essential because it offers long-term investors a profitable opportunity […]"
    },
    {
        "headline": "Newmont (NYSE:NEM) shareholders have earned a 30% return over the last year",
        "text": "These days it's easy to simply buy an index fund, and your returns should (roughly) match the market. But if you pick..."
    },
    {
        "headline": "Newmont Announces a Decrease in its Holdings of Discovery Silver Corp.",
        "text": "Newmont Corporation (NYSE: NEM) (TSX: NGT) (ASX: NEM) (PNGX: NEM) (\"Newmont\" or the \"Company\") announced today a decrease in its holdings of common shares (\"Common Shares\") in the capital of Discovery Silver Corp. (\"Discovery\")."
    },
    {
        "headline": "Newmont Corporation (NEM) is Attracting Investor Attention: Here is What You Should Know",
        "text": "Zacks.com users have recently been watching Newmont (NEM) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects."
    },
    {
        "headline": "With 76% ownership of the shares, Newmont Corporation (NYSE:NEM) is heavily dominated by institutional owners",
        "text": "Key Insights Significantly high institutional ownership implies Newmont's stock price is sensitive to their trading..."
    },
    {
        "headline": "Company News for May 7, 2025",
        "text": "Companies in The News Are: LLY, NEM, TSLA, ABNB"
    },
    {
        "headline": "NEM vs. AEM: Which Gold Mining Stock Should You Invest in Now?",
        "text": "With bullion prices rallying amid trade and economic uncertainties, which gold giant - NEM or AEM - is a better pick now?"
    },
    {
        "headline": "Brokers Suggest Investing in Newmont (NEM): Read This Before Placing a Bet",
        "text": "The average brokerage recommendation (ABR) for Newmont (NEM) is equivalent to a Buy. The overly optimistic recommendations of Wall Street analysts make the effectiveness of this highly sought-after metric questionable. So, is it worth buying the stock?"
    },
    {
        "headline": "Is Newmont Corporation (NEM) Among the Best Performing Large Cap Stocks So Far in 2025?",
        "text": "We recently published a list of 11 Best Performing Large Cap Stocks So Far in 2025. In this article, we are going to take a look at where Newmont Corporation (NYSE:NEM) stands against other best performing large cap stocks so far in 2025. The stock market had a chaotic start to the first quarter of […]"
    },
    {
        "headline": "Gold prices rise: Portfolio mgr. outlines 3 gold mining stocks",
        "text": "Gold (GC=F) prices are rising as a weaker US dollar (DX=F,&nbsp;DX-Y.NYB) and looming trade tariff talks push investors toward safe-haven assets. Chris Mancini, associate portfolio manager of the Gabelli Gold Fund at Gabelli Funds, joins Wealth to explain why gold is gaining more appeal. To watch more expert insights and analysis on the latest market action, check out more Wealth&nbsp;here."
    },
    {
        "headline": "Top Stock Movers Now: Berkshire Hathaway, Netflix, Newmont, and More",
        "text": "Major U.S. equities indexes were mostly lower at midday amid concerns about tariffs and anticipation of this week's Fed decision on interest rates."
    },
    {
        "headline": "NEM vs. TFPM: Which Stock Is the Better Value Option?",
        "text": "NEM vs. TFPM: Which Stock Is the Better Value Option?"
    },
    {
        "headline": "Newmont Reduces its Holdings in Discovery Silver to 8.6%",
        "text": "Prior to the sale, NEM held 119,716,667 common shares of Discovery Silver, representing roughly 14.95% of the company's outstanding shares."
    },
    {
        "headline": "Here's Why Newmont Corporation (NEM) is a Strong Value Stock",
        "text": "Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service."
    },
    {
        "headline": "Oil Leads Commodity Rally After US-China Truce as Gold Retreats",
        "text": "(Bloomberg) -- Oil and most other commodities powered higher, while gold fell, after China and the US ratcheted down trade tensions that had threatened to slash demand for raw materials. Most Read from BloombergA New Central Park Amenity, Tailored to Its East Harlem NeighborsAs Trump Reshapes Housing Policy, Renters Face Rollback of RightsWhat’s Behind the Rise in Serious Injuries on New York City’s Streets?NYC Warns of 17% Drop in Foreign Tourists Due to Trump PoliciesLA Mayor Credits Trump on"
    },
    {
        "headline": "IDR Slips 10% Post Q1 Results: Investment Opportunity or Red Flag?",
        "text": "Idaho Strategic falls 10% despite record Q1 revenues. We analyze its growth prospects to assess if now is a good time to scoop up the stock or exercise restraint."
    },
    {
        "headline": "Barrick Gold Changed Its Name and Ticker. CEO Sees Gains From Copper.",
        "text": "The company, one of the world’s largest gold miners, now calls itself Barrick Mining to reflect its diversification into the copper business."
    },
    {
        "headline": "Top Stock Movers Now: Apple, NRG Energy, Newmont, and More",
        "text": "U.S. equities soared at midday following this weekend's agreement between the U.S. and China to lower tariffs for 90 days."
    },
    {
        "headline": "Gold Prices Tumble. What the Latest Tariff News Means for Newmont and Other Stocks.",
        "text": "Shares of Newmont the Colorado-based gold miner, fell Monday and gold futures slumped after the U.S. and China agreed to slash tariffs on each other’s goods for 90 days and continue trade talks. Continuous gold futures fell 3.1% to $3,240 per Troy ounce, with investors pivoting to risk-on assets in response to the deal between Washington and Beijing. The move lower put gold on course for its lowest closing price since April 10."
    },
    {
        "headline": "Chrysos signs first PhotonAssay unit contract with Newmont",
        "text": "An initial PhotonAssay unit is due to be installed at Newmont's Ahafo mine along the Sefwi Volcanic Belt in Ghana."
    },
    {
        "headline": "Newmont Corporation (NEM): Among the Best Gold Stocks to Invest In According to Billionaires",
        "text": "We recently compiled a list of the 12 Best Gold Stocks to Invest In According to Billionaires. In this article, we are going to take a look at where Newmont Corporation (NYSE:NEM) stands against the other gold stocks. Within the global metals industry, the gold sector is essential because it offers long-term investors a profitable opportunity […]"
    },
    {
        "headline": "Newmont (NYSE:NEM) shareholders have earned a 30% return over the last year",
        "text": "These days it's easy to simply buy an index fund, and your returns should (roughly) match the market. But if you pick..."
    },
    {
        "headline": "Newmont Announces a Decrease in its Holdings of Discovery Silver Corp.",
        "text": "Newmont Corporation (NYSE: NEM) (TSX: NGT) (ASX: NEM) (PNGX: NEM) (\"Newmont\" or the \"Company\") announced today a decrease in its holdings of common shares (\"Common Shares\") in the capital of Discovery Silver Corp. (\"Discovery\")."
    },
    {
        "headline": "Newmont Corporation (NEM) is Attracting Investor Attention: Here is What You Should Know",
        "text": "Zacks.com users have recently been watching Newmont (NEM) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects."
    },
    {
        "headline": "With 76% ownership of the shares, Newmont Corporation (NYSE:NEM) is heavily dominated by institutional owners",
        "text": "Key Insights Significantly high institutional ownership implies Newmont's stock price is sensitive to their trading..."
    },
    {
        "headline": "Company News for May 7, 2025",
        "text": "Companies in The News Are: LLY, NEM, TSLA, ABNB"
    },
    {
        "headline": "NEM vs. AEM: Which Gold Mining Stock Should You Invest in Now?",
        "text": "With bullion prices rallying amid trade and economic uncertainties, which gold giant - NEM or AEM - is a better pick now?"
    },
    {
        "headline": "Brokers Suggest Investing in Newmont (NEM): Read This Before Placing a Bet",
        "text": "The average brokerage recommendation (ABR) for Newmont (NEM) is equivalent to a Buy. The overly optimistic recommendations of Wall Street analysts make the effectiveness of this highly sought-after metric questionable. So, is it worth buying the stock?"
    },
    {
        "headline": "Is Newmont Corporation (NEM) Among the Best Performing Large Cap Stocks So Far in 2025?",
        "text": "We recently published a list of 11 Best Performing Large Cap Stocks So Far in 2025. In this article, we are going to take a look at where Newmont Corporation (NYSE:NEM) stands against other best performing large cap stocks so far in 2025. The stock market had a chaotic start to the first quarter of […]"
    },
    {
        "headline": "Gold prices rise: Portfolio mgr. outlines 3 gold mining stocks",
        "text": "Gold (GC=F) prices are rising as a weaker US dollar (DX=F,&nbsp;DX-Y.NYB) and looming trade tariff talks push investors toward safe-haven assets. Chris Mancini, associate portfolio manager of the Gabelli Gold Fund at Gabelli Funds, joins Wealth to explain why gold is gaining more appeal. To watch more expert insights and analysis on the latest market action, check out more Wealth&nbsp;here."
    },
    {
        "headline": "Top Stock Movers Now: Berkshire Hathaway, Netflix, Newmont, and More",
        "text": "Major U.S. equities indexes were mostly lower at midday amid concerns about tariffs and anticipation of this week's Fed decision on interest rates."
    },
    {
        "headline": "NEM vs. TFPM: Which Stock Is the Better Value Option?",
        "text": "NEM vs. TFPM: Which Stock Is the Better Value Option?"
    },
    {
        "headline": "S&P 500 Achieves a Milestone After Two Decades - 5 Top Picks",
        "text": "Five S&P 500 stocks flying high year to date are: NFLX, PM, NEM, CNP, EXC."
    },
    {
        "headline": "Buy These Top-Ranked 5 Stocks to Play an Earnings Beat",
        "text": "Top-ranked stocks Fox (FOXA), Newmont (NEM), Affirm (AFRM), HealthStream (HSTM)) and Iridium Communications (IRDM) are likely to beat on the bottom line in their upcoming releases."
    },
    {
        "headline": "Barrick Gold Trading Cheaper Than Industry: Time to Buy the Stock?",
        "text": "While GOLD's actions to advance key projects and solid financial health augur well, its high costs and downbeat production outlook warrant caution."
    },
    {
        "headline": "Newmont Promotes Natascha Viljoen to President and Chief Operating Officer",
        "text": "DENVER, May 02, 2025--Newmont Promotes Natascha Viljoen to President and Chief Operating Officer"
    },
    {
        "headline": "Zacks.com featured highlights Fox, Universal Technical Institute, Pfizer, Tenet Healthcare and Newmont",
        "text": "Fox, Universal Technical Institute, Pfizer, Tenet Healthcare and Newmont have been highlighted in this Screen of The Week article."
    },
    {
        "headline": "3 No-Brainer Gold Stocks to Buy Right Now",
        "text": "Gold is trading near all-time highs, resulting in it receiving much attention from investors. Newmont and AngloGold Ashanti are leading gold mining companies. The VanEck Gold Miners ETF is a great option for cautious investors who are uninterested in assuming the risks of a single gold mining company."
    },
    {
        "headline": "3 Stocks in the S&P 500 Index Have Done the Unthinkable and Rocketed at Least 45% This Year Despite Trump's Tariffs",
        "text": "Broadly speaking, it's been a tough and volatile year for the stock market. President Donald Trump's first 100 days proved tumultuous for the stock market. Trump instituted tariffs in his bid to bring more manufacturing jobs back to the U.S. and shake up global trade."
    },
    {
        "headline": "Looking for Earnings Beat? Buy These 5 Top-Ranked Stocks",
        "text": "Top-ranked stocks Fox (FOXA), Universal Technical Institute (UTI), Pfizer (PFE), Tenet Healthcare (THC) and Newmont (NEM) are likely to beat on the bottom line in their upcoming releases."
    },
    {
        "headline": "Jim Cramer On Newmont (NEM) – Gold’s Outperformance Is Real",
        "text": "We recently published a list of Jim Cramer Commented on These 8 Stocks Recently. In this article, we are going to take a look at where Newmont Corporation (NYSE: NEM) stands against other stocks that Jim Cramer discussed recently. On Friday, Jim Cramer, host of Mad Money, revisited the recent turbulence in artificial intelligence stocks, […]"
    },
    {
        "headline": "Newmont First Quarter 2025 Earnings: EPS: US$1.68 (vs US$0.14 in 1Q 2024)",
        "text": "Newmont ( NYSE:NEM ) First Quarter 2025 Results Key Financial Results Revenue: US$5.01b (up 25% from 1Q 2024). Net..."
    },
    {
        "headline": "Need To Know: Analysts Are Much More Bullish On Newmont Corporation (NYSE:NEM)",
        "text": "Shareholders in Newmont Corporation ( NYSE:NEM ) may be thrilled to learn that the analysts have just delivered a major..."
    },
    {
        "headline": "Are You a Growth Investor? This 1 Stock Could Be the Perfect Pick",
        "text": "The Zacks Style Scores offers investors a way to easily find top-rated stocks based on their investing style. Here's why you should take advantage."
    },
    {
        "headline": "Buy 5 Stocks That Have Survived April's Tariff-Led Market Mayhem",
        "text": "Buy these five corporate bigwigs that have provided positive returns in volatile April. These are: NFLX, NEM, PM, AEM, SPOT."
    },
    {
        "headline": "Here's Why Newmont Corporation (NEM) is a Strong Momentum Stock",
        "text": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores."
    },
    {
        "headline": "Newmont Corporation (NEM) Is a Trending Stock: Facts to Know Before Betting on It",
        "text": "Recently, Zacks.com users have been paying close attention to Newmont (NEM). This makes it worthwhile to examine what the stock has in store."
    }
]