[
    {
        "headline": "UnitedHealth suspends guidance as CEO steps down. Stock takes hit.",
        "text": "UnitedHealth Group (UNH) is suspending its full-year guidance as the health insurer announced that CEO Andrew Witty will be stepping down on Tuesday. Former CEO Stephen Hemsley will be rejoining the company to lead as chief executive. The company's stock gets hit around all these headlines, down 12% at the start of the trading session. Yahoo Finance senior health reporter Anjalee Khemlani comes on to talk about the company's previous forecasts on higher-than-expected medical costs and United's managerial change. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here."
    },
    {
        "headline": "Stocks Are Rising After CPI Report. UnitedHealth Drags on the Dow.",
        "text": "The stock market’s rally continued on Tuesday after the consumer price index for April was better than feared despite headaches caused by the White House’s on-again-off-again tariff policy. The Nasdaq Composite was up 1%. The Dow Jones Industrial Average was down 151 points, or 0.4%, but a majority of its members were rising; a double-digit decline for UnitedHealth Group shaved 250 points off the Dow to start the day."
    },
    {
        "headline": "UnitedHealth Group stock tumbles; Andrew Witty steps down as group CEO",
        "text": "UnitedHealth said it would suspend its full-year profit outlook, with an aim to return to growth in 2026."
    },
    {
        "headline": "UnitedHealth Group just switched CEOs and nixed its 2025 guidance",
        "text": "Andrew Witty is stepping down as UnitedHeath Group CEO for personal reasons, the company said Tuesday. He will be replaced by Stephen Hemsley, a longtime UnitedHeath Group executive who was CEO for about a decade and currently chairs the health insurer’s board of directors."
    },
    {
        "headline": "UnitedHealth Suspends Outlook, CEO Steps Down. Yes, It Can Get Worse.",
        "text": "Less than a month after a dramatic cut to UnitedHealth Group’s guidance set off a historic selloff in the insurance giant’s shares, the company has pulled its entire 2025 outlook and announced that its CEO had stepped down. The company said its CEO, Andrew Witty, was stepping down for “personal reasons.” Steep selloffs have greeted UnitedHealth’s past three quarterly reports, culminating in the April guidance cut that led to a 27% two-day tumble in UnitedHealth’s stock price."
    },
    {
        "headline": "UnitedHealth Group Suspends 2025 Guidance, Replaces CEO",
        "text": "UnitedHealth Group Inc. unexpectedly suspended earnings guidance and brought back Chairman and former CEO Stephen Hemsley for the top role, saying Andrew Witty has resigned \"for personal reasons.\" Cynthia Koons reports on Bloomberg Television."
    },
    {
        "headline": "Stocks to Watch Tuesday: Coinbase, Boeing, Hertz, UnitedHealth",
        "text": "↗️ Coinbase (COIN): Shares surged after S&P Dow Jones Indices said the crypto exchange will join the S&P 500 on May 19. ↗️ Boeing (BA): The aviation company's shares edged higher after Bloomberg reported China scrapped a ban on airlines taking delivery of Boeing planes."
    },
    {
        "headline": "UnitedHealth Suspends 2025 Outlook Amid Higher-Than-Expected Medical Costs; CEO Steps Down",
        "text": "UnitedHealth Group (UNH) suspended its full-year outlook on Tuesday amid higher-than-expected medica"
    },
    {
        "headline": "British boss of US healthcare giant UnitedHealth quits for ‘personal reasons’",
        "text": "The move comes five months after one of the company’s top executives was killed after being shot as he walked to an investor conference in New York."
    },
    {
        "headline": "UnitedHealth Stock Is a Big Drag on the Dow",
        "text": "The Dow Jones Industrial Average looked set to open in the red Tuesday after one of its 30 components named a new CEO and suspended its guidance. The blue-chip index was on track to open down 140 points. UnitedHealth stock, down 10% in premarket trading, was on track to shave 214 points off the Dow, putting the index in negative territory on its own."
    },
    {
        "headline": "5 Things to Know Before the Stock Market Opens",
        "text": "News of the day for May 13, 2025"
    },
    {
        "headline": "UnitedHealth CEO Is Out, Sending Shares Lower",
        "text": "Stephen Hemsley will return to running the healthcare giant he helped build, succeeding CEO Andrew Witty."
    },
    {
        "headline": "UnitedHealth CEO steps down for ‘personal reasons’",
        "text": "UnitedHealth Group CEO Andrew Witty is stepping down immediately from his role for “personal reasons,” the company announced Tuesday."
    },
    {
        "headline": "UnitedHealth Stock Tumbles on CEO Departure, Outlook Suspension",
        "text": "Shares of UnitedHealth Group sank sharply on Tuesday as the health insurance giant replaced its CEO and suspended its 2025 outlook."
    },
    {
        "headline": "UnitedHealth Group CEO steps down as company lowers, then withdraws financial outlook for 2025",
        "text": "UnitedHealth CEO Andrew Witty is stepping down for personal reasons and the nation's largest health insurer suspended its full-year financial outlook due to higher-than-expected medical costs. Chairman Stephen Hemsley will become CEO, effective immediately, the Minnesota company said. Hemsley was UnitedHealth Group CEO from 2006 to 2017."
    },
    {
        "headline": "UnitedHealth CEO steps down and largest US health insurer suspends 2025 financial outlook as medical costs rise",
        "text": "UnitedHealth CEO steps down and largest US health insurer suspends 2025 financial outlook as medical costs rise."
    },
    {
        "headline": "UnitedHealth CEO leaves abruptly, company pulls forecast as shares sink",
        "text": "UnitedHealth Group Chief Executive Andrew Witty stepped down suddenly on Tuesday, the company said, as it suspended its 2025 forecast due to surging medical costs, sending its shares plunging more than 11% in morning trading. Former CEO Stephen Hemsley, who has been with the healthcare conglomerate for 28 years, is returning to the top role after stepping down in 2017. Witty chose to leave for personal reasons, the company said, without elaborating."
    },
    {
        "headline": "UnitedHealth Group Announces Leadership Transition",
        "text": "May 13, 2025--UnitedHealth Group (NYSE: UNH) today announced the appointment of Stephen J. Hemsley as its chief executive officer, effective immediately, following Andrew Witty’s decision to step down as CEO for personal reasons. Hemsley, who served as company CEO from 2006-2017, will remain chairman of the company’s Board of Directors and Witty will serve as a senior adviser to Hemsley."
    },
    {
        "headline": "Trump's drug pricing order delivers blow to pharmacy benefit managers",
        "text": "NEW YORK (Reuters) -President Donald Trump on Monday delivered a blow to the private-sector middlemen who negotiate U.S. drug prices in his executive order on drug pricing, saying he would cut them out as part of a goal to bring the U.S. in line with other countries. \"We're going to cut out the middlemen and facilitate the direct sale of drugs at the most favored nation price, directly to the American citizen,\" Trump said during a press conference. The U.S. pays about three times more than other nations for drugs, and Trump's wide-reaching executive order directs pharmaceutical companies to charge similar prices in the U.S. and Europe."
    },
    {
        "headline": "Medicaid Work Requirements Sought to Fund Trump Tax Cuts",
        "text": "(Bloomberg) -- House Republicans want to impose work requirements on some Medicaid recipients up to 64 years old and impose more costs on some beneficiaries to help pay for President Donald Trump’s planned sweeping tax package.Most Read from BloombergA New Central Park Amenity, Tailored to Its East Harlem NeighborsAs Trump Reshapes Housing Policy, Renters Face Rollback of RightsWhat’s Behind the Rise in Serious Injuries on New York City’s Streets?NYC Warns of 17% Drop in Foreign Tourists Due to"
    },
    {
        "headline": "UnitedHealth suspends guidance as CEO steps down. Stock takes hit.",
        "text": "UnitedHealth Group (UNH) is suspending its full-year guidance as the health insurer announced that CEO Andrew Witty will be stepping down on Tuesday. Former CEO Stephen Hemsley will be rejoining the company to lead as chief executive. The company's stock gets hit around all these headlines, down 12% at the start of the trading session. Yahoo Finance senior health reporter Anjalee Khemlani comes on to talk about the company's previous forecasts on higher-than-expected medical costs and United's managerial change. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here."
    },
    {
        "headline": "Stocks Are Rising After CPI Report. UnitedHealth Drags on the Dow.",
        "text": "The stock market’s rally continued on Tuesday after the consumer price index for April was better than feared despite headaches caused by the White House’s on-again-off-again tariff policy. The Nasdaq Composite was up 1%. The Dow Jones Industrial Average was down 151 points, or 0.4%, but a majority of its members were rising; a double-digit decline for UnitedHealth Group shaved 250 points off the Dow to start the day."
    },
    {
        "headline": "UnitedHealth Group stock tumbles; Andrew Witty steps down as group CEO",
        "text": "UnitedHealth said it would suspend its full-year profit outlook, with an aim to return to growth in 2026."
    },
    {
        "headline": "UnitedHealth Group just switched CEOs and nixed its 2025 guidance",
        "text": "Andrew Witty is stepping down as UnitedHeath Group CEO for personal reasons, the company said Tuesday. He will be replaced by Stephen Hemsley, a longtime UnitedHeath Group executive who was CEO for about a decade and currently chairs the health insurer’s board of directors."
    },
    {
        "headline": "UnitedHealth Suspends Outlook, CEO Steps Down. Yes, It Can Get Worse.",
        "text": "Less than a month after a dramatic cut to UnitedHealth Group’s guidance set off a historic selloff in the insurance giant’s shares, the company has pulled its entire 2025 outlook and announced that its CEO had stepped down. The company said its CEO, Andrew Witty, was stepping down for “personal reasons.” Steep selloffs have greeted UnitedHealth’s past three quarterly reports, culminating in the April guidance cut that led to a 27% two-day tumble in UnitedHealth’s stock price."
    },
    {
        "headline": "UnitedHealth Group Suspends 2025 Guidance, Replaces CEO",
        "text": "UnitedHealth Group Inc. unexpectedly suspended earnings guidance and brought back Chairman and former CEO Stephen Hemsley for the top role, saying Andrew Witty has resigned \"for personal reasons.\" Cynthia Koons reports on Bloomberg Television."
    },
    {
        "headline": "Stocks to Watch Tuesday: Coinbase, Boeing, Hertz, UnitedHealth",
        "text": "↗️ Coinbase (COIN): Shares surged after S&P Dow Jones Indices said the crypto exchange will join the S&P 500 on May 19. ↗️ Boeing (BA): The aviation company's shares edged higher after Bloomberg reported China scrapped a ban on airlines taking delivery of Boeing planes."
    },
    {
        "headline": "UnitedHealth Suspends 2025 Outlook Amid Higher-Than-Expected Medical Costs; CEO Steps Down",
        "text": "UnitedHealth Group (UNH) suspended its full-year outlook on Tuesday amid higher-than-expected medica"
    },
    {
        "headline": "British boss of US healthcare giant UnitedHealth quits for ‘personal reasons’",
        "text": "The move comes five months after one of the company’s top executives was killed after being shot as he walked to an investor conference in New York."
    },
    {
        "headline": "UnitedHealth Stock Is a Big Drag on the Dow",
        "text": "The Dow Jones Industrial Average looked set to open in the red Tuesday after one of its 30 components named a new CEO and suspended its guidance. The blue-chip index was on track to open down 140 points. UnitedHealth stock, down 10% in premarket trading, was on track to shave 214 points off the Dow, putting the index in negative territory on its own."
    },
    {
        "headline": "5 Things to Know Before the Stock Market Opens",
        "text": "News of the day for May 13, 2025"
    },
    {
        "headline": "UnitedHealth CEO Is Out, Sending Shares Lower",
        "text": "Stephen Hemsley will return to running the healthcare giant he helped build, succeeding CEO Andrew Witty."
    },
    {
        "headline": "UnitedHealth CEO steps down for ‘personal reasons’",
        "text": "UnitedHealth Group CEO Andrew Witty is stepping down immediately from his role for “personal reasons,” the company announced Tuesday."
    },
    {
        "headline": "UnitedHealth Stock Tumbles on CEO Departure, Outlook Suspension",
        "text": "Shares of UnitedHealth Group sank sharply on Tuesday as the health insurance giant replaced its CEO and suspended its 2025 outlook."
    },
    {
        "headline": "UnitedHealth Group CEO steps down as company lowers, then withdraws financial outlook for 2025",
        "text": "UnitedHealth CEO Andrew Witty is stepping down for personal reasons and the nation's largest health insurer suspended its full-year financial outlook due to higher-than-expected medical costs. Chairman Stephen Hemsley will become CEO, effective immediately, the Minnesota company said. Hemsley was UnitedHealth Group CEO from 2006 to 2017."
    }
]