[
    {
        "headline": "Pharmaceuticals Stocks Q1 In Review: Jazz Pharmaceuticals (NASDAQ:JAZZ) Vs Peers",
        "text": "As the Q1 earnings season wraps, let’s dig into this quarter’s best and worst performers in the pharmaceuticals industry, including Jazz Pharmaceuticals (NASDAQ:JAZZ) and its peers."
    },
    {
        "headline": "Theravance's Q1 Loss Wider Than Expected, Revenues Rise Y/Y",
        "text": "TBPH reports weaker-than-expected first-quarter 2025 results. Collaboration revenues from Viatris rise year over year."
    },
    {
        "headline": "Viatris Inc (VTRS) Q1 2025 Earnings Call Highlights: Navigating Challenges and Capitalizing on ...",
        "text": "Despite a revenue dip and goodwill impairment, Viatris Inc (VTRS) focuses on strategic growth, shareholder returns, and promising new product developments."
    },
    {
        "headline": "Q1 2025 Viatris Inc Earnings Call",
        "text": "Q1 2025 Viatris Inc Earnings Call"
    },
    {
        "headline": "Viatris Q1 Earnings and Revenues Beat Estimates, Stock Gains",
        "text": "VTRS Q1 earnings and sales beat estimates. Brands business continues to perform well backed by expansion of portfolio."
    },
    {
        "headline": "Viatris (NASDAQ:VTRS) Reports Sales Below Analyst Estimates In Q1 Earnings, But Stock Soars 8%",
        "text": "Medication company Viatris (NASDAQ:VTRS) fell short of the market’s revenue expectations in Q1 CY2025, with sales falling 11.2% year on year to $3.25 billion. The company’s full-year revenue guidance of $13.75 billion at the midpoint came in 0.5% below analysts’ estimates. Its non-GAAP profit of $0.50 per share was in line with analysts’ consensus estimates."
    },
    {
        "headline": "Viatris (VTRS) Reports Q1 Earnings: What Key Metrics Have to Say",
        "text": "While the top- and bottom-line numbers for Viatris (VTRS) give a sense of how the business performed in the quarter ended March 2025, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values."
    },
    {
        "headline": "Viatris (VTRS) Beats Q1 Earnings and Revenue Estimates",
        "text": "Viatris (VTRS) delivered earnings and revenue surprises of 2.04% and 0.81%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?"
    },
    {
        "headline": "Viatris: Q1 Earnings Snapshot",
        "text": "CANONSBURG, Pa. AP) — Viatris Inc (VTRS) on Thursday reported a loss of $3.04 billion in its first quarter. On a per-share basis, the Canonsburg, Pennsylvania-based company said it had a loss of $2.55."
    },
    {
        "headline": "Viatris Reports First Quarter 2025 Results and Reaffirms 2025 Outlook",
        "text": "Viatris Inc. (Nasdaq: VTRS) today reported first quarter 2025 financial results and reaffirmed its 2025 outlook[1]."
    },
    {
        "headline": "Viatris Announces Positive Results from Phase 3 Study of Investigational XULANE LO™ Low Dose Patch for Birth Control in Women of Childbearing Potential",
        "text": "Viatris Inc. (Nasdaq: VTRS), a global healthcare company, today announced positive results of its Phase 3 study (NCT05139121) evaluating the contraceptive efficacy and safety of investigational XULANE LO low dose weekly dermal patch of 150 mcg norelgestromin and 17.5 mcg ethinyl estradiol per day in women of childbearing potential. The study evaluated women of childbearing potential (N=1,272) for up to 13 cycles (12,591 safety evaluable cycles and 9,105 efficacy evaluable cycles) across 81 inves"
    },
    {
        "headline": "Viatris Announces Positive Top-Line Results from Two Pivotal Phase 3 Studies of Novel Fast-Acting Meloxicam (MR-107A-02) for the Treatment of Moderate-to-Severe Acute Pain",
        "text": "Viatris Inc. (Nasdaq: VTRS), a global healthcare company, today announced positive results from its Phase 3 program of the novel fast-acting formulation of meloxicam (MR-107A-02) for the treatment of moderate-to-severe acute pain. The Phase 3 program consisted of two randomized, double-blind, placebo-(double-dummy) and active-controlled trials – one following herniorrhaphy surgery (NCT06215859) and one following bunionectomy surgery (NCT06215820). Both trials evaluated the efficacy and safety of"
    },
    {
        "headline": "Viatris Announces Quarterly Dividend",
        "text": "Viatris Inc. (Nasdaq: VTRS) today announced that on May 5, 2025, its Board of Directors declared a quarterly dividend of $0.12 per share for each issued and outstanding share of the Company's common stock. The dividend is payable on June 16, 2025, to shareholders of record as of the close of business on May 23, 2025."
    },
    {
        "headline": "Viatris Earnings: What To Look For From VTRS",
        "text": "Medication company Viatris (NASDAQ:VTRS) will be reporting results tomorrow morning. Here’s what you need to know."
    },
    {
        "headline": "Sector Update: Health Care Stocks Fall Late Afternoon",
        "text": "Health care stocks declined late Tuesday afternoon, with the NYSE Health Care Index falling 2.6% and"
    },
    {
        "headline": "Viatris Announces Appointments of Frank D'Amelio and Michael Severino, M.D., to the Company's Board of Directors",
        "text": "Viatris Inc. (Nasdaq: VTRS), a global healthcare company, today announced that as part of its ongoing Board refreshment efforts, Frank D'Amelio and Michael Severino, M.D., have been appointed as the newest members of Viatris' Board of Directors. In addition, the Company announced that current directors, Rajiv Malik and Harry (Hal) Korman, will retire from the Board at the end of their current terms in December following the Company's 2025 Annual Meeting of Shareholders."
    },
    {
        "headline": "Unveiling Viatris (VTRS) Q1 Outlook: Wall Street Estimates for Key Metrics",
        "text": "Get a deeper insight into the potential performance of Viatris (VTRS) for the quarter ended March 2025 by going beyond Wall Street's top -and-bottom-line estimates and examining the estimates for some of its key metrics."
    },
    {
        "headline": "2 S&P 500 Stocks Worth Investigating and 1 to Avoid",
        "text": "The S&P 500 (^GSPC) is home to the biggest and most well-known companies in the market, making it a go-to index for investors seeking stability. But not all large-cap stocks are created equal - some are struggling with slowing growth, declining margins, or increased competition."
    },
    {
        "headline": "Viatris Q1 Earnings Release: What's in Store for the Stock?",
        "text": "VTRS' Q1 results are likely to gain from new product launches in all major geographies."
    },
    {
        "headline": "Analysts Estimate Viatris (VTRS) to Report a Decline in Earnings: What to Look Out for",
        "text": "Viatris (VTRS) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."
    },
    {
        "headline": "Pharmaceuticals Stocks Q1 In Review: Jazz Pharmaceuticals (NASDAQ:JAZZ) Vs Peers",
        "text": "As the Q1 earnings season wraps, let’s dig into this quarter’s best and worst performers in the pharmaceuticals industry, including Jazz Pharmaceuticals (NASDAQ:JAZZ) and its peers."
    },
    {
        "headline": "Theravance's Q1 Loss Wider Than Expected, Revenues Rise Y/Y",
        "text": "TBPH reports weaker-than-expected first-quarter 2025 results. Collaboration revenues from Viatris rise year over year."
    },
    {
        "headline": "Viatris Inc (VTRS) Q1 2025 Earnings Call Highlights: Navigating Challenges and Capitalizing on ...",
        "text": "Despite a revenue dip and goodwill impairment, Viatris Inc (VTRS) focuses on strategic growth, shareholder returns, and promising new product developments."
    },
    {
        "headline": "Q1 2025 Viatris Inc Earnings Call",
        "text": "Q1 2025 Viatris Inc Earnings Call"
    },
    {
        "headline": "Viatris Q1 Earnings and Revenues Beat Estimates, Stock Gains",
        "text": "VTRS Q1 earnings and sales beat estimates. Brands business continues to perform well backed by expansion of portfolio."
    },
    {
        "headline": "Viatris (NASDAQ:VTRS) Reports Sales Below Analyst Estimates In Q1 Earnings, But Stock Soars 8%",
        "text": "Medication company Viatris (NASDAQ:VTRS) fell short of the market’s revenue expectations in Q1 CY2025, with sales falling 11.2% year on year to $3.25 billion. The company’s full-year revenue guidance of $13.75 billion at the midpoint came in 0.5% below analysts’ estimates. Its non-GAAP profit of $0.50 per share was in line with analysts’ consensus estimates."
    },
    {
        "headline": "Viatris (VTRS) Reports Q1 Earnings: What Key Metrics Have to Say",
        "text": "While the top- and bottom-line numbers for Viatris (VTRS) give a sense of how the business performed in the quarter ended March 2025, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values."
    },
    {
        "headline": "Viatris (VTRS) Beats Q1 Earnings and Revenue Estimates",
        "text": "Viatris (VTRS) delivered earnings and revenue surprises of 2.04% and 0.81%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?"
    },
    {
        "headline": "Viatris: Q1 Earnings Snapshot",
        "text": "CANONSBURG, Pa. AP) — Viatris Inc (VTRS) on Thursday reported a loss of $3.04 billion in its first quarter. On a per-share basis, the Canonsburg, Pennsylvania-based company said it had a loss of $2.55."
    },
    {
        "headline": "Viatris Reports First Quarter 2025 Results and Reaffirms 2025 Outlook",
        "text": "Viatris Inc. (Nasdaq: VTRS) today reported first quarter 2025 financial results and reaffirmed its 2025 outlook[1]."
    },
    {
        "headline": "Viatris Announces Positive Results from Phase 3 Study of Investigational XULANE LO™ Low Dose Patch for Birth Control in Women of Childbearing Potential",
        "text": "Viatris Inc. (Nasdaq: VTRS), a global healthcare company, today announced positive results of its Phase 3 study (NCT05139121) evaluating the contraceptive efficacy and safety of investigational XULANE LO low dose weekly dermal patch of 150 mcg norelgestromin and 17.5 mcg ethinyl estradiol per day in women of childbearing potential. The study evaluated women of childbearing potential (N=1,272) for up to 13 cycles (12,591 safety evaluable cycles and 9,105 efficacy evaluable cycles) across 81 inves"
    },
    {
        "headline": "Viatris Announces Positive Top-Line Results from Two Pivotal Phase 3 Studies of Novel Fast-Acting Meloxicam (MR-107A-02) for the Treatment of Moderate-to-Severe Acute Pain",
        "text": "Viatris Inc. (Nasdaq: VTRS), a global healthcare company, today announced positive results from its Phase 3 program of the novel fast-acting formulation of meloxicam (MR-107A-02) for the treatment of moderate-to-severe acute pain. The Phase 3 program consisted of two randomized, double-blind, placebo-(double-dummy) and active-controlled trials – one following herniorrhaphy surgery (NCT06215859) and one following bunionectomy surgery (NCT06215820). Both trials evaluated the efficacy and safety of"
    },
    {
        "headline": "Viatris Announces Quarterly Dividend",
        "text": "Viatris Inc. (Nasdaq: VTRS) today announced that on May 5, 2025, its Board of Directors declared a quarterly dividend of $0.12 per share for each issued and outstanding share of the Company's common stock. The dividend is payable on June 16, 2025, to shareholders of record as of the close of business on May 23, 2025."
    },
    {
        "headline": "Viatris Earnings: What To Look For From VTRS",
        "text": "Medication company Viatris (NASDAQ:VTRS) will be reporting results tomorrow morning. Here’s what you need to know."
    },
    {
        "headline": "Sector Update: Health Care Stocks Fall Late Afternoon",
        "text": "Health care stocks declined late Tuesday afternoon, with the NYSE Health Care Index falling 2.6% and"
    },
    {
        "headline": "Viatris Announces Appointments of Frank D'Amelio and Michael Severino, M.D., to the Company's Board of Directors",
        "text": "Viatris Inc. (Nasdaq: VTRS), a global healthcare company, today announced that as part of its ongoing Board refreshment efforts, Frank D'Amelio and Michael Severino, M.D., have been appointed as the newest members of Viatris' Board of Directors. In addition, the Company announced that current directors, Rajiv Malik and Harry (Hal) Korman, will retire from the Board at the end of their current terms in December following the Company's 2025 Annual Meeting of Shareholders."
    },
    {
        "headline": "Unveiling Viatris (VTRS) Q1 Outlook: Wall Street Estimates for Key Metrics",
        "text": "Get a deeper insight into the potential performance of Viatris (VTRS) for the quarter ended March 2025 by going beyond Wall Street's top -and-bottom-line estimates and examining the estimates for some of its key metrics."
    },
    {
        "headline": "2 S&P 500 Stocks Worth Investigating and 1 to Avoid",
        "text": "The S&P 500 (^GSPC) is home to the biggest and most well-known companies in the market, making it a go-to index for investors seeking stability. But not all large-cap stocks are created equal - some are struggling with slowing growth, declining margins, or increased competition."
    },
    {
        "headline": "Viatris Q1 Earnings Release: What's in Store for the Stock?",
        "text": "VTRS' Q1 results are likely to gain from new product launches in all major geographies."
    },
    {
        "headline": "Analysts Estimate Viatris (VTRS) to Report a Decline in Earnings: What to Look Out for",
        "text": "Viatris (VTRS) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."
    },
    {
        "headline": "Viatris Inc. (VTRS): Among the Worst Performing Stocks in S&P 500 So Far in 2025",
        "text": "We recently published a list of the 11 Worst Performing Stocks in S&P 500 So Far in 2025. In this article, we will take a look at where Viatris Inc. (NASDAQ:VTRS) stands against other worst performing stocks this year. After a two-year surge of 53%, marking the best performance for the broad market index since […]"
    },
    {
        "headline": "Viatris Inc. (VTRS): One of the Cheap Quarterly Dividend Stocks to Buy Now",
        "text": "We recently published a list of the 10 Cheap Quarterly Dividend Stocks to Buy Now. In this article, we are going to take a look at where Viatris Inc. (NASDAQ:VTRS) stands against other overlooked dividend stocks. In the current market environment, investors are looking to seek stable income as a way to protect themselves against a […]"
    },
    {
        "headline": "Generic Pharmaceuticals Stocks Q4 Teardown: Viatris (NASDAQ:VTRS) Vs The Rest",
        "text": "Let’s dig into the relative performance of Viatris (NASDAQ:VTRS) and its peers as we unravel the now-completed Q4 generic pharmaceuticals earnings season."
    },
    {
        "headline": "Viatris Inc. (VTRS): Among Billionaire Ken Fisher’s Healthcare Stock Picks with Massive Upside Potential",
        "text": "We recently published a list of Billionaire Ken Fisher’s 10 Healthcare Stock Picks with Massive Upside Potential. In this article, we are going to take a look at where Viatris Inc. (NASDAQ:VTRS) stands against other Billionaire Ken Fisher’s healthcare stock picks with massive upside potential. The healthcare industry, an essential component of global well-being and […]"
    },
    {
        "headline": "Viatris to Present at the BofA Securities 2025 Healthcare Conference",
        "text": "Viatris Inc. (Nasdaq: VTRS), a global healthcare company, will present at the BofA Securities 2025 Healthcare Conference in Las Vegas, NV, on Tuesday, May 13, 2025. The company's presentation will begin at 5 p.m. PT / 8 p.m. ET."
    },
    {
        "headline": "3 Reasons VTRS is Risky and 1 Stock to Buy Instead",
        "text": "Viatris’s stock price has taken a beating over the past six months, shedding 33% of its value and falling to $7.69 per share. This was partly due to its softer quarterly results and might have investors contemplating their next move."
    },
    {
        "headline": "Is Viatris Inc. (NASDAQ:VTRS) the Best Cheap Stock to Buy Under $10?",
        "text": "We recently published a list of the 10 Best Cheap Stocks to Buy Under $10. In this article, we are going to take a look at where Viatris Inc. (NASDAQ:VTRS) stands against other cheap stocks to buy under $10. On April 21, Tom Lee, Fundstrat CIO, co-founder, and managing partner, joined ‘Squawk Box’ on CNBC […]"
    },
    {
        "headline": "Viatris Files Supplemental New Drug Applications to Japan's Ministry of Health, Labor and Welfare for the Approval of EFFEXOR® for the Treatment of Generalized Anxiety Disorder",
        "text": "Viatris Inc. (Nasdaq: VTRS), a global healthcare company, today announced it has filed applications to the Ministry of Health, Labor and Welfare (MHLW) for approval of Effexor SR Capsules (venlafaxine hydrochloride), a serotonin-noradrenaline reuptake inhibitor (SNRI) to treat adults with generalized anxiety disorder (GAD), an indication for which no other treatment option is currently approved in Japan."
    },
    {
        "headline": "Pharmaceuticals Stocks Q4 In Review: Jazz Pharmaceuticals (NASDAQ:JAZZ) Vs Peers",
        "text": "Earnings results often indicate what direction a company will take in the months ahead. With Q4 behind us, let’s have a look at Jazz Pharmaceuticals (NASDAQ:JAZZ) and its peers."
    },
    {
        "headline": "Is Viatris Inc. (VTRS) The Top Healthcare Stock to Buy According to Billionaire David Einhorn?",
        "text": "We recently published a list of Top 9 Healthcare Stocks to Buy According to Billionaire David Einhorn. In this article, we are going to take a look at where Viatris Inc. (NASDAQ:VTRS) stands against other top healthcare stocks to buy according to billionaire David Einhorn. Wall Street has come down crashing on President Donald Trump’s […]"
    },
    {
        "headline": "Viatris Appoints Hemanth J. Varghese as Chief Strategy Officer",
        "text": "Viatris Inc. (Nasdaq: VTRS) today announced that Hemanth J. Varghese has joined the Company as Chief Strategy Officer. Varghese will be a member of the Company's Executive Leadership Team."
    },
    {
        "headline": "Viatris Inc. (VTRS): Among the High-Dividend Stocks to Invest In Under $10",
        "text": "We recently published a list of the 13 High-Dividend Stocks to Invest In Under $10. In this article, we are going to take a look at where Viatris Inc. (NASDAQ:VTRS) stands against other high-dividend stocks under $10. Investors often favor dividend stocks for their long-term potential, with their appeal stemming from the consistent growth they […]"
    },
    {
        "headline": "3 Hated Stocks with Mounting Challenges",
        "text": "Rock-bottom prices don't always mean rock-bottom businesses. The stocks we're examining today have all touched their 52-week lows, creating a classic investor's dilemma: bargain opportunity or value trap?"
    },
    {
        "headline": "3 Beaten-Down Stocks That Are Trading Below Their Book Values",
        "text": "A company's book value is equal to its total assets, less its liabilities. Book value does not consider the future at all. For investors, deals can be had when an otherwise solid company has stock trading below its book value per share (BVPS)."
    },
    {
        "headline": "Viatris to Pay $335 Million for Settlement of Opioid-Related Claims",
        "text": "VTRS has reached an agreement of $335 million to resolve opioid-related claims by states, local governments, and tribes against it and certain of its subsidiaries."
    }
]